; ModuleID = '/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/CDC.cpp'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/CDC.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%struct.ring_buffer = type { [512 x i8], i32, i32 }
%struct.CDCDescriptor = type { %struct.IADDescriptor, %struct.InterfaceDescriptor, %struct.CDCCSInterfaceDescriptor, %struct.CMFunctionalDescriptor, %struct.ACMFunctionalDescriptor, %struct.CDCCSInterfaceDescriptor, %struct.EndpointDescriptor, %struct.InterfaceDescriptor, %struct.EndpointDescriptor, %struct.EndpointDescriptor }
%struct.IADDescriptor = type { i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.CMFunctionalDescriptor = type { i8, i8, i8, i8, i8 }
%struct.ACMFunctionalDescriptor = type { i8, i8, i8, i8 }
%struct.CDCCSInterfaceDescriptor = type { i8, i8, i8, i8, i8 }
%struct.InterfaceDescriptor = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.EndpointDescriptor = type <{ i8, i8, i8, i8, i16, i8 }>
%struct.LineInfo = type { i32, i8, i8, i8, i8 }
%class.Serial_ = type { %class.Stream, %class.RingBuffer* }
%class.Stream = type { %class.Print, i32, i32 }
%class.Print = type { i32 (...)**, i32 }
%class.RingBuffer = type { [128 x i8], i32, i32 }
%struct.USBSetup = type { i8, i8, i8, i8, i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cdc_rx_buffer", scope: !2, file: !142, line: 39, type: !649, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !139, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/CDC.cpp", directory: "/home/aaa/llvm-arduino-due")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LookaheadMode", file: !6, line: 41, baseType: !7, size: 8, elements: !8, identifier: "_ZTS13LookaheadMode")
!6 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/Stream.h", directory: "/home/aaa")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "SKIP_ALL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "SKIP_NONE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "SKIP_WHITESPACE", value: 2, isUnsigned: true)
!12 = !{!13, !14, !19, !22, !21}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !15, line: 54, baseType: !16)
!15 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !17, line: 38, baseType: !18)
!17 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!18 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 66, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 56, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uotghs", file: !24, line: 123, baseType: !25)
!24 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_uotghs.h", directory: "/home/aaa")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 57, size: 16768, flags: DIFlagTypePassByValue, elements: !26, identifier: "_ZTS6Uotghs")
!26 = !{!27, !31, !33, !35, !36, !37, !38, !39, !40, !41, !45, !49, !53, !55, !56, !58, !59, !60, !61, !62, !63, !64, !65, !66, !70, !81, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !122, !131, !132, !133, !134, !135, !136, !138}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVCTRL", scope: !25, file: !24, line: 58, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !29, line: 54, baseType: !30)
!29 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/sam3x8e.h", directory: "/home/aaa")
!30 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVISR", scope: !25, file: !24, line: 59, baseType: !32, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !29, line: 51, baseType: !30)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVICR", scope: !25, file: !24, line: 60, baseType: !34, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !29, line: 53, baseType: !30)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIFR", scope: !25, file: !24, line: 61, baseType: !34, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIMR", scope: !25, file: !24, line: 62, baseType: !32, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIDR", scope: !25, file: !24, line: 63, baseType: !34, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIER", scope: !25, file: !24, line: 64, baseType: !34, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPT", scope: !25, file: !24, line: 65, baseType: !28, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVFNUM", scope: !25, file: !24, line: 66, baseType: !32, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !25, file: !24, line: 67, baseType: !42, size: 1760, offset: 288)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1760, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 55)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTCFG", scope: !25, file: !24, line: 68, baseType: !46, size: 320, offset: 2048)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 320, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 10)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !25, file: !24, line: 69, baseType: !50, size: 64, offset: 2368)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 2)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTISR", scope: !25, file: !24, line: 70, baseType: !54, size: 320, offset: 2432)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 320, elements: !47)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !25, file: !24, line: 71, baseType: !50, size: 64, offset: 2752)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTICR", scope: !25, file: !24, line: 72, baseType: !57, size: 320, offset: 2816)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 320, elements: !47)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !25, file: !24, line: 73, baseType: !50, size: 64, offset: 3136)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIFR", scope: !25, file: !24, line: 74, baseType: !57, size: 320, offset: 3200)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !25, file: !24, line: 75, baseType: !50, size: 64, offset: 3520)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIMR", scope: !25, file: !24, line: 76, baseType: !54, size: 320, offset: 3584)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !25, file: !24, line: 77, baseType: !50, size: 64, offset: 3904)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIER", scope: !25, file: !24, line: 78, baseType: !57, size: 320, offset: 3968)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !25, file: !24, line: 79, baseType: !50, size: 64, offset: 4288)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIDR", scope: !25, file: !24, line: 80, baseType: !57, size: 320, offset: 4352)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !25, file: !24, line: 81, baseType: !67, size: 1600, offset: 4672)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1600, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 50)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMA", scope: !25, file: !24, line: 82, baseType: !71, size: 896, offset: 6272)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 896, elements: !79)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "UotghsDevdma", file: !24, line: 46, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 41, size: 128, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS12UotghsDevdma")
!74 = !{!75, !76, !77, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMANXTDSC", scope: !73, file: !24, line: 42, baseType: !28, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMAADDRESS", scope: !73, file: !24, line: 43, baseType: !28, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMACONTROL", scope: !73, file: !24, line: 44, baseType: !28, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMASTATUS", scope: !73, file: !24, line: 45, baseType: !28, size: 32, offset: 96)
!79 = !{!80}
!80 = !DISubrange(count: 7)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !25, file: !24, line: 83, baseType: !82, size: 1024, offset: 7168)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1024, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTCTRL", scope: !25, file: !24, line: 84, baseType: !28, size: 32, offset: 8192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTISR", scope: !25, file: !24, line: 85, baseType: !32, size: 32, offset: 8224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTICR", scope: !25, file: !24, line: 86, baseType: !34, size: 32, offset: 8256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIFR", scope: !25, file: !24, line: 87, baseType: !34, size: 32, offset: 8288)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIMR", scope: !25, file: !24, line: 88, baseType: !32, size: 32, offset: 8320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIDR", scope: !25, file: !24, line: 89, baseType: !34, size: 32, offset: 8352)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIER", scope: !25, file: !24, line: 90, baseType: !34, size: 32, offset: 8384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIP", scope: !25, file: !24, line: 91, baseType: !28, size: 32, offset: 8416)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTFNUM", scope: !25, file: !24, line: 92, baseType: !28, size: 32, offset: 8448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR1", scope: !25, file: !24, line: 93, baseType: !28, size: 32, offset: 8480)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR2", scope: !25, file: !24, line: 94, baseType: !28, size: 32, offset: 8512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR3", scope: !25, file: !24, line: 95, baseType: !28, size: 32, offset: 8544)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved10", scope: !25, file: !24, line: 96, baseType: !98, size: 1664, offset: 8576)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1664, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 52)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPCFG", scope: !25, file: !24, line: 97, baseType: !46, size: 320, offset: 10240)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !25, file: !24, line: 98, baseType: !50, size: 64, offset: 10560)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPISR", scope: !25, file: !24, line: 99, baseType: !54, size: 320, offset: 10624)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved12", scope: !25, file: !24, line: 100, baseType: !50, size: 64, offset: 10944)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPICR", scope: !25, file: !24, line: 101, baseType: !57, size: 320, offset: 11008)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved13", scope: !25, file: !24, line: 102, baseType: !50, size: 64, offset: 11328)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIFR", scope: !25, file: !24, line: 103, baseType: !57, size: 320, offset: 11392)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved14", scope: !25, file: !24, line: 104, baseType: !50, size: 64, offset: 11712)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIMR", scope: !25, file: !24, line: 105, baseType: !54, size: 320, offset: 11776)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved15", scope: !25, file: !24, line: 106, baseType: !50, size: 64, offset: 12096)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIER", scope: !25, file: !24, line: 107, baseType: !57, size: 320, offset: 12160)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved16", scope: !25, file: !24, line: 108, baseType: !50, size: 64, offset: 12480)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIDR", scope: !25, file: !24, line: 109, baseType: !57, size: 320, offset: 12544)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved17", scope: !25, file: !24, line: 110, baseType: !50, size: 64, offset: 12864)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPINRQ", scope: !25, file: !24, line: 111, baseType: !46, size: 320, offset: 12928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved18", scope: !25, file: !24, line: 112, baseType: !50, size: 64, offset: 13248)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPERR", scope: !25, file: !24, line: 113, baseType: !46, size: 320, offset: 13312)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved19", scope: !25, file: !24, line: 114, baseType: !119, size: 832, offset: 13632)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 832, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 26)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMA", scope: !25, file: !24, line: 115, baseType: !123, size: 896, offset: 14464)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 896, elements: !79)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "UotghsHstdma", file: !24, line: 53, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 48, size: 128, flags: DIFlagTypePassByValue, elements: !126, identifier: "_ZTS12UotghsHstdma")
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMANXTDSC", scope: !125, file: !24, line: 49, baseType: !28, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMAADDRESS", scope: !125, file: !24, line: 50, baseType: !28, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMACONTROL", scope: !125, file: !24, line: 51, baseType: !28, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMASTATUS", scope: !125, file: !24, line: 52, baseType: !28, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved20", scope: !25, file: !24, line: 116, baseType: !82, size: 1024, offset: 15360)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_CTRL", scope: !25, file: !24, line: 117, baseType: !28, size: 32, offset: 16384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SR", scope: !25, file: !24, line: 118, baseType: !32, size: 32, offset: 16416)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SCR", scope: !25, file: !24, line: 119, baseType: !34, size: 32, offset: 16448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SFR", scope: !25, file: !24, line: 120, baseType: !34, size: 32, offset: 16480)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved21", scope: !25, file: !24, line: 121, baseType: !137, size: 224, offset: 16512)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 224, elements: !79)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_FSM", scope: !25, file: !24, line: 122, baseType: !32, size: 32, offset: 16736)
!139 = !{!0, !140, !144, !559, !561, !633, !635, !646}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "_serialPeek", scope: !2, file: !142, line: 156, type: !143, isLocal: false, isDefinition: true)
!142 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/CDC.cpp", directory: "/home/aaa")
!143 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "guard", scope: !146, file: !142, line: 176, type: !19, isLocal: true, isDefinition: true)
!146 = distinct !DISubprogram(name: "accept", linkageName: "_ZN7Serial_6acceptEv", scope: !147, file: !142, line: 174, type: !522, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !528, retainedNodes: !558)
!147 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Serial_", file: !148, line: 47, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !149, vtableHolder: !154)
!148 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBAPI.h", directory: "/home/aaa")
!149 = !{!150, !510, !514, !518, !521, !524, !527, !528, !529, !530, !531, !532, !535, !540, !543, !548, !551, !554, !555, !556, !557}
!150 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !147, baseType: !151, flags: DIFlagPublic, extraData: i32 0)
!151 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !6, line: 49, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !152, vtableHolder: !154, identifier: "_ZTS6Stream")
!152 = !{!153, !156, !158, !159, !163, !164, !168, !169, !170, !171, !174, !175, !178, !181, !186, !192, !197, !200, !203, !206, !209, !212, !215, !219, !223, !226, !229, !232, !235, !496, !499, !502, !505}
!153 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !151, baseType: !154, flags: DIFlagPublic, extraData: i32 0)
!154 = !DICompositeType(tag: DW_TAG_class_type, name: "Print", file: !155, line: 34, flags: DIFlagFwdDecl)
!155 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/Print.h", directory: "/home/aaa")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !151, file: !6, line: 52, baseType: !157, size: 32, offset: 64, flags: DIFlagProtected)
!157 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_startMillis", scope: !151, file: !6, line: 53, baseType: !157, size: 32, offset: 96, flags: DIFlagProtected)
!159 = !DISubprogram(name: "timedRead", linkageName: "_ZN6Stream9timedReadEv", scope: !151, file: !6, line: 54, type: !160, scopeLine: 54, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!160 = !DISubroutineType(types: !161)
!161 = !{!143, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!163 = !DISubprogram(name: "timedPeek", linkageName: "_ZN6Stream9timedPeekEv", scope: !151, file: !6, line: 55, type: !160, scopeLine: 55, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!164 = !DISubprogram(name: "peekNextDigit", linkageName: "_ZN6Stream13peekNextDigitE13LookaheadModeb", scope: !151, file: !6, line: 56, type: !165, scopeLine: 56, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{!143, !162, !5, !167}
!167 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!168 = !DISubprogram(name: "available", linkageName: "_ZN6Stream9availableEv", scope: !151, file: !6, line: 59, type: !160, scopeLine: 59, containingType: !151, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!169 = !DISubprogram(name: "read", linkageName: "_ZN6Stream4readEv", scope: !151, file: !6, line: 60, type: !160, scopeLine: 60, containingType: !151, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!170 = !DISubprogram(name: "peek", linkageName: "_ZN6Stream4peekEv", scope: !151, file: !6, line: 61, type: !160, scopeLine: 61, containingType: !151, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!171 = !DISubprogram(name: "flush", linkageName: "_ZN6Stream5flushEv", scope: !151, file: !6, line: 62, type: !172, scopeLine: 62, containingType: !151, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !162}
!174 = !DISubprogram(name: "Stream", scope: !151, file: !6, line: 64, type: !172, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!175 = !DISubprogram(name: "setTimeout", linkageName: "_ZN6Stream10setTimeoutEm", scope: !151, file: !6, line: 68, type: !176, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !162, !157}
!178 = !DISubprogram(name: "getTimeout", linkageName: "_ZN6Stream10getTimeoutEv", scope: !151, file: !6, line: 69, type: !179, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{!157, !162}
!181 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPc", scope: !151, file: !6, line: 71, type: !182, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!182 = !DISubroutineType(types: !183)
!183 = !{!167, !162, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!186 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPh", scope: !151, file: !6, line: 72, type: !187, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!187 = !DISubroutineType(types: !188)
!188 = !{!167, !162, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 42, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 28, baseType: !7)
!192 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPcj", scope: !151, file: !6, line: 75, type: !193, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{!167, !162, !184, !195}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !196, line: 46, baseType: !21)
!196 = !DIFile(filename: "JJS_Project1/src/build/lib/clang/10.0.1/include/stddef.h", directory: "/home/aaa")
!197 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPhj", scope: !151, file: !6, line: 76, type: !198, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!198 = !DISubroutineType(types: !199)
!199 = !{!167, !162, !189, !195}
!200 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEc", scope: !151, file: !6, line: 79, type: !201, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{!167, !162, !185}
!203 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPcS0_", scope: !151, file: !6, line: 81, type: !204, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!204 = !DISubroutineType(types: !205)
!205 = !{!167, !162, !184, !184}
!206 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPhPc", scope: !151, file: !6, line: 82, type: !207, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{!167, !162, !189, !184}
!209 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPcjS0_j", scope: !151, file: !6, line: 84, type: !210, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{!167, !162, !184, !195, !184, !195}
!212 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPhjPcj", scope: !151, file: !6, line: 85, type: !213, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!213 = !DISubroutineType(types: !214)
!214 = !{!167, !162, !189, !195, !184, !195}
!215 = !DISubprogram(name: "parseInt", linkageName: "_ZN6Stream8parseIntE13LookaheadModec", scope: !151, file: !6, line: 87, type: !216, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !162, !5, !185}
!218 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!219 = !DISubprogram(name: "parseFloat", linkageName: "_ZN6Stream10parseFloatE13LookaheadModec", scope: !151, file: !6, line: 94, type: !220, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!220 = !DISubroutineType(types: !221)
!221 = !{!222, !162, !5, !185}
!222 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!223 = !DISubprogram(name: "readBytes", linkageName: "_ZN6Stream9readBytesEPcj", scope: !151, file: !6, line: 97, type: !224, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!224 = !DISubroutineType(types: !225)
!225 = !{!195, !162, !184, !195}
!226 = !DISubprogram(name: "readBytes", linkageName: "_ZN6Stream9readBytesEPhj", scope: !151, file: !6, line: 98, type: !227, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{!195, !162, !189, !195}
!229 = !DISubprogram(name: "readBytesUntil", linkageName: "_ZN6Stream14readBytesUntilEcPcj", scope: !151, file: !6, line: 102, type: !230, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!230 = !DISubroutineType(types: !231)
!231 = !{!195, !162, !185, !184, !195}
!232 = !DISubprogram(name: "readBytesUntil", linkageName: "_ZN6Stream14readBytesUntilEcPhj", scope: !151, file: !6, line: 103, type: !233, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!233 = !DISubroutineType(types: !234)
!234 = !{!195, !162, !185, !189, !195}
!235 = !DISubprogram(name: "readString", linkageName: "_ZN6Stream10readStringEv", scope: !151, file: !6, line: 108, type: !236, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !162}
!238 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "String", file: !239, line: 45, size: 96, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !240, identifier: "_ZTS6String")
!239 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/WString.h", directory: "/home/aaa")
!240 = !{!241, !242, !243, !244, !249, !255, !259, !265, !269, !274, !277, !280, !283, !286, !289, !292, !295, !299, !302, !305, !308, !312, !315, !318, !321, !324, !327, !330, !333, !336, !339, !340, !343, !346, !349, !352, !355, !356, !357, !360, !363, !366, !369, !372, !375, !378, !381, !382, !387, !390, !393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !409, !410, !413, !416, !417, !421, !425, !428, !431, !434, !435, !436, !437, !440, !443, !444, !447, !448, !449, !450, !451, !454, !457, !460, !463, !466, !469, !470, !471, !472, !475, !478, !481, !482, !483, !484, !487, !490, !493}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !238, file: !239, line: 196, baseType: !184, size: 32, flags: DIFlagProtected)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !238, file: !239, line: 197, baseType: !21, size: 32, offset: 32, flags: DIFlagProtected)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !238, file: !239, line: 198, baseType: !21, size: 32, offset: 64, flags: DIFlagProtected)
!244 = !DISubprogram(name: "StringIfHelper", linkageName: "_ZNK6String14StringIfHelperEv", scope: !238, file: !239, line: 51, type: !245, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!249 = !DISubprogram(name: "String", scope: !238, file: !239, line: 59, type: !250, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !252, !253}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!255 = !DISubprogram(name: "String", scope: !238, file: !239, line: 60, type: !256, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !252, !258}
!258 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !248, size: 32)
!259 = !DISubprogram(name: "String", scope: !238, file: !239, line: 61, type: !260, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !252, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_class_type, name: "__FlashStringHelper", file: !239, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTS19__FlashStringHelper")
!265 = !DISubprogram(name: "String", scope: !238, file: !239, line: 63, type: !266, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !252, !268}
!268 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !238, size: 32)
!269 = !DISubprogram(name: "String", scope: !238, file: !239, line: 64, type: !270, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !252, !272}
!272 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !273, size: 32)
!273 = !DICompositeType(tag: DW_TAG_class_type, name: "StringSumHelper", file: !239, line: 213, flags: DIFlagFwdDecl, identifier: "_ZTS15StringSumHelper")
!274 = !DISubprogram(name: "String", scope: !238, file: !239, line: 66, type: !275, scopeLine: 66, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !252, !185}
!277 = !DISubprogram(name: "String", scope: !238, file: !239, line: 67, type: !278, scopeLine: 67, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !252, !7, !7}
!280 = !DISubprogram(name: "String", scope: !238, file: !239, line: 68, type: !281, scopeLine: 68, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !252, !143, !7}
!283 = !DISubprogram(name: "String", scope: !238, file: !239, line: 69, type: !284, scopeLine: 69, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !252, !21, !7}
!286 = !DISubprogram(name: "String", scope: !238, file: !239, line: 70, type: !287, scopeLine: 70, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !252, !218, !7}
!289 = !DISubprogram(name: "String", scope: !238, file: !239, line: 71, type: !290, scopeLine: 71, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !252, !157, !7}
!292 = !DISubprogram(name: "String", scope: !238, file: !239, line: 72, type: !293, scopeLine: 72, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !252, !222, !7}
!295 = !DISubprogram(name: "String", scope: !238, file: !239, line: 73, type: !296, scopeLine: 73, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !252, !298, !7}
!298 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!299 = !DISubprogram(name: "~String", scope: !238, file: !239, line: 74, type: !300, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !252}
!302 = !DISubprogram(name: "reserve", linkageName: "_ZN6String7reserveEj", scope: !238, file: !239, line: 80, type: !303, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{!7, !252, !21}
!305 = !DISubprogram(name: "length", linkageName: "_ZNK6String6lengthEv", scope: !238, file: !239, line: 81, type: !306, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!306 = !DISubroutineType(types: !307)
!307 = !{!21, !247}
!308 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSERKS_", scope: !238, file: !239, line: 86, type: !309, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !252, !258}
!311 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !238, size: 32)
!312 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPKc", scope: !238, file: !239, line: 87, type: !313, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!313 = !DISubroutineType(types: !314)
!314 = !{!311, !252, !253}
!315 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPK19__FlashStringHelper", scope: !238, file: !239, line: 88, type: !316, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!316 = !DISubroutineType(types: !317)
!317 = !{!311, !252, !262}
!318 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEOS_", scope: !238, file: !239, line: 90, type: !319, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!319 = !DISubroutineType(types: !320)
!320 = !{!311, !252, !268}
!321 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEO15StringSumHelper", scope: !238, file: !239, line: 91, type: !322, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!322 = !DISubroutineType(types: !323)
!323 = !{!311, !252, !272}
!324 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatERKS_", scope: !238, file: !239, line: 99, type: !325, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!325 = !DISubroutineType(types: !326)
!326 = !{!7, !252, !258}
!327 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPKc", scope: !238, file: !239, line: 100, type: !328, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!328 = !DISubroutineType(types: !329)
!329 = !{!7, !252, !253}
!330 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEc", scope: !238, file: !239, line: 101, type: !331, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!331 = !DISubroutineType(types: !332)
!332 = !{!7, !252, !185}
!333 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEh", scope: !238, file: !239, line: 102, type: !334, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!334 = !DISubroutineType(types: !335)
!335 = !{!7, !252, !7}
!336 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEi", scope: !238, file: !239, line: 103, type: !337, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!7, !252, !143}
!339 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEj", scope: !238, file: !239, line: 104, type: !303, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!340 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEl", scope: !238, file: !239, line: 105, type: !341, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!341 = !DISubroutineType(types: !342)
!342 = !{!7, !252, !218}
!343 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEm", scope: !238, file: !239, line: 106, type: !344, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!344 = !DISubroutineType(types: !345)
!345 = !{!7, !252, !157}
!346 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEf", scope: !238, file: !239, line: 107, type: !347, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!347 = !DISubroutineType(types: !348)
!348 = !{!7, !252, !222}
!349 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEd", scope: !238, file: !239, line: 108, type: !350, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!350 = !DISubroutineType(types: !351)
!351 = !{!7, !252, !298}
!352 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPK19__FlashStringHelper", scope: !238, file: !239, line: 109, type: !353, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!353 = !DISubroutineType(types: !354)
!354 = !{!7, !252, !262}
!355 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLERKS_", scope: !238, file: !239, line: 113, type: !309, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!356 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPKc", scope: !238, file: !239, line: 114, type: !313, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!357 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEc", scope: !238, file: !239, line: 115, type: !358, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!311, !252, !185}
!360 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEh", scope: !238, file: !239, line: 116, type: !361, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!361 = !DISubroutineType(types: !362)
!362 = !{!311, !252, !7}
!363 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEi", scope: !238, file: !239, line: 117, type: !364, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!364 = !DISubroutineType(types: !365)
!365 = !{!311, !252, !143}
!366 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEj", scope: !238, file: !239, line: 118, type: !367, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!311, !252, !21}
!369 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEl", scope: !238, file: !239, line: 119, type: !370, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!311, !252, !218}
!372 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEm", scope: !238, file: !239, line: 120, type: !373, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!373 = !DISubroutineType(types: !374)
!374 = !{!311, !252, !157}
!375 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEf", scope: !238, file: !239, line: 121, type: !376, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!376 = !DISubroutineType(types: !377)
!377 = !{!311, !252, !222}
!378 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEd", scope: !238, file: !239, line: 122, type: !379, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!379 = !DISubroutineType(types: !380)
!380 = !{!311, !252, !298}
!381 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPK19__FlashStringHelper", scope: !238, file: !239, line: 123, type: !316, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!382 = !DISubprogram(name: "operator void (String::*)() const", linkageName: "_ZNK6StringcvMS_KFvvEEv", scope: !238, file: !239, line: 138, type: !383, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !247}
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringIfHelperType", scope: !238, file: !239, line: 50, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !245, size: 64, extraData: !238)
!387 = !DISubprogram(name: "compareTo", linkageName: "_ZNK6String9compareToERKS_", scope: !238, file: !239, line: 139, type: !388, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{!143, !247, !258}
!390 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsERKS_", scope: !238, file: !239, line: 140, type: !391, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!391 = !DISubroutineType(types: !392)
!392 = !{!7, !247, !258}
!393 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsEPKc", scope: !238, file: !239, line: 141, type: !394, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{!7, !247, !253}
!396 = !DISubprogram(name: "operator==", linkageName: "_ZNK6StringeqERKS_", scope: !238, file: !239, line: 142, type: !391, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!397 = !DISubprogram(name: "operator==", linkageName: "_ZNK6StringeqEPKc", scope: !238, file: !239, line: 143, type: !394, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubprogram(name: "operator!=", linkageName: "_ZNK6StringneERKS_", scope: !238, file: !239, line: 144, type: !391, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!399 = !DISubprogram(name: "operator!=", linkageName: "_ZNK6StringneEPKc", scope: !238, file: !239, line: 145, type: !394, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!400 = !DISubprogram(name: "operator<", linkageName: "_ZNK6StringltERKS_", scope: !238, file: !239, line: 146, type: !391, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!401 = !DISubprogram(name: "operator>", linkageName: "_ZNK6StringgtERKS_", scope: !238, file: !239, line: 147, type: !391, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubprogram(name: "operator<=", linkageName: "_ZNK6StringleERKS_", scope: !238, file: !239, line: 148, type: !391, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!403 = !DISubprogram(name: "operator>=", linkageName: "_ZNK6StringgeERKS_", scope: !238, file: !239, line: 149, type: !391, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!404 = !DISubprogram(name: "equalsIgnoreCase", linkageName: "_ZNK6String16equalsIgnoreCaseERKS_", scope: !238, file: !239, line: 150, type: !391, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubprogram(name: "startsWith", linkageName: "_ZNK6String10startsWithERKS_", scope: !238, file: !239, line: 151, type: !391, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubprogram(name: "startsWith", linkageName: "_ZNK6String10startsWithERKS_j", scope: !238, file: !239, line: 152, type: !407, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!407 = !DISubroutineType(types: !408)
!408 = !{!7, !247, !258, !21}
!409 = !DISubprogram(name: "endsWith", linkageName: "_ZNK6String8endsWithERKS_", scope: !238, file: !239, line: 153, type: !391, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!410 = !DISubprogram(name: "charAt", linkageName: "_ZNK6String6charAtEj", scope: !238, file: !239, line: 156, type: !411, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{!185, !247, !21}
!413 = !DISubprogram(name: "setCharAt", linkageName: "_ZN6String9setCharAtEjc", scope: !238, file: !239, line: 157, type: !414, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !252, !21, !185}
!416 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6StringixEj", scope: !238, file: !239, line: 158, type: !411, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!417 = !DISubprogram(name: "operator[]", linkageName: "_ZN6StringixEj", scope: !238, file: !239, line: 159, type: !418, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !252, !21}
!420 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !185, size: 32)
!421 = !DISubprogram(name: "getBytes", linkageName: "_ZNK6String8getBytesEPhjj", scope: !238, file: !239, line: 160, type: !422, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !247, !424, !21, !21}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!425 = !DISubprogram(name: "toCharArray", linkageName: "_ZNK6String11toCharArrayEPcjj", scope: !238, file: !239, line: 161, type: !426, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !247, !184, !21, !21}
!428 = !DISubprogram(name: "c_str", linkageName: "_ZNK6String5c_strEv", scope: !238, file: !239, line: 163, type: !429, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{!253, !247}
!431 = !DISubprogram(name: "begin", linkageName: "_ZN6String5beginEv", scope: !238, file: !239, line: 164, type: !432, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!184, !252}
!434 = !DISubprogram(name: "end", linkageName: "_ZN6String3endEv", scope: !238, file: !239, line: 165, type: !432, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!435 = !DISubprogram(name: "begin", linkageName: "_ZNK6String5beginEv", scope: !238, file: !239, line: 166, type: !429, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!436 = !DISubprogram(name: "end", linkageName: "_ZNK6String3endEv", scope: !238, file: !239, line: 167, type: !429, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!437 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfEc", scope: !238, file: !239, line: 170, type: !438, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{!143, !247, !185}
!440 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfEcj", scope: !238, file: !239, line: 171, type: !441, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!441 = !DISubroutineType(types: !442)
!442 = !{!143, !247, !185, !21}
!443 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfERKS_", scope: !238, file: !239, line: 172, type: !388, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!444 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfERKS_j", scope: !238, file: !239, line: 173, type: !445, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!445 = !DISubroutineType(types: !446)
!446 = !{!143, !247, !258, !21}
!447 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfEc", scope: !238, file: !239, line: 174, type: !438, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!448 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfEcj", scope: !238, file: !239, line: 175, type: !441, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!449 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfERKS_", scope: !238, file: !239, line: 176, type: !388, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!450 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfERKS_j", scope: !238, file: !239, line: 177, type: !445, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!451 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEj", scope: !238, file: !239, line: 178, type: !452, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!452 = !DISubroutineType(types: !453)
!453 = !{!238, !247, !21}
!454 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEjj", scope: !238, file: !239, line: 179, type: !455, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!455 = !DISubroutineType(types: !456)
!456 = !{!238, !247, !21, !21}
!457 = !DISubprogram(name: "replace", linkageName: "_ZN6String7replaceEcc", scope: !238, file: !239, line: 182, type: !458, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !252, !185, !185}
!460 = !DISubprogram(name: "replace", linkageName: "_ZN6String7replaceERKS_S1_", scope: !238, file: !239, line: 183, type: !461, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !252, !258, !258}
!463 = !DISubprogram(name: "remove", linkageName: "_ZN6String6removeEj", scope: !238, file: !239, line: 184, type: !464, scopeLine: 184, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !252, !21}
!466 = !DISubprogram(name: "remove", linkageName: "_ZN6String6removeEjj", scope: !238, file: !239, line: 185, type: !467, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !252, !21, !21}
!469 = !DISubprogram(name: "toLowerCase", linkageName: "_ZN6String11toLowerCaseEv", scope: !238, file: !239, line: 186, type: !300, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!470 = !DISubprogram(name: "toUpperCase", linkageName: "_ZN6String11toUpperCaseEv", scope: !238, file: !239, line: 187, type: !300, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!471 = !DISubprogram(name: "trim", linkageName: "_ZN6String4trimEv", scope: !238, file: !239, line: 188, type: !300, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!472 = !DISubprogram(name: "toInt", linkageName: "_ZNK6String5toIntEv", scope: !238, file: !239, line: 191, type: !473, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{!218, !247}
!475 = !DISubprogram(name: "toFloat", linkageName: "_ZNK6String7toFloatEv", scope: !238, file: !239, line: 192, type: !476, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!476 = !DISubroutineType(types: !477)
!477 = !{!222, !247}
!478 = !DISubprogram(name: "toDouble", linkageName: "_ZNK6String8toDoubleEv", scope: !238, file: !239, line: 193, type: !479, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!479 = !DISubroutineType(types: !480)
!480 = !{!298, !247}
!481 = !DISubprogram(name: "init", linkageName: "_ZN6String4initEv", scope: !238, file: !239, line: 200, type: !300, scopeLine: 200, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!482 = !DISubprogram(name: "invalidate", linkageName: "_ZN6String10invalidateEv", scope: !238, file: !239, line: 201, type: !300, scopeLine: 201, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!483 = !DISubprogram(name: "changeBuffer", linkageName: "_ZN6String12changeBufferEj", scope: !238, file: !239, line: 202, type: !303, scopeLine: 202, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!484 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPKcj", scope: !238, file: !239, line: 203, type: !485, scopeLine: 203, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!485 = !DISubroutineType(types: !486)
!486 = !{!7, !252, !253, !21}
!487 = !DISubprogram(name: "copy", linkageName: "_ZN6String4copyEPKcj", scope: !238, file: !239, line: 206, type: !488, scopeLine: 206, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!488 = !DISubroutineType(types: !489)
!489 = !{!311, !252, !253, !21}
!490 = !DISubprogram(name: "copy", linkageName: "_ZN6String4copyEPK19__FlashStringHelperj", scope: !238, file: !239, line: 207, type: !491, scopeLine: 207, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!311, !252, !262, !21}
!493 = !DISubprogram(name: "move", linkageName: "_ZN6String4moveERS_", scope: !238, file: !239, line: 209, type: !494, scopeLine: 209, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !252, !311}
!496 = !DISubprogram(name: "readStringUntil", linkageName: "_ZN6Stream15readStringUntilEc", scope: !151, file: !6, line: 109, type: !497, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!497 = !DISubroutineType(types: !498)
!498 = !{!238, !162, !185}
!499 = !DISubprogram(name: "parseInt", linkageName: "_ZN6Stream8parseIntEc", scope: !151, file: !6, line: 112, type: !500, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!218, !162, !185}
!502 = !DISubprogram(name: "parseFloat", linkageName: "_ZN6Stream10parseFloatEc", scope: !151, file: !6, line: 113, type: !503, scopeLine: 113, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!503 = !DISubroutineType(types: !504)
!504 = !{!222, !162, !185}
!505 = !DISubprogram(name: "findMulti", linkageName: "_ZN6Stream9findMultiEPNS_11MultiTargetEi", scope: !151, file: !6, line: 126, type: !506, scopeLine: 126, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!143, !162, !508, !143}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiTarget", scope: !151, file: !6, line: 118, flags: DIFlagFwdDecl, identifier: "_ZTSN6Stream11MultiTargetE")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_cdc_rx_buffer", scope: !147, file: !148, line: 50, baseType: !511, size: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DICompositeType(tag: DW_TAG_class_type, name: "RingBuffer", file: !513, line: 30, flags: DIFlagFwdDecl, identifier: "_ZTS10RingBuffer")
!513 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/RingBuffer.h", directory: "/home/aaa")
!514 = !DISubprogram(name: "begin", linkageName: "_ZN7Serial_5beginEj", scope: !147, file: !148, line: 52, type: !515, scopeLine: 52, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517, !19}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!518 = !DISubprogram(name: "begin", linkageName: "_ZN7Serial_5beginEjh", scope: !147, file: !148, line: 53, type: !519, scopeLine: 53, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !517, !19, !190}
!521 = !DISubprogram(name: "end", linkageName: "_ZN7Serial_3endEv", scope: !147, file: !148, line: 54, type: !522, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !517}
!524 = !DISubprogram(name: "available", linkageName: "_ZN7Serial_9availableEv", scope: !147, file: !148, line: 56, type: !525, scopeLine: 56, containingType: !147, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!525 = !DISubroutineType(types: !526)
!526 = !{!143, !517}
!527 = !DISubprogram(name: "availableForWrite", linkageName: "_ZN7Serial_17availableForWriteEv", scope: !147, file: !148, line: 57, type: !525, scopeLine: 57, containingType: !147, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!528 = !DISubprogram(name: "accept", linkageName: "_ZN7Serial_6acceptEv", scope: !147, file: !148, line: 58, type: !522, scopeLine: 58, containingType: !147, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!529 = !DISubprogram(name: "peek", linkageName: "_ZN7Serial_4peekEv", scope: !147, file: !148, line: 59, type: !525, scopeLine: 59, containingType: !147, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!530 = !DISubprogram(name: "read", linkageName: "_ZN7Serial_4readEv", scope: !147, file: !148, line: 60, type: !525, scopeLine: 60, containingType: !147, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!531 = !DISubprogram(name: "flush", linkageName: "_ZN7Serial_5flushEv", scope: !147, file: !148, line: 61, type: !522, scopeLine: 61, containingType: !147, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!532 = !DISubprogram(name: "write", linkageName: "_ZN7Serial_5writeEh", scope: !147, file: !148, line: 62, type: !533, scopeLine: 62, containingType: !147, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!533 = !DISubroutineType(types: !534)
!534 = !{!195, !517, !190}
!535 = !DISubprogram(name: "write", linkageName: "_ZN7Serial_5writeEPKhj", scope: !147, file: !148, line: 63, type: !536, scopeLine: 63, containingType: !147, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!536 = !DISubroutineType(types: !537)
!537 = !{!195, !517, !538, !195}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!540 = !DISubprogram(name: "operator bool", linkageName: "_ZN7Serial_cvbEv", scope: !147, file: !148, line: 65, type: !541, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!167, !517}
!543 = !DISubprogram(name: "readBreak", linkageName: "_ZN7Serial_9readBreakEv", scope: !147, file: !148, line: 82, type: !544, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !517}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !15, line: 65, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !17, line: 55, baseType: !143)
!548 = !DISubprogram(name: "baud", linkageName: "_ZN7Serial_4baudEv", scope: !147, file: !148, line: 87, type: !549, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!19, !517}
!551 = !DISubprogram(name: "stopbits", linkageName: "_ZN7Serial_8stopbitsEv", scope: !147, file: !148, line: 88, type: !552, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!552 = !DISubroutineType(types: !553)
!553 = !{!190, !517}
!554 = !DISubprogram(name: "paritytype", linkageName: "_ZN7Serial_10paritytypeEv", scope: !147, file: !148, line: 89, type: !552, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!555 = !DISubprogram(name: "numbits", linkageName: "_ZN7Serial_7numbitsEv", scope: !147, file: !148, line: 90, type: !552, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!556 = !DISubprogram(name: "dtr", linkageName: "_ZN7Serial_3dtrEv", scope: !147, file: !148, line: 91, type: !541, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!557 = !DISubprogram(name: "rts", linkageName: "_ZN7Serial_3rtsEv", scope: !147, file: !148, line: 92, type: !541, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!558 = !{}
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "SerialUSB", scope: !2, file: !142, line: 364, type: !147, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "_cdcInterface", linkageName: "_ZL13_cdcInterface", scope: !2, file: !142, line: 61, type: !563, isLocal: true, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDCDescriptor", file: !565, line: 258, baseType: !566)
!565 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBCore.h", directory: "/home/aaa")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 241, size: 528, flags: DIFlagTypePassByValue, elements: !567, identifier: "_ZTS13CDCDescriptor")
!567 = !{!568, !580, !593, !602, !611, !619, !620, !630, !631, !632}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "iad", scope: !566, file: !565, line: 244, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "IADDescriptor", file: !565, line: 204, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 194, size: 64, flags: DIFlagTypePassByValue, elements: !571, identifier: "_ZTS13IADDescriptor")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !570, file: !565, line: 196, baseType: !190, size: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !570, file: !565, line: 197, baseType: !190, size: 8, offset: 8)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "firstInterface", scope: !570, file: !565, line: 198, baseType: !190, size: 8, offset: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "interfaceCount", scope: !570, file: !565, line: 199, baseType: !190, size: 8, offset: 24)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "functionClass", scope: !570, file: !565, line: 200, baseType: !190, size: 8, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "funtionSubClass", scope: !570, file: !565, line: 201, baseType: !190, size: 8, offset: 40)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "functionProtocol", scope: !570, file: !565, line: 202, baseType: !190, size: 8, offset: 48)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "iInterface", scope: !570, file: !565, line: 203, baseType: !190, size: 8, offset: 56)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !566, file: !565, line: 247, baseType: !581, size: 72, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterfaceDescriptor", file: !565, line: 179, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 168, size: 72, flags: DIFlagTypePassByValue, elements: !583, identifier: "_ZTS19InterfaceDescriptor")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !582, file: !565, line: 170, baseType: !190, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !582, file: !565, line: 171, baseType: !190, size: 8, offset: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !582, file: !565, line: 172, baseType: !190, size: 8, offset: 16)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alternate", scope: !582, file: !565, line: 173, baseType: !190, size: 8, offset: 24)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "numEndpoints", scope: !582, file: !565, line: 174, baseType: !190, size: 8, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "interfaceClass", scope: !582, file: !565, line: 175, baseType: !190, size: 8, offset: 40)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "interfaceSubClass", scope: !582, file: !565, line: 176, baseType: !190, size: 8, offset: 48)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !582, file: !565, line: 177, baseType: !190, size: 8, offset: 56)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "iInterface", scope: !582, file: !565, line: 178, baseType: !190, size: 8, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !566, file: !565, line: 248, baseType: !594, size: 40, offset: 136)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDCCSInterfaceDescriptor", file: !565, line: 214, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 207, size: 40, flags: DIFlagTypePassByValue, elements: !596, identifier: "_ZTS24CDCCSInterfaceDescriptor")
!596 = !{!597, !598, !599, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !595, file: !565, line: 209, baseType: !190, size: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !595, file: !565, line: 210, baseType: !190, size: 8, offset: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !595, file: !565, line: 211, baseType: !190, size: 8, offset: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "d0", scope: !595, file: !565, line: 212, baseType: !190, size: 8, offset: 24)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "d1", scope: !595, file: !565, line: 213, baseType: !190, size: 8, offset: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "callManagement", scope: !566, file: !565, line: 249, baseType: !603, size: 40, offset: 176)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMFunctionalDescriptor", file: !565, line: 231, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 224, size: 40, flags: DIFlagTypePassByValue, elements: !605, identifier: "_ZTS22CMFunctionalDescriptor")
!605 = !{!606, !607, !608, !609, !610}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !604, file: !565, line: 226, baseType: !190, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !604, file: !565, line: 227, baseType: !190, size: 8, offset: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !604, file: !565, line: 228, baseType: !190, size: 8, offset: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bmCapabilities", scope: !604, file: !565, line: 229, baseType: !190, size: 8, offset: 24)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bDataInterface", scope: !604, file: !565, line: 230, baseType: !190, size: 8, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "controlManagement", scope: !566, file: !565, line: 250, baseType: !612, size: 32, offset: 216)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ACMFunctionalDescriptor", file: !565, line: 239, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 233, size: 32, flags: DIFlagTypePassByValue, elements: !614, identifier: "_ZTS23ACMFunctionalDescriptor")
!614 = !{!615, !616, !617, !618}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !613, file: !565, line: 235, baseType: !190, size: 8)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !613, file: !565, line: 236, baseType: !190, size: 8, offset: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !613, file: !565, line: 237, baseType: !190, size: 8, offset: 16)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bmCapabilities", scope: !613, file: !565, line: 238, baseType: !190, size: 8, offset: 24)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "functionalDescriptor", scope: !566, file: !565, line: 251, baseType: !594, size: 40, offset: 248)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cifin", scope: !566, file: !565, line: 252, baseType: !621, size: 56, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndpointDescriptor", file: !565, line: 190, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 182, size: 56, flags: DIFlagTypePassByValue, elements: !623, identifier: "_ZTS18EndpointDescriptor")
!623 = !{!624, !625, !626, !627, !628, !629}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !622, file: !565, line: 184, baseType: !190, size: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !622, file: !565, line: 185, baseType: !190, size: 8, offset: 8)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !622, file: !565, line: 186, baseType: !190, size: 8, offset: 16)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !622, file: !565, line: 187, baseType: !190, size: 8, offset: 24)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "packetSize", scope: !622, file: !565, line: 188, baseType: !14, size: 16, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !622, file: !565, line: 189, baseType: !190, size: 8, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dif", scope: !566, file: !565, line: 255, baseType: !581, size: 72, offset: 344)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !566, file: !565, line: 256, baseType: !621, size: 56, offset: 416)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !566, file: !565, line: 257, baseType: !621, size: 56, offset: 472)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "_cdcOtherInterface", linkageName: "_ZL18_cdcOtherInterface", scope: !2, file: !142, line: 78, type: !563, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "_usbLineInfo", linkageName: "_ZL12_usbLineInfo", scope: !2, file: !142, line: 50, type: !637, isLocal: true, isDefinition: true)
!637 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineInfo", file: !142, line: 48, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 41, size: 64, flags: DIFlagTypePassByValue, elements: !640, identifier: "_ZTS8LineInfo")
!640 = !{!641, !642, !643, !644, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dwDTERate", scope: !639, file: !142, line: 43, baseType: !19, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bCharFormat", scope: !639, file: !142, line: 44, baseType: !190, size: 8, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bParityType", scope: !639, file: !142, line: 45, baseType: !190, size: 8, offset: 40)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bDataBits", scope: !639, file: !142, line: 46, baseType: !190, size: 8, offset: 48)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lineState", scope: !639, file: !142, line: 47, baseType: !190, size: 8, offset: 56)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "breakValue", linkageName: "_ZL10breakValue", scope: !2, file: !142, line: 58, type: !648, isLocal: true, isDefinition: true)
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !546)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ring_buffer", file: !142, line: 32, size: 4160, flags: DIFlagTypePassByValue, elements: !650, identifier: "_ZTS11ring_buffer")
!650 = !{!651, !655, !656}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !649, file: !142, line: 34, baseType: !652, size: 4096)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 4096, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !649, file: !142, line: 35, baseType: !30, size: 32, offset: 4096)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !649, file: !142, line: 36, baseType: !30, size: 32, offset: 4128)
!657 = !{i32 7, !"Dwarf Version", i32 4}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"wchar_size", i32 4}
!660 = !{i32 1, !"min_enum_size", i32 1}
!661 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!662 = distinct !DISubprogram(name: "CDC_GetInterface", linkageName: "_Z16CDC_GetInterfacePh", scope: !142, file: !142, line: 97, type: !663, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !558)
!663 = !DISubroutineType(types: !664)
!664 = !{!143, !189}
!665 = !DILocalVariable(name: "interfaceNum", arg: 1, scope: !662, file: !142, line: 97, type: !189)
!666 = !DILocation(line: 97, column: 36, scope: !662)
!667 = !DILocation(line: 99, column: 2, scope: !662)
!668 = !DILocation(line: 99, column: 18, scope: !662)
!669 = !DILocation(line: 100, column: 9, scope: !662)
!670 = !DILocation(line: 100, column: 2, scope: !662)
!671 = distinct !DISubprogram(name: "CDC_GetOtherInterface", linkageName: "_Z21CDC_GetOtherInterfacePh", scope: !142, file: !142, line: 103, type: !663, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !558)
!672 = !DILocalVariable(name: "interfaceNum", arg: 1, scope: !671, file: !142, line: 103, type: !189)
!673 = !DILocation(line: 103, column: 41, scope: !671)
!674 = !DILocation(line: 105, column: 2, scope: !671)
!675 = !DILocation(line: 105, column: 18, scope: !671)
!676 = !DILocation(line: 106, column: 9, scope: !671)
!677 = !DILocation(line: 106, column: 2, scope: !671)
!678 = distinct !DISubprogram(name: "CDC_Setup", linkageName: "_Z9CDC_SetupR8USBSetup", scope: !142, file: !142, line: 109, type: !679, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !558)
!679 = !DISubroutineType(types: !680)
!680 = !{!167, !681}
!681 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "USBSetup", file: !148, line: 120, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 112, size: 64, flags: DIFlagTypePassByValue, elements: !684, identifier: "_ZTS8USBSetup")
!684 = !{!685, !686, !687, !688, !689, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bmRequestType", scope: !683, file: !148, line: 114, baseType: !190, size: 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bRequest", scope: !683, file: !148, line: 115, baseType: !190, size: 8, offset: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "wValueL", scope: !683, file: !148, line: 116, baseType: !190, size: 8, offset: 16)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "wValueH", scope: !683, file: !148, line: 117, baseType: !190, size: 8, offset: 24)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "wIndex", scope: !683, file: !148, line: 118, baseType: !14, size: 16, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "wLength", scope: !683, file: !148, line: 119, baseType: !14, size: 16, offset: 48)
!691 = !DILocalVariable(name: "setup", arg: 1, scope: !678, file: !142, line: 109, type: !681)
!692 = !DILocation(line: 109, column: 31, scope: !678)
!693 = !DILocalVariable(name: "r", scope: !678, file: !142, line: 111, type: !190)
!694 = !DILocation(line: 111, column: 10, scope: !678)
!695 = !DILocation(line: 111, column: 14, scope: !678)
!696 = !DILocation(line: 111, column: 20, scope: !678)
!697 = !DILocalVariable(name: "requestType", scope: !678, file: !142, line: 112, type: !190)
!698 = !DILocation(line: 112, column: 10, scope: !678)
!699 = !DILocation(line: 112, column: 24, scope: !678)
!700 = !DILocation(line: 112, column: 30, scope: !678)
!701 = !DILocation(line: 114, column: 46, scope: !702)
!702 = distinct !DILexicalBlock(scope: !678, file: !142, line: 114, column: 6)
!703 = !DILocation(line: 114, column: 43, scope: !702)
!704 = !DILocation(line: 114, column: 6, scope: !678)
!705 = !DILocation(line: 116, column: 30, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !142, line: 116, column: 7)
!707 = distinct !DILexicalBlock(scope: !702, file: !142, line: 115, column: 2)
!708 = !DILocation(line: 116, column: 27, scope: !706)
!709 = !DILocation(line: 116, column: 7, scope: !707)
!710 = !DILocation(line: 118, column: 4, scope: !711)
!711 = distinct !DILexicalBlock(scope: !706, file: !142, line: 117, column: 3)
!712 = !DILocation(line: 119, column: 4, scope: !711)
!713 = !DILocation(line: 121, column: 2, scope: !707)
!714 = !DILocation(line: 123, column: 46, scope: !715)
!715 = distinct !DILexicalBlock(scope: !678, file: !142, line: 123, column: 6)
!716 = !DILocation(line: 123, column: 43, scope: !715)
!717 = !DILocation(line: 123, column: 6, scope: !678)
!718 = !DILocation(line: 125, column: 30, scope: !719)
!719 = distinct !DILexicalBlock(scope: !720, file: !142, line: 125, column: 7)
!720 = distinct !DILexicalBlock(scope: !715, file: !142, line: 124, column: 2)
!721 = !DILocation(line: 125, column: 27, scope: !719)
!722 = !DILocation(line: 125, column: 7, scope: !720)
!723 = !DILocation(line: 127, column: 4, scope: !724)
!724 = distinct !DILexicalBlock(scope: !719, file: !142, line: 126, column: 3)
!725 = !DILocation(line: 128, column: 4, scope: !724)
!726 = !DILocation(line: 131, column: 37, scope: !727)
!727 = distinct !DILexicalBlock(scope: !720, file: !142, line: 131, column: 7)
!728 = !DILocation(line: 131, column: 34, scope: !727)
!729 = !DILocation(line: 131, column: 7, scope: !720)
!730 = !DILocation(line: 133, column: 29, scope: !731)
!731 = distinct !DILexicalBlock(scope: !727, file: !142, line: 132, column: 3)
!732 = !DILocation(line: 133, column: 35, scope: !731)
!733 = !DILocation(line: 133, column: 27, scope: !731)
!734 = !DILocation(line: 136, column: 29, scope: !735)
!735 = distinct !DILexicalBlock(scope: !731, file: !142, line: 136, column: 8)
!736 = !DILocation(line: 136, column: 13, scope: !735)
!737 = !DILocation(line: 136, column: 8, scope: !731)
!738 = !DILocation(line: 139, column: 23, scope: !739)
!739 = distinct !DILexicalBlock(scope: !740, file: !142, line: 139, column: 9)
!740 = distinct !DILexicalBlock(scope: !735, file: !142, line: 137, column: 4)
!741 = !DILocation(line: 139, column: 10, scope: !739)
!742 = !DILocation(line: 139, column: 33, scope: !739)
!743 = !DILocation(line: 139, column: 41, scope: !739)
!744 = !DILocation(line: 139, column: 9, scope: !740)
!745 = !DILocation(line: 140, column: 6, scope: !739)
!746 = !DILocation(line: 142, column: 6, scope: !739)
!747 = !DILocation(line: 143, column: 4, scope: !740)
!748 = !DILocation(line: 144, column: 4, scope: !731)
!749 = !DILocation(line: 147, column: 25, scope: !750)
!750 = distinct !DILexicalBlock(scope: !720, file: !142, line: 147, column: 7)
!751 = !DILocation(line: 147, column: 22, scope: !750)
!752 = !DILocation(line: 147, column: 7, scope: !720)
!753 = !DILocation(line: 149, column: 28, scope: !754)
