; ModuleID = '/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.cpp'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%class.UARTClass = type { %class.HardwareSerial, %class.RingBuffer*, %class.RingBuffer*, %struct.Uart*, i8, i32 }
%class.HardwareSerial = type { %class.Stream }
%class.Stream = type { %class.Print, i32, i32 }
%class.Print = type { i32 (...)**, i32 }
%struct.Uart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [55 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%class.RingBuffer = type { [128 x i8], i32, i32 }
%struct.NVIC_Type = type { [8 x i32], [24 x i32], [8 x i32], [24 x i32], [8 x i32], [24 x i32], [8 x i32], [24 x i32], [8 x i32], [56 x i32], [240 x i8], [644 x i32], i32 }
%struct.SCB_Type = type { i32, i32, i32, i32, i32, i32, [12 x i8], i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32, i32, [4 x i32], [5 x i32], [5 x i32], i32 }

$_ZN14HardwareSerialC2Ev = comdat any

$_ZN14HardwareSerial5beginEm = comdat any

$_ZN9UARTClasscvbEv = comdat any

$_ZN6StreamC2Ev = comdat any

$_ZN14HardwareSerial3endEv = comdat any

$_ZN5PrintC2Ev = comdat any

$_ZTV14HardwareSerial = comdat any

$_ZTV6Stream = comdat any


!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !1, producer: "clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !560, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.cpp", directory: "/home/aaa/llvm-arduino-due")
!2 = !{!3, !57, !84}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !4, line: 64, baseType: !5, size: 8, elements: !6, identifier: "_ZTS4IRQn")
!4 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/sam3x8e.h", directory: "/home/aaa")
!5 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!7 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!8 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!9 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!10 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!11 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!12 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!13 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!14 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!15 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!16 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!17 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!18 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!19 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!20 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!21 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!22 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!23 = !DIEnumerator(name: "UART_IRQn", value: 8)
!24 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!25 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!26 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!27 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!28 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!29 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!30 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!31 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!32 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!33 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!34 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!35 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!36 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!37 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!38 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!39 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!40 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!41 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!42 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!43 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!44 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!45 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!46 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!47 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!48 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!49 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!50 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!51 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!52 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!53 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!54 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!55 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!56 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "UARTModes", scope: !59, file: !58, line: 38, baseType: !553, size: 16, elements: !554, identifier: "_ZTSN9UARTClass9UARTModesE")
!58 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.h", directory: "/home/aaa")
!59 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "UARTClass", file: !58, line: 35, size: 288, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !60, vtableHolder: !70)
!60 = !{!61, !455, !475, !476, !511, !513, !514, !518, !522, !526, !529, !532, !533, !534, !535, !536, !540, !543, !546, !547, !550}
!61 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !59, baseType: !62, flags: DIFlagPublic, extraData: i32 0)
!62 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "HardwareSerial", file: !63, line: 26, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !64, vtableHolder: !70, identifier: "_ZTS14HardwareSerial")
!63 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/HardwareSerial.h", directory: "/home/aaa")
!64 = !{!65, !436, !440, !443, !446, !447, !448, !449, !452}
!65 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !62, baseType: !66, flags: DIFlagPublic, extraData: i32 0)
!66 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !67, line: 49, size: 128, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !68, vtableHolder: !70, identifier: "_ZTS6Stream")
!67 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/Stream.h", directory: "/home/aaa")
!68 = !{!69, !72, !74, !75, !80, !81, !91, !92, !93, !94, !97, !98, !101, !104, !109, !117, !123, !126, !129, !132, !135, !138, !141, !145, !149, !152, !155, !158, !161, !422, !425, !428, !431}
!69 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !66, baseType: !70, flags: DIFlagPublic, extraData: i32 0)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "Print", file: !71, line: 34, flags: DIFlagFwdDecl)
!71 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/Print.h", directory: "/home/aaa")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_timeout", scope: !66, file: !67, line: 52, baseType: !73, size: 32, offset: 64, flags: DIFlagProtected)
!73 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_startMillis", scope: !66, file: !67, line: 53, baseType: !73, size: 32, offset: 96, flags: DIFlagProtected)
!75 = !DISubprogram(name: "timedRead", linkageName: "_ZN6Stream9timedReadEv", scope: !66, file: !67, line: 54, type: !76, scopeLine: 54, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !79}
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!80 = !DISubprogram(name: "timedPeek", linkageName: "_ZN6Stream9timedPeekEv", scope: !66, file: !67, line: 55, type: !76, scopeLine: 55, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!81 = !DISubprogram(name: "peekNextDigit", linkageName: "_ZN6Stream13peekNextDigitE13LookaheadModeb", scope: !66, file: !67, line: 56, type: !82, scopeLine: 56, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!82 = !DISubroutineType(types: !83)
!83 = !{!78, !79, !84, !90}
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LookaheadMode", file: !67, line: 41, baseType: !85, size: 8, elements: !86, identifier: "_ZTS13LookaheadMode")
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !{!87, !88, !89}
!87 = !DIEnumerator(name: "SKIP_ALL", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "SKIP_NONE", value: 1, isUnsigned: true)
!89 = !DIEnumerator(name: "SKIP_WHITESPACE", value: 2, isUnsigned: true)
!90 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!91 = !DISubprogram(name: "available", linkageName: "_ZN6Stream9availableEv", scope: !66, file: !67, line: 59, type: !76, scopeLine: 59, containingType: !66, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!92 = !DISubprogram(name: "read", linkageName: "_ZN6Stream4readEv", scope: !66, file: !67, line: 60, type: !76, scopeLine: 60, containingType: !66, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!93 = !DISubprogram(name: "peek", linkageName: "_ZN6Stream4peekEv", scope: !66, file: !67, line: 61, type: !76, scopeLine: 61, containingType: !66, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!94 = !DISubprogram(name: "flush", linkageName: "_ZN6Stream5flushEv", scope: !66, file: !67, line: 62, type: !95, scopeLine: 62, containingType: !66, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !79}
!97 = !DISubprogram(name: "Stream", scope: !66, file: !67, line: 64, type: !95, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!98 = !DISubprogram(name: "setTimeout", linkageName: "_ZN6Stream10setTimeoutEm", scope: !66, file: !67, line: 68, type: !99, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !79, !73}
!101 = !DISubprogram(name: "getTimeout", linkageName: "_ZN6Stream10getTimeoutEv", scope: !66, file: !67, line: 69, type: !102, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!102 = !DISubroutineType(types: !103)
!103 = !{!73, !79}
!104 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPc", scope: !66, file: !67, line: 71, type: !105, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!105 = !DISubroutineType(types: !106)
!106 = !{!90, !79, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPh", scope: !66, file: !67, line: 72, type: !110, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!110 = !DISubroutineType(types: !111)
!111 = !{!90, !79, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !114, line: 42, baseType: !115)
!114 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !116, line: 28, baseType: !85)
!116 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!117 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPcj", scope: !66, file: !67, line: 75, type: !118, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!118 = !DISubroutineType(types: !119)
!119 = !{!90, !79, !107, !120}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 46, baseType: !122)
!121 = !DIFile(filename: "JJS_Project1/src/build/lib/clang/10.0.1/include/stddef.h", directory: "/home/aaa")
!122 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!123 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEPhj", scope: !66, file: !67, line: 76, type: !124, scopeLine: 76, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!124 = !DISubroutineType(types: !125)
!125 = !{!90, !79, !112, !120}
!126 = !DISubprogram(name: "find", linkageName: "_ZN6Stream4findEc", scope: !66, file: !67, line: 79, type: !127, scopeLine: 79, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!127 = !DISubroutineType(types: !128)
!128 = !{!90, !79, !108}
!129 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPcS0_", scope: !66, file: !67, line: 81, type: !130, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!130 = !DISubroutineType(types: !131)
!131 = !{!90, !79, !107, !107}
!132 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPhPc", scope: !66, file: !67, line: 82, type: !133, scopeLine: 82, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{!90, !79, !112, !107}
!135 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPcjS0_j", scope: !66, file: !67, line: 84, type: !136, scopeLine: 84, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!136 = !DISubroutineType(types: !137)
!137 = !{!90, !79, !107, !120, !107, !120}
!138 = !DISubprogram(name: "findUntil", linkageName: "_ZN6Stream9findUntilEPhjPcj", scope: !66, file: !67, line: 85, type: !139, scopeLine: 85, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!139 = !DISubroutineType(types: !140)
!140 = !{!90, !79, !112, !120, !107, !120}
!141 = !DISubprogram(name: "parseInt", linkageName: "_ZN6Stream8parseIntE13LookaheadModec", scope: !66, file: !67, line: 87, type: !142, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !79, !84, !108}
!144 = !DIBasicType(name: "long int", size: 32, encoding: DW_ATE_signed)
!145 = !DISubprogram(name: "parseFloat", linkageName: "_ZN6Stream10parseFloatE13LookaheadModec", scope: !66, file: !67, line: 94, type: !146, scopeLine: 94, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !79, !84, !108}
!148 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!149 = !DISubprogram(name: "readBytes", linkageName: "_ZN6Stream9readBytesEPcj", scope: !66, file: !67, line: 97, type: !150, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{!120, !79, !107, !120}
!152 = !DISubprogram(name: "readBytes", linkageName: "_ZN6Stream9readBytesEPhj", scope: !66, file: !67, line: 98, type: !153, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!153 = !DISubroutineType(types: !154)
!154 = !{!120, !79, !112, !120}
!155 = !DISubprogram(name: "readBytesUntil", linkageName: "_ZN6Stream14readBytesUntilEcPcj", scope: !66, file: !67, line: 102, type: !156, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!156 = !DISubroutineType(types: !157)
!157 = !{!120, !79, !108, !107, !120}
!158 = !DISubprogram(name: "readBytesUntil", linkageName: "_ZN6Stream14readBytesUntilEcPhj", scope: !66, file: !67, line: 103, type: !159, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{!120, !79, !108, !112, !120}
!161 = !DISubprogram(name: "readString", linkageName: "_ZN6Stream10readStringEv", scope: !66, file: !67, line: 108, type: !162, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !79}
!164 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "String", file: !165, line: 45, size: 96, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !166, identifier: "_ZTS6String")
!165 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/WString.h", directory: "/home/aaa")
!166 = !{!167, !168, !169, !170, !175, !181, !185, !191, !195, !200, !203, !206, !209, !212, !215, !218, !221, !225, !228, !231, !234, !238, !241, !244, !247, !250, !253, !256, !259, !262, !265, !266, !269, !272, !275, !278, !281, !282, !283, !286, !289, !292, !295, !298, !301, !304, !307, !308, !313, !316, !319, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !335, !336, !339, !342, !343, !347, !351, !354, !357, !360, !361, !362, !363, !366, !369, !370, !373, !374, !375, !376, !377, !380, !383, !386, !389, !392, !395, !396, !397, !398, !401, !404, !407, !408, !409, !410, !413, !416, !419}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !164, file: !165, line: 196, baseType: !107, size: 32, flags: DIFlagProtected)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !164, file: !165, line: 197, baseType: !122, size: 32, offset: 32, flags: DIFlagProtected)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !164, file: !165, line: 198, baseType: !122, size: 32, offset: 64, flags: DIFlagProtected)
!170 = !DISubprogram(name: "StringIfHelper", linkageName: "_ZNK6String14StringIfHelperEv", scope: !164, file: !165, line: 51, type: !171, scopeLine: 51, flags: DIFlagPrototyped, spFlags: 0)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!175 = !DISubprogram(name: "String", scope: !164, file: !165, line: 59, type: !176, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !178, !179}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!181 = !DISubprogram(name: "String", scope: !164, file: !165, line: 60, type: !182, scopeLine: 60, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !178, !184}
!184 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !174, size: 32)
!185 = !DISubprogram(name: "String", scope: !164, file: !165, line: 61, type: !186, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !178, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_class_type, name: "__FlashStringHelper", file: !165, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTS19__FlashStringHelper")
!191 = !DISubprogram(name: "String", scope: !164, file: !165, line: 63, type: !192, scopeLine: 63, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !178, !194}
!194 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !164, size: 32)
!195 = !DISubprogram(name: "String", scope: !164, file: !165, line: 64, type: !196, scopeLine: 64, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !178, !198}
!198 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !199, size: 32)
!199 = !DICompositeType(tag: DW_TAG_class_type, name: "StringSumHelper", file: !165, line: 213, flags: DIFlagFwdDecl, identifier: "_ZTS15StringSumHelper")
!200 = !DISubprogram(name: "String", scope: !164, file: !165, line: 66, type: !201, scopeLine: 66, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !178, !108}
!203 = !DISubprogram(name: "String", scope: !164, file: !165, line: 67, type: !204, scopeLine: 67, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !178, !85, !85}
!206 = !DISubprogram(name: "String", scope: !164, file: !165, line: 68, type: !207, scopeLine: 68, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !178, !78, !85}
!209 = !DISubprogram(name: "String", scope: !164, file: !165, line: 69, type: !210, scopeLine: 69, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !178, !122, !85}
!212 = !DISubprogram(name: "String", scope: !164, file: !165, line: 70, type: !213, scopeLine: 70, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !178, !144, !85}
!215 = !DISubprogram(name: "String", scope: !164, file: !165, line: 71, type: !216, scopeLine: 71, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !178, !73, !85}
!218 = !DISubprogram(name: "String", scope: !164, file: !165, line: 72, type: !219, scopeLine: 72, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !178, !148, !85}
!221 = !DISubprogram(name: "String", scope: !164, file: !165, line: 73, type: !222, scopeLine: 73, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !178, !224, !85}
!224 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!225 = !DISubprogram(name: "~String", scope: !164, file: !165, line: 74, type: !226, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !178}
!228 = !DISubprogram(name: "reserve", linkageName: "_ZN6String7reserveEj", scope: !164, file: !165, line: 80, type: !229, scopeLine: 80, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!229 = !DISubroutineType(types: !230)
!230 = !{!85, !178, !122}
!231 = !DISubprogram(name: "length", linkageName: "_ZNK6String6lengthEv", scope: !164, file: !165, line: 81, type: !232, scopeLine: 81, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!232 = !DISubroutineType(types: !233)
!233 = !{!122, !173}
!234 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSERKS_", scope: !164, file: !165, line: 86, type: !235, scopeLine: 86, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !178, !184}
!237 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !164, size: 32)
!238 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPKc", scope: !164, file: !165, line: 87, type: !239, scopeLine: 87, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!239 = !DISubroutineType(types: !240)
!240 = !{!237, !178, !179}
!241 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEPK19__FlashStringHelper", scope: !164, file: !165, line: 88, type: !242, scopeLine: 88, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!242 = !DISubroutineType(types: !243)
!243 = !{!237, !178, !188}
!244 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEOS_", scope: !164, file: !165, line: 90, type: !245, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!237, !178, !194}
!247 = !DISubprogram(name: "operator=", linkageName: "_ZN6StringaSEO15StringSumHelper", scope: !164, file: !165, line: 91, type: !248, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!248 = !DISubroutineType(types: !249)
!249 = !{!237, !178, !198}
!250 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatERKS_", scope: !164, file: !165, line: 99, type: !251, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!251 = !DISubroutineType(types: !252)
!252 = !{!85, !178, !184}
!253 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPKc", scope: !164, file: !165, line: 100, type: !254, scopeLine: 100, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!254 = !DISubroutineType(types: !255)
!255 = !{!85, !178, !179}
!256 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEc", scope: !164, file: !165, line: 101, type: !257, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{!85, !178, !108}
!259 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEh", scope: !164, file: !165, line: 102, type: !260, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{!85, !178, !85}
!262 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEi", scope: !164, file: !165, line: 103, type: !263, scopeLine: 103, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!263 = !DISubroutineType(types: !264)
!264 = !{!85, !178, !78}
!265 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEj", scope: !164, file: !165, line: 104, type: !229, scopeLine: 104, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!266 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEl", scope: !164, file: !165, line: 105, type: !267, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!267 = !DISubroutineType(types: !268)
!268 = !{!85, !178, !144}
!269 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEm", scope: !164, file: !165, line: 106, type: !270, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!270 = !DISubroutineType(types: !271)
!271 = !{!85, !178, !73}
!272 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEf", scope: !164, file: !165, line: 107, type: !273, scopeLine: 107, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!273 = !DISubroutineType(types: !274)
!274 = !{!85, !178, !148}
!275 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEd", scope: !164, file: !165, line: 108, type: !276, scopeLine: 108, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!276 = !DISubroutineType(types: !277)
!277 = !{!85, !178, !224}
!278 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPK19__FlashStringHelper", scope: !164, file: !165, line: 109, type: !279, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!279 = !DISubroutineType(types: !280)
!280 = !{!85, !178, !188}
!281 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLERKS_", scope: !164, file: !165, line: 113, type: !235, scopeLine: 113, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!282 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPKc", scope: !164, file: !165, line: 114, type: !239, scopeLine: 114, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!283 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEc", scope: !164, file: !165, line: 115, type: !284, scopeLine: 115, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!284 = !DISubroutineType(types: !285)
!285 = !{!237, !178, !108}
!286 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEh", scope: !164, file: !165, line: 116, type: !287, scopeLine: 116, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!287 = !DISubroutineType(types: !288)
!288 = !{!237, !178, !85}
!289 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEi", scope: !164, file: !165, line: 117, type: !290, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!290 = !DISubroutineType(types: !291)
!291 = !{!237, !178, !78}
!292 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEj", scope: !164, file: !165, line: 118, type: !293, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{!237, !178, !122}
!295 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEl", scope: !164, file: !165, line: 119, type: !296, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!296 = !DISubroutineType(types: !297)
!297 = !{!237, !178, !144}
!298 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEm", scope: !164, file: !165, line: 120, type: !299, scopeLine: 120, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!299 = !DISubroutineType(types: !300)
!300 = !{!237, !178, !73}
!301 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEf", scope: !164, file: !165, line: 121, type: !302, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!302 = !DISubroutineType(types: !303)
!303 = !{!237, !178, !148}
!304 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEd", scope: !164, file: !165, line: 122, type: !305, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!305 = !DISubroutineType(types: !306)
!306 = !{!237, !178, !224}
!307 = !DISubprogram(name: "operator+=", linkageName: "_ZN6StringpLEPK19__FlashStringHelper", scope: !164, file: !165, line: 123, type: !242, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!308 = !DISubprogram(name: "operator void (String::*)() const", linkageName: "_ZNK6StringcvMS_KFvvEEv", scope: !164, file: !165, line: 138, type: !309, scopeLine: 138, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !173}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringIfHelperType", scope: !164, file: !165, line: 50, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_ptr_to_member_type, baseType: !171, size: 64, extraData: !164)
!313 = !DISubprogram(name: "compareTo", linkageName: "_ZNK6String9compareToERKS_", scope: !164, file: !165, line: 139, type: !314, scopeLine: 139, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!314 = !DISubroutineType(types: !315)
!315 = !{!78, !173, !184}
!316 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsERKS_", scope: !164, file: !165, line: 140, type: !317, scopeLine: 140, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!317 = !DISubroutineType(types: !318)
!318 = !{!85, !173, !184}
!319 = !DISubprogram(name: "equals", linkageName: "_ZNK6String6equalsEPKc", scope: !164, file: !165, line: 141, type: !320, scopeLine: 141, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!320 = !DISubroutineType(types: !321)
!321 = !{!85, !173, !179}
!322 = !DISubprogram(name: "operator==", linkageName: "_ZNK6StringeqERKS_", scope: !164, file: !165, line: 142, type: !317, scopeLine: 142, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!323 = !DISubprogram(name: "operator==", linkageName: "_ZNK6StringeqEPKc", scope: !164, file: !165, line: 143, type: !320, scopeLine: 143, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!324 = !DISubprogram(name: "operator!=", linkageName: "_ZNK6StringneERKS_", scope: !164, file: !165, line: 144, type: !317, scopeLine: 144, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!325 = !DISubprogram(name: "operator!=", linkageName: "_ZNK6StringneEPKc", scope: !164, file: !165, line: 145, type: !320, scopeLine: 145, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!326 = !DISubprogram(name: "operator<", linkageName: "_ZNK6StringltERKS_", scope: !164, file: !165, line: 146, type: !317, scopeLine: 146, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!327 = !DISubprogram(name: "operator>", linkageName: "_ZNK6StringgtERKS_", scope: !164, file: !165, line: 147, type: !317, scopeLine: 147, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!328 = !DISubprogram(name: "operator<=", linkageName: "_ZNK6StringleERKS_", scope: !164, file: !165, line: 148, type: !317, scopeLine: 148, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!329 = !DISubprogram(name: "operator>=", linkageName: "_ZNK6StringgeERKS_", scope: !164, file: !165, line: 149, type: !317, scopeLine: 149, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!330 = !DISubprogram(name: "equalsIgnoreCase", linkageName: "_ZNK6String16equalsIgnoreCaseERKS_", scope: !164, file: !165, line: 150, type: !317, scopeLine: 150, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!331 = !DISubprogram(name: "startsWith", linkageName: "_ZNK6String10startsWithERKS_", scope: !164, file: !165, line: 151, type: !317, scopeLine: 151, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!332 = !DISubprogram(name: "startsWith", linkageName: "_ZNK6String10startsWithERKS_j", scope: !164, file: !165, line: 152, type: !333, scopeLine: 152, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!333 = !DISubroutineType(types: !334)
!334 = !{!85, !173, !184, !122}
!335 = !DISubprogram(name: "endsWith", linkageName: "_ZNK6String8endsWithERKS_", scope: !164, file: !165, line: 153, type: !317, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!336 = !DISubprogram(name: "charAt", linkageName: "_ZNK6String6charAtEj", scope: !164, file: !165, line: 156, type: !337, scopeLine: 156, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!108, !173, !122}
!339 = !DISubprogram(name: "setCharAt", linkageName: "_ZN6String9setCharAtEjc", scope: !164, file: !165, line: 157, type: !340, scopeLine: 157, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !178, !122, !108}
!342 = !DISubprogram(name: "operator[]", linkageName: "_ZNK6StringixEj", scope: !164, file: !165, line: 158, type: !337, scopeLine: 158, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!343 = !DISubprogram(name: "operator[]", linkageName: "_ZN6StringixEj", scope: !164, file: !165, line: 159, type: !344, scopeLine: 159, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !178, !122}
!346 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108, size: 32)
!347 = !DISubprogram(name: "getBytes", linkageName: "_ZNK6String8getBytesEPhjj", scope: !164, file: !165, line: 160, type: !348, scopeLine: 160, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !173, !350, !122, !122}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!351 = !DISubprogram(name: "toCharArray", linkageName: "_ZNK6String11toCharArrayEPcjj", scope: !164, file: !165, line: 161, type: !352, scopeLine: 161, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !173, !107, !122, !122}
!354 = !DISubprogram(name: "c_str", linkageName: "_ZNK6String5c_strEv", scope: !164, file: !165, line: 163, type: !355, scopeLine: 163, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!355 = !DISubroutineType(types: !356)
!356 = !{!179, !173}
!357 = !DISubprogram(name: "begin", linkageName: "_ZN6String5beginEv", scope: !164, file: !165, line: 164, type: !358, scopeLine: 164, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!358 = !DISubroutineType(types: !359)
!359 = !{!107, !178}
!360 = !DISubprogram(name: "end", linkageName: "_ZN6String3endEv", scope: !164, file: !165, line: 165, type: !358, scopeLine: 165, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!361 = !DISubprogram(name: "begin", linkageName: "_ZNK6String5beginEv", scope: !164, file: !165, line: 166, type: !355, scopeLine: 166, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!362 = !DISubprogram(name: "end", linkageName: "_ZNK6String3endEv", scope: !164, file: !165, line: 167, type: !355, scopeLine: 167, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!363 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfEc", scope: !164, file: !165, line: 170, type: !364, scopeLine: 170, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!364 = !DISubroutineType(types: !365)
!365 = !{!78, !173, !108}
!366 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfEcj", scope: !164, file: !165, line: 171, type: !367, scopeLine: 171, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!367 = !DISubroutineType(types: !368)
!368 = !{!78, !173, !108, !122}
!369 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfERKS_", scope: !164, file: !165, line: 172, type: !314, scopeLine: 172, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!370 = !DISubprogram(name: "indexOf", linkageName: "_ZNK6String7indexOfERKS_j", scope: !164, file: !165, line: 173, type: !371, scopeLine: 173, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!371 = !DISubroutineType(types: !372)
!372 = !{!78, !173, !184, !122}
!373 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfEc", scope: !164, file: !165, line: 174, type: !364, scopeLine: 174, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!374 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfEcj", scope: !164, file: !165, line: 175, type: !367, scopeLine: 175, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!375 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfERKS_", scope: !164, file: !165, line: 176, type: !314, scopeLine: 176, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!376 = !DISubprogram(name: "lastIndexOf", linkageName: "_ZNK6String11lastIndexOfERKS_j", scope: !164, file: !165, line: 177, type: !371, scopeLine: 177, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!377 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEj", scope: !164, file: !165, line: 178, type: !378, scopeLine: 178, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!164, !173, !122}
!380 = !DISubprogram(name: "substring", linkageName: "_ZNK6String9substringEjj", scope: !164, file: !165, line: 179, type: !381, scopeLine: 179, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!381 = !DISubroutineType(types: !382)
!382 = !{!164, !173, !122, !122}
!383 = !DISubprogram(name: "replace", linkageName: "_ZN6String7replaceEcc", scope: !164, file: !165, line: 182, type: !384, scopeLine: 182, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !178, !108, !108}
!386 = !DISubprogram(name: "replace", linkageName: "_ZN6String7replaceERKS_S1_", scope: !164, file: !165, line: 183, type: !387, scopeLine: 183, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !178, !184, !184}
!389 = !DISubprogram(name: "remove", linkageName: "_ZN6String6removeEj", scope: !164, file: !165, line: 184, type: !390, scopeLine: 184, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !178, !122}
!392 = !DISubprogram(name: "remove", linkageName: "_ZN6String6removeEjj", scope: !164, file: !165, line: 185, type: !393, scopeLine: 185, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !178, !122, !122}
!395 = !DISubprogram(name: "toLowerCase", linkageName: "_ZN6String11toLowerCaseEv", scope: !164, file: !165, line: 186, type: !226, scopeLine: 186, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!396 = !DISubprogram(name: "toUpperCase", linkageName: "_ZN6String11toUpperCaseEv", scope: !164, file: !165, line: 187, type: !226, scopeLine: 187, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!397 = !DISubprogram(name: "trim", linkageName: "_ZN6String4trimEv", scope: !164, file: !165, line: 188, type: !226, scopeLine: 188, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubprogram(name: "toInt", linkageName: "_ZNK6String5toIntEv", scope: !164, file: !165, line: 191, type: !399, scopeLine: 191, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!399 = !DISubroutineType(types: !400)
!400 = !{!144, !173}
!401 = !DISubprogram(name: "toFloat", linkageName: "_ZNK6String7toFloatEv", scope: !164, file: !165, line: 192, type: !402, scopeLine: 192, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!148, !173}
!404 = !DISubprogram(name: "toDouble", linkageName: "_ZNK6String8toDoubleEv", scope: !164, file: !165, line: 193, type: !405, scopeLine: 193, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubroutineType(types: !406)
!406 = !{!224, !173}
!407 = !DISubprogram(name: "init", linkageName: "_ZN6String4initEv", scope: !164, file: !165, line: 200, type: !226, scopeLine: 200, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!408 = !DISubprogram(name: "invalidate", linkageName: "_ZN6String10invalidateEv", scope: !164, file: !165, line: 201, type: !226, scopeLine: 201, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!409 = !DISubprogram(name: "changeBuffer", linkageName: "_ZN6String12changeBufferEj", scope: !164, file: !165, line: 202, type: !229, scopeLine: 202, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!410 = !DISubprogram(name: "concat", linkageName: "_ZN6String6concatEPKcj", scope: !164, file: !165, line: 203, type: !411, scopeLine: 203, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!411 = !DISubroutineType(types: !412)
!412 = !{!85, !178, !179, !122}
!413 = !DISubprogram(name: "copy", linkageName: "_ZN6String4copyEPKcj", scope: !164, file: !165, line: 206, type: !414, scopeLine: 206, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!414 = !DISubroutineType(types: !415)
!415 = !{!237, !178, !179, !122}
!416 = !DISubprogram(name: "copy", linkageName: "_ZN6String4copyEPK19__FlashStringHelperj", scope: !164, file: !165, line: 207, type: !417, scopeLine: 207, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!417 = !DISubroutineType(types: !418)
!418 = !{!237, !178, !188, !122}
!419 = !DISubprogram(name: "move", linkageName: "_ZN6String4moveERS_", scope: !164, file: !165, line: 209, type: !420, scopeLine: 209, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !178, !237}
!422 = !DISubprogram(name: "readStringUntil", linkageName: "_ZN6Stream15readStringUntilEc", scope: !66, file: !67, line: 109, type: !423, scopeLine: 109, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!423 = !DISubroutineType(types: !424)
!424 = !{!164, !79, !108}
!425 = !DISubprogram(name: "parseInt", linkageName: "_ZN6Stream8parseIntEc", scope: !66, file: !67, line: 112, type: !426, scopeLine: 112, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!426 = !DISubroutineType(types: !427)
!427 = !{!144, !79, !108}
!428 = !DISubprogram(name: "parseFloat", linkageName: "_ZN6Stream10parseFloatEc", scope: !66, file: !67, line: 113, type: !429, scopeLine: 113, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!429 = !DISubroutineType(types: !430)
!430 = !{!148, !79, !108}
!431 = !DISubprogram(name: "findMulti", linkageName: "_ZN6Stream9findMultiEPNS_11MultiTargetEi", scope: !66, file: !67, line: 126, type: !432, scopeLine: 126, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!78, !79, !434, !78}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiTarget", scope: !66, file: !67, line: 118, flags: DIFlagFwdDecl, identifier: "_ZTSN6Stream11MultiTargetE")
!436 = !DISubprogram(name: "begin", linkageName: "_ZN14HardwareSerial5beginEm", scope: !62, file: !63, line: 29, type: !437, scopeLine: 29, containingType: !62, virtualIndex: 6, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439, !73}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!440 = !DISubprogram(name: "end", linkageName: "_ZN14HardwareSerial3endEv", scope: !62, file: !63, line: 30, type: !441, scopeLine: 30, containingType: !62, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !439}
!443 = !DISubprogram(name: "available", linkageName: "_ZN14HardwareSerial9availableEv", scope: !62, file: !63, line: 31, type: !444, scopeLine: 31, containingType: !62, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!444 = !DISubroutineType(types: !445)
!445 = !{!78, !439}
!446 = !DISubprogram(name: "peek", linkageName: "_ZN14HardwareSerial4peekEv", scope: !62, file: !63, line: 32, type: !444, scopeLine: 32, containingType: !62, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!447 = !DISubprogram(name: "read", linkageName: "_ZN14HardwareSerial4readEv", scope: !62, file: !63, line: 33, type: !444, scopeLine: 33, containingType: !62, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!448 = !DISubprogram(name: "flush", linkageName: "_ZN14HardwareSerial5flushEv", scope: !62, file: !63, line: 34, type: !441, scopeLine: 34, containingType: !62, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!449 = !DISubprogram(name: "write", linkageName: "_ZN14HardwareSerial5writeEh", scope: !62, file: !63, line: 35, type: !450, scopeLine: 35, containingType: !62, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!450 = !DISubroutineType(types: !451)
!451 = !{!120, !439, !113}
!452 = !DISubprogram(name: "operator bool", linkageName: "_ZN14HardwareSerialcvbEv", scope: !62, file: !63, line: 37, type: !453, scopeLine: 37, containingType: !62, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual)
!453 = !DISubroutineType(types: !454)
!454 = !{!90, !439}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_buffer", scope: !59, file: !58, line: 68, baseType: !456, size: 32, offset: 128, flags: DIFlagProtected)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RingBuffer", file: !458, line: 30, size: 1088, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !459, identifier: "_ZTS10RingBuffer")
!458 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/RingBuffer.h", directory: "/home/aaa")
!459 = !{!460, !465, !467, !468, !472}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_aucBuffer", scope: !457, file: !458, line: 33, baseType: !461, size: 1024, flags: DIFlagPublic)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 1024, elements: !463)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!463 = !{!464}
!464 = !DISubrange(count: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_iHead", scope: !457, file: !458, line: 34, baseType: !466, size: 32, offset: 1024, flags: DIFlagPublic)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !78)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_iTail", scope: !457, file: !458, line: 35, baseType: !466, size: 32, offset: 1056, flags: DIFlagPublic)
!468 = !DISubprogram(name: "RingBuffer", scope: !457, file: !458, line: 38, type: !469, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!472 = !DISubprogram(name: "store_char", linkageName: "_ZN10RingBuffer10store_charEh", scope: !457, file: !458, line: 39, type: !473, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !471, !113}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_tx_buffer", scope: !59, file: !58, line: 69, baseType: !456, size: 32, offset: 160, flags: DIFlagProtected)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_pUart", scope: !59, file: !58, line: 71, baseType: !477, size: 32, offset: 192, flags: DIFlagProtected)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !479, line: 62, baseType: !480)
!479 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_uart.h", directory: "/home/aaa")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 41, size: 2368, flags: DIFlagTypePassByValue, elements: !481, identifier: "_ZTS4Uart")
!481 = !{!482, !487, !489, !490, !491, !493, !494, !495, !496, !497, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !480, file: !479, line: 42, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !4, line: 53, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !114, line: 66, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 56, baseType: !122)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !480, file: !479, line: 43, baseType: !488, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !4, line: 54, baseType: !484)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !480, file: !479, line: 44, baseType: !483, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !480, file: !479, line: 45, baseType: !483, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !480, file: !479, line: 46, baseType: !492, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !4, line: 51, baseType: !484)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !480, file: !479, line: 47, baseType: !492, size: 32, offset: 160)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !480, file: !479, line: 48, baseType: !492, size: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !480, file: !479, line: 49, baseType: !483, size: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !480, file: !479, line: 50, baseType: !488, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !480, file: !479, line: 51, baseType: !498, size: 1760, offset: 288)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 1760, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 55)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !480, file: !479, line: 52, baseType: !488, size: 32, offset: 2048)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !480, file: !479, line: 53, baseType: !488, size: 32, offset: 2080)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !480, file: !479, line: 54, baseType: !488, size: 32, offset: 2112)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !480, file: !479, line: 55, baseType: !488, size: 32, offset: 2144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !480, file: !479, line: 56, baseType: !488, size: 32, offset: 2176)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !480, file: !479, line: 57, baseType: !488, size: 32, offset: 2208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !480, file: !479, line: 58, baseType: !488, size: 32, offset: 2240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !480, file: !479, line: 59, baseType: !488, size: 32, offset: 2272)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !480, file: !479, line: 60, baseType: !483, size: 32, offset: 2304)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !480, file: !479, line: 61, baseType: !492, size: 32, offset: 2336)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_dwIrq", scope: !59, file: !58, line: 72, baseType: !512, size: 8, offset: 224, flags: DIFlagProtected)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !4, line: 120, baseType: !3)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_dwId", scope: !59, file: !58, line: 73, baseType: !485, size: 32, offset: 256, flags: DIFlagProtected)
!514 = !DISubprogram(name: "UARTClass", scope: !59, file: !58, line: 45, type: !515, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517, !477, !512, !485, !456, !456}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!518 = !DISubprogram(name: "begin", linkageName: "_ZN9UARTClass5beginEj", scope: !59, file: !58, line: 47, type: !519, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !517, !521}
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!522 = !DISubprogram(name: "begin", linkageName: "_ZN9UARTClass5beginEjNS_9UARTModesE", scope: !59, file: !58, line: 48, type: !523, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !517, !521, !525}
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!526 = !DISubprogram(name: "end", linkageName: "_ZN9UARTClass3endEv", scope: !59, file: !58, line: 49, type: !527, scopeLine: 49, containingType: !59, virtualIndex: 7, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !517}
!529 = !DISubprogram(name: "available", linkageName: "_ZN9UARTClass9availableEv", scope: !59, file: !58, line: 50, type: !530, scopeLine: 50, containingType: !59, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!530 = !DISubroutineType(types: !531)
!531 = !{!78, !517}
!532 = !DISubprogram(name: "availableForWrite", linkageName: "_ZN9UARTClass17availableForWriteEv", scope: !59, file: !58, line: 51, type: !530, scopeLine: 51, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!533 = !DISubprogram(name: "peek", linkageName: "_ZN9UARTClass4peekEv", scope: !59, file: !58, line: 52, type: !530, scopeLine: 52, containingType: !59, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!534 = !DISubprogram(name: "read", linkageName: "_ZN9UARTClass4readEv", scope: !59, file: !58, line: 53, type: !530, scopeLine: 53, containingType: !59, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!535 = !DISubprogram(name: "flush", linkageName: "_ZN9UARTClass5flushEv", scope: !59, file: !58, line: 54, type: !527, scopeLine: 54, containingType: !59, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!536 = !DISubprogram(name: "write", linkageName: "_ZN9UARTClass5writeEh", scope: !59, file: !58, line: 55, type: !537, scopeLine: 55, containingType: !59, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!537 = !DISubroutineType(types: !538)
!538 = !{!120, !517, !539}
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!540 = !DISubprogram(name: "setInterruptPriority", linkageName: "_ZN9UARTClass20setInterruptPriorityEj", scope: !59, file: !58, line: 58, type: !541, scopeLine: 58, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !517, !485}
!543 = !DISubprogram(name: "getInterruptPriority", linkageName: "_ZN9UARTClass20getInterruptPriorityEv", scope: !59, file: !58, line: 59, type: !544, scopeLine: 59, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!544 = !DISubroutineType(types: !545)
!545 = !{!485, !517}
!546 = !DISubprogram(name: "IrqHandler", linkageName: "_ZN9UARTClass10IrqHandlerEv", scope: !59, file: !58, line: 61, type: !527, scopeLine: 61, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!547 = !DISubprogram(name: "operator bool", linkageName: "_ZN9UARTClasscvbEv", scope: !59, file: !58, line: 63, type: !548, scopeLine: 63, containingType: !59, virtualIndex: 8, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual)
!548 = !DISubroutineType(types: !549)
!549 = !{!90, !517}
!550 = !DISubprogram(name: "init", linkageName: "_ZN9UARTClass4initEjj", scope: !59, file: !58, line: 66, type: !551, scopeLine: 66, flags: DIFlagProtected | DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !517, !521, !521}
!553 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!554 = !{!555, !556, !557, !558, !559}
!555 = !DIEnumerator(name: "Mode_8N1", value: 2240, isUnsigned: true)
!556 = !DIEnumerator(name: "Mode_8E1", value: 192, isUnsigned: true)
!557 = !DIEnumerator(name: "Mode_8O1", value: 704, isUnsigned: true)
!558 = !DIEnumerator(name: "Mode_8M1", value: 1728, isUnsigned: true)
!559 = !DIEnumerator(name: "Mode_8S1", value: 1216, isUnsigned: true)
!560 = !{!485, !122, !561, !594}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !563, line: 289, baseType: !564)
!563 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/CMSIS/Include/core_cm3.h", directory: "/home/aaa")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 274, size: 28704, flags: DIFlagTypePassByValue, elements: !565, identifier: "_ZTS9NVIC_Type")
!565 = !{!566, !570, !574, !575, !576, !577, !578, !579, !580, !581, !585, !589, !593}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !564, file: !563, line: 276, baseType: !567, size: 256)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 256, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !564, file: !563, line: 277, baseType: !571, size: 768, offset: 256)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 768, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 24)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !564, file: !563, line: 278, baseType: !567, size: 256, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !564, file: !563, line: 279, baseType: !571, size: 768, offset: 1280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !564, file: !563, line: 280, baseType: !567, size: 256, offset: 2048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !564, file: !563, line: 281, baseType: !571, size: 768, offset: 2304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !564, file: !563, line: 282, baseType: !567, size: 256, offset: 3072)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !564, file: !563, line: 283, baseType: !571, size: 768, offset: 3328)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !564, file: !563, line: 284, baseType: !567, size: 256, offset: 4096)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !564, file: !563, line: 285, baseType: !582, size: 1792, offset: 4352)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 1792, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 56)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !564, file: !563, line: 286, baseType: !586, size: 1920, offset: 6144)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 1920, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !564, file: !563, line: 287, baseType: !590, size: 20608, offset: 8064)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 20608, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 644)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !564, file: !563, line: 288, baseType: !484, size: 32, offset: 28672)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !563, line: 329, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 306, size: 1120, flags: DIFlagTypePassByValue, elements: !597, identifier: "_ZTS8SCB_Type")
!597 = !{!598, !599, !600, !601, !602, !603, !604, !608, !609, !610, !611, !612, !613, !614, !615, !619, !620, !621, !625, !629, !631}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !596, file: !563, line: 308, baseType: !484, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !596, file: !563, line: 309, baseType: !484, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !596, file: !563, line: 310, baseType: !484, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !596, file: !563, line: 311, baseType: !484, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !596, file: !563, line: 312, baseType: !484, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !596, file: !563, line: 313, baseType: !484, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !596, file: !563, line: 314, baseType: !605, size: 96, offset: 192)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 96, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 12)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !596, file: !563, line: 315, baseType: !484, size: 32, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !596, file: !563, line: 316, baseType: !484, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !596, file: !563, line: 317, baseType: !484, size: 32, offset: 352)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !596, file: !563, line: 318, baseType: !484, size: 32, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !596, file: !563, line: 319, baseType: !484, size: 32, offset: 416)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !596, file: !563, line: 320, baseType: !484, size: 32, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !596, file: !563, line: 321, baseType: !484, size: 32, offset: 480)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !596, file: !563, line: 322, baseType: !616, size: 64, offset: 512)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 64, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 2)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !596, file: !563, line: 323, baseType: !484, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !596, file: !563, line: 324, baseType: !484, size: 32, offset: 608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !596, file: !563, line: 325, baseType: !622, size: 128, offset: 640)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 128, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 4)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !596, file: !563, line: 326, baseType: !626, size: 160, offset: 768)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 160, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 5)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !596, file: !563, line: 327, baseType: !630, size: 160, offset: 928)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 160, elements: !627)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !596, file: !563, line: 328, baseType: !484, size: 32, offset: 1088)
!632 = !{i32 7, !"Dwarf Version", i32 4}
!633 = !{i32 2, !"Debug Info Version", i32 3}
!634 = !{i32 1, !"wchar_size", i32 4}
!635 = !{i32 1, !"min_enum_size", i32 1}
!636 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!637 = distinct !DISubprogram(name: "UARTClass", linkageName: "_ZN9UARTClassC2EP4Uart4IRQnjP10RingBufferS4_", scope: !59, file: !638, line: 26, type: !515, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !514, retainedNodes: !639)
!638 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.cpp", directory: "/home/aaa")
!639 = !{}
!640 = !DILocalVariable(name: "this", arg: 1, scope: !637, type: !641, flags: DIFlagArtificial | DIFlagObjectPointer)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!642 = !DILocation(line: 0, scope: !637)
!643 = !DILocalVariable(name: "pUart", arg: 2, scope: !637, file: !638, line: 26, type: !477)
!644 = !DILocation(line: 26, column: 29, scope: !637)
!645 = !DILocalVariable(name: "dwIrq", arg: 3, scope: !637, file: !638, line: 26, type: !512)
!646 = !DILocation(line: 26, column: 46, scope: !637)
!647 = !DILocalVariable(name: "dwId", arg: 4, scope: !637, file: !638, line: 26, type: !485)
!648 = !DILocation(line: 26, column: 62, scope: !637)
!649 = !DILocalVariable(name: "pRx_buffer", arg: 5, scope: !637, file: !638, line: 26, type: !456)
!650 = !DILocation(line: 26, column: 80, scope: !637)
!651 = !DILocalVariable(name: "pTx_buffer", arg: 6, scope: !637, file: !638, line: 26, type: !456)
!652 = !DILocation(line: 26, column: 104, scope: !637)
!653 = !DILocation(line: 27, column: 1, scope: !637)
!654 = !DILocation(line: 26, column: 12, scope: !637)
!655 = !DILocation(line: 28, column: 16, scope: !656)
!656 = distinct !DILexicalBlock(scope: !637, file: !638, line: 27, column: 1)
!657 = !DILocation(line: 28, column: 3, scope: !656)
!658 = !DILocation(line: 28, column: 14, scope: !656)
!659 = !DILocation(line: 29, column: 16, scope: !656)
!660 = !DILocation(line: 29, column: 3, scope: !656)
!661 = !DILocation(line: 29, column: 14, scope: !656)
!662 = !DILocation(line: 31, column: 10, scope: !656)
!663 = !DILocation(line: 31, column: 3, scope: !656)
!664 = !DILocation(line: 31, column: 9, scope: !656)
!665 = !DILocation(line: 32, column: 10, scope: !656)
!666 = !DILocation(line: 32, column: 3, scope: !656)
!667 = !DILocation(line: 32, column: 9, scope: !656)
!668 = !DILocation(line: 33, column: 9, scope: !656)
!669 = !DILocation(line: 33, column: 3, scope: !656)
!670 = !DILocation(line: 33, column: 8, scope: !656)
!671 = !DILocation(line: 34, column: 1, scope: !637)
!672 = distinct !DISubprogram(name: "HardwareSerial", linkageName: "_ZN14HardwareSerialC2Ev", scope: !62, file: !63, line: 26, type: !441, scopeLine: 26, flags: DIFlagArtificial | DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !673, retainedNodes: !639)
!673 = !DISubprogram(name: "HardwareSerial", scope: !62, type: !441, flags: DIFlagPublic | DIFlagArtificial | DIFlagPrototyped, spFlags: 0)
!674 = !DILocalVariable(name: "this", arg: 1, scope: !672, type: !675, flags: DIFlagArtificial | DIFlagObjectPointer)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 32)
!676 = !DILocation(line: 0, scope: !672)
!677 = !DILocation(line: 26, column: 7, scope: !672)
!678 = distinct !DISubprogram(name: "begin", linkageName: "_ZN9UARTClass5beginEj", scope: !59, file: !638, line: 38, type: !519, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, declaration: !518, retainedNodes: !639)
!679 = !DILocalVariable(name: "this", arg: 1, scope: !678, type: !641, flags: DIFlagArtificial | DIFlagObjectPointer)
!680 = !DILocation(line: 0, scope: !678)
