; ModuleID = '/home/aaa/llvm-arduino-due/build/core/USBCore.cpp.o.ll'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBCore.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%struct.DeviceDescriptor = type { i8, i8, i16, i8, i8, i8, i8, i16, i16, i16, i8, i8, i8, i8 }
%class.USBDevice_ = type { i8 }
%class.Serial_ = type { %class.Stream, %class.RingBuffer* }
%class.Stream = type { %class.Print, i32, i32 }
%class.Print = type { i32 (...)**, i32 }
%class.RingBuffer = type { [128 x i8], i32, i32 }
%struct.QualifierDescriptor = type <{ i8, i8, i16, i8, i8, i8, i8, i8 }>
%class.LockEP = type { i32 }
%struct.USBSetup = type { i8, i8, i8, i8, i16, i16 }
%class.PluggableUSB_ = type { i8, i8, %class.PluggableUSBModule* }
%class.PluggableUSBModule = type { i32 (...)**, i8, i8, i8, i8, i32*, %class.PluggableUSBModule* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "EndPoints", scope: !2, file: !150, line: 27, type: !239, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !3, producer: "clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !147, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBCore.cpp", directory: "/home/aaa/llvm-arduino-due")
!4 = !{}
!5 = !{!6, !12, !14, !134, !136, !141, !144}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 42, baseType: !9)
!8 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 28, baseType: !11)
!10 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uotghs", file: !16, line: 123, baseType: !17)
!16 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_uotghs.h", directory: "/home/aaa")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 57, size: 16768, flags: DIFlagTypePassByValue, elements: !18, identifier: "_ZTS6Uotghs")
!18 = !{!19, !26, !28, !30, !31, !32, !33, !34, !35, !36, !40, !44, !48, !50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !65, !76, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !117, !126, !127, !128, !129, !130, !131, !133}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVCTRL", scope: !17, file: !16, line: 58, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !21, line: 54, baseType: !22)
!21 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/sam3x8e.h", directory: "/home/aaa")
!22 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 66, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 56, baseType: !25)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVISR", scope: !17, file: !16, line: 59, baseType: !27, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !21, line: 51, baseType: !22)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVICR", scope: !17, file: !16, line: 60, baseType: !29, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !21, line: 53, baseType: !22)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIFR", scope: !17, file: !16, line: 61, baseType: !29, size: 32, offset: 96)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIMR", scope: !17, file: !16, line: 62, baseType: !27, size: 32, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIDR", scope: !17, file: !16, line: 63, baseType: !29, size: 32, offset: 160)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVIER", scope: !17, file: !16, line: 64, baseType: !29, size: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPT", scope: !17, file: !16, line: 65, baseType: !20, size: 32, offset: 224)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVFNUM", scope: !17, file: !16, line: 66, baseType: !27, size: 32, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !17, file: !16, line: 67, baseType: !37, size: 1760, offset: 288)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1760, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 55)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTCFG", scope: !17, file: !16, line: 68, baseType: !41, size: 320, offset: 2048)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 320, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 10)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !17, file: !16, line: 69, baseType: !45, size: 64, offset: 2368)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTISR", scope: !17, file: !16, line: 70, baseType: !49, size: 320, offset: 2432)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 320, elements: !42)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !17, file: !16, line: 71, baseType: !45, size: 64, offset: 2752)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTICR", scope: !17, file: !16, line: 72, baseType: !52, size: 320, offset: 2816)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 320, elements: !42)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !17, file: !16, line: 73, baseType: !45, size: 64, offset: 3136)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIFR", scope: !17, file: !16, line: 74, baseType: !52, size: 320, offset: 3200)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !17, file: !16, line: 75, baseType: !45, size: 64, offset: 3520)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIMR", scope: !17, file: !16, line: 76, baseType: !49, size: 320, offset: 3584)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !17, file: !16, line: 77, baseType: !45, size: 64, offset: 3904)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIER", scope: !17, file: !16, line: 78, baseType: !52, size: 320, offset: 3968)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !17, file: !16, line: 79, baseType: !45, size: 64, offset: 4288)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVEPTIDR", scope: !17, file: !16, line: 80, baseType: !52, size: 320, offset: 4352)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !17, file: !16, line: 81, baseType: !62, size: 1600, offset: 4672)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 50)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMA", scope: !17, file: !16, line: 82, baseType: !66, size: 896, offset: 6272)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 896, elements: !74)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "UotghsDevdma", file: !16, line: 46, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 41, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS12UotghsDevdma")
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMANXTDSC", scope: !68, file: !16, line: 42, baseType: !20, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMAADDRESS", scope: !68, file: !16, line: 43, baseType: !20, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMACONTROL", scope: !68, file: !16, line: 44, baseType: !20, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_DEVDMASTATUS", scope: !68, file: !16, line: 45, baseType: !20, size: 32, offset: 96)
!74 = !{!75}
!75 = !DISubrange(count: 7)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !17, file: !16, line: 83, baseType: !77, size: 1024, offset: 7168)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1024, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTCTRL", scope: !17, file: !16, line: 84, baseType: !20, size: 32, offset: 8192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTISR", scope: !17, file: !16, line: 85, baseType: !27, size: 32, offset: 8224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTICR", scope: !17, file: !16, line: 86, baseType: !29, size: 32, offset: 8256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIFR", scope: !17, file: !16, line: 87, baseType: !29, size: 32, offset: 8288)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIMR", scope: !17, file: !16, line: 88, baseType: !27, size: 32, offset: 8320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIDR", scope: !17, file: !16, line: 89, baseType: !29, size: 32, offset: 8352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTIER", scope: !17, file: !16, line: 90, baseType: !29, size: 32, offset: 8384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIP", scope: !17, file: !16, line: 91, baseType: !20, size: 32, offset: 8416)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTFNUM", scope: !17, file: !16, line: 92, baseType: !20, size: 32, offset: 8448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR1", scope: !17, file: !16, line: 93, baseType: !20, size: 32, offset: 8480)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR2", scope: !17, file: !16, line: 94, baseType: !20, size: 32, offset: 8512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTADDR3", scope: !17, file: !16, line: 95, baseType: !20, size: 32, offset: 8544)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved10", scope: !17, file: !16, line: 96, baseType: !93, size: 1664, offset: 8576)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1664, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 52)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPCFG", scope: !17, file: !16, line: 97, baseType: !41, size: 320, offset: 10240)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !17, file: !16, line: 98, baseType: !45, size: 64, offset: 10560)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPISR", scope: !17, file: !16, line: 99, baseType: !49, size: 320, offset: 10624)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved12", scope: !17, file: !16, line: 100, baseType: !45, size: 64, offset: 10944)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPICR", scope: !17, file: !16, line: 101, baseType: !52, size: 320, offset: 11008)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved13", scope: !17, file: !16, line: 102, baseType: !45, size: 64, offset: 11328)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIFR", scope: !17, file: !16, line: 103, baseType: !52, size: 320, offset: 11392)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved14", scope: !17, file: !16, line: 104, baseType: !45, size: 64, offset: 11712)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIMR", scope: !17, file: !16, line: 105, baseType: !49, size: 320, offset: 11776)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved15", scope: !17, file: !16, line: 106, baseType: !45, size: 64, offset: 12096)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIER", scope: !17, file: !16, line: 107, baseType: !52, size: 320, offset: 12160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved16", scope: !17, file: !16, line: 108, baseType: !45, size: 64, offset: 12480)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPIDR", scope: !17, file: !16, line: 109, baseType: !52, size: 320, offset: 12544)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved17", scope: !17, file: !16, line: 110, baseType: !45, size: 64, offset: 12864)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPINRQ", scope: !17, file: !16, line: 111, baseType: !41, size: 320, offset: 12928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved18", scope: !17, file: !16, line: 112, baseType: !45, size: 64, offset: 13248)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTPIPERR", scope: !17, file: !16, line: 113, baseType: !41, size: 320, offset: 13312)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved19", scope: !17, file: !16, line: 114, baseType: !114, size: 832, offset: 13632)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 832, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 26)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMA", scope: !17, file: !16, line: 115, baseType: !118, size: 896, offset: 14464)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 896, elements: !74)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "UotghsHstdma", file: !16, line: 53, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 48, size: 128, flags: DIFlagTypePassByValue, elements: !121, identifier: "_ZTS12UotghsHstdma")
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMANXTDSC", scope: !120, file: !16, line: 49, baseType: !20, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMAADDRESS", scope: !120, file: !16, line: 50, baseType: !20, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMACONTROL", scope: !120, file: !16, line: 51, baseType: !20, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_HSTDMASTATUS", scope: !120, file: !16, line: 52, baseType: !20, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved20", scope: !17, file: !16, line: 116, baseType: !77, size: 1024, offset: 15360)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_CTRL", scope: !17, file: !16, line: 117, baseType: !20, size: 32, offset: 16384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SR", scope: !17, file: !16, line: 118, baseType: !27, size: 32, offset: 16416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SCR", scope: !17, file: !16, line: 119, baseType: !29, size: 32, offset: 16448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_SFR", scope: !17, file: !16, line: 120, baseType: !29, size: 32, offset: 16480)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved21", scope: !17, file: !16, line: 121, baseType: !132, size: 224, offset: 16512)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !74)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "UOTGHS_FSM", scope: !17, file: !16, line: 122, baseType: !27, size: 32, offset: 16736)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "U32", file: !135, line: 87, baseType: !23)
!135 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/libsam/include/USB_device.h", directory: "/home/aaa")
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 262144, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!139 = !{!140}
!140 = !DISubrange(count: 32768)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 54, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 38, baseType: !143)
!143 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !{!0, !148, !151, !153, !157, !162, !164, !185, !187, !189, !191, !193, !195, !197, !199, !215, !217, !219, !225}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "TxLEDPulse", scope: !2, file: !150, line: 50, type: !138, isLocal: false, isDefinition: true)
!150 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBCore.cpp", directory: "/home/aaa")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "RxLEDPulse", scope: !2, file: !150, line: 51, type: !138, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "STRING_LANGUAGE", scope: !2, file: !150, line: 63, type: !155, isLocal: false, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 32, elements: !46)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "STRING_PRODUCT", scope: !2, file: !150, line: 72, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 12)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "STRING_MANUFACTURER", scope: !2, file: !150, line: 78, type: !159, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "USB_DeviceDescriptor", scope: !2, file: !150, line: 87, type: !166, isLocal: false, isDefinition: true)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "DeviceDescriptor", file: !168, line: 139, baseType: !169)
!168 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBCore.h", directory: "/home/aaa")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 124, size: 144, flags: DIFlagTypePassByValue, elements: !170, identifier: "_ZTS16DeviceDescriptor")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !169, file: !168, line: 125, baseType: !7, size: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !169, file: !168, line: 126, baseType: !7, size: 8, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "usbVersion", scope: !169, file: !168, line: 127, baseType: !141, size: 16, offset: 16)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "deviceClass", scope: !169, file: !168, line: 128, baseType: !7, size: 8, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "deviceSubClass", scope: !169, file: !168, line: 129, baseType: !7, size: 8, offset: 40)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "deviceProtocol", scope: !169, file: !168, line: 130, baseType: !7, size: 8, offset: 48)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "packetSize0", scope: !169, file: !168, line: 131, baseType: !7, size: 8, offset: 56)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "idVendor", scope: !169, file: !168, line: 132, baseType: !141, size: 16, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "idProduct", scope: !169, file: !168, line: 133, baseType: !141, size: 16, offset: 80)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "deviceVersion", scope: !169, file: !168, line: 134, baseType: !141, size: 16, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "iManufacturer", scope: !169, file: !168, line: 135, baseType: !7, size: 8, offset: 112)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "iProduct", scope: !169, file: !168, line: 136, baseType: !7, size: 8, offset: 120)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "iSerialNumber", scope: !169, file: !168, line: 137, baseType: !7, size: 8, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bNumConfigurations", scope: !169, file: !168, line: 138, baseType: !7, size: 8, offset: 136)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "USB_DeviceDescriptorA", scope: !2, file: !150, line: 90, type: !166, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "_usbConfiguration", scope: !2, file: !150, line: 109, type: !22, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "_usbInitialized", scope: !2, file: !150, line: 110, type: !22, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "_usbSetInterface", scope: !2, file: !150, line: 111, type: !23, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "_cdcComposite", scope: !2, file: !150, line: 112, type: !23, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "_cmark", scope: !2, file: !150, line: 211, type: !141, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "_cend", scope: !2, file: !150, line: 212, type: !141, isLocal: false, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "USBDevice", scope: !2, file: !150, line: 846, type: !201, isLocal: false, isDefinition: true)
!201 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "USBDevice_", file: !202, line: 31, size: 8, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !203, identifier: "_ZTS10USBDevice_")
!202 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USB/USBAPI.h", directory: "/home/aaa")
!203 = !{!204, !208, !212, !213, !214}
!204 = !DISubprogram(name: "USBDevice_", scope: !201, file: !202, line: 34, type: !205, scopeLine: 34, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!208 = !DISubprogram(name: "configured", linkageName: "_ZN10USBDevice_10configuredEv", scope: !201, file: !202, line: 35, type: !209, scopeLine: 35, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!209 = !DISubroutineType(types: !210)
!210 = !{!211, !207}
!211 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DISubprogram(name: "attach", linkageName: "_ZN10USBDevice_6attachEv", scope: !201, file: !202, line: 37, type: !209, scopeLine: 37, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!213 = !DISubprogram(name: "detach", linkageName: "_ZN10USBDevice_6detachEv", scope: !201, file: !202, line: 38, type: !209, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!214 = !DISubprogram(name: "poll", linkageName: "_ZN10USBDevice_4pollEv", scope: !201, file: !202, line: 39, type: !205, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "isEndpointHalt", linkageName: "_ZL14isEndpointHalt", scope: !2, file: !150, line: 53, type: !146, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "isRemoteWakeUpEnabled", linkageName: "_ZL21isRemoteWakeUpEnabled", scope: !2, file: !150, line: 52, type: !146, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "test_packet_buffer", linkageName: "_ZL18test_packet_buffer", scope: !2, file: !150, line: 97, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 424, elements: !223)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!223 = !{!224}
!224 = !DISubrange(count: 53)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "USB_DeviceQualifier", linkageName: "_ZL19USB_DeviceQualifier", scope: !2, file: !150, line: 93, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "QualifierDescriptor", file: !168, line: 163, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 154, size: 72, flags: DIFlagTypePassByValue, elements: !230, identifier: "_ZTS19QualifierDescriptor")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bLength", scope: !229, file: !168, line: 155, baseType: !7, size: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !229, file: !168, line: 156, baseType: !7, size: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bDescriptorType", scope: !229, file: !168, line: 157, baseType: !141, size: 16, offset: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceClass", scope: !229, file: !168, line: 158, baseType: !7, size: 8, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceSubClass", scope: !229, file: !168, line: 159, baseType: !7, size: 8, offset: 40)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bDeviceProtocol", scope: !229, file: !168, line: 160, baseType: !7, size: 8, offset: 48)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bMaxPacketSize0", scope: !229, file: !168, line: 161, baseType: !7, size: 8, offset: 56)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bNumConfigurations", scope: !229, file: !168, line: 162, baseType: !7, size: 8, offset: 64)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 320, elements: !42)
!240 = !{i32 7, !"Dwarf Version", i32 4}
!241 = !{i32 2, !"Debug Info Version", i32 3}
!242 = !{i32 1, !"wchar_size", i32 4}
!243 = !{i32 1, !"min_enum_size", i32 1}
!244 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!245 = distinct !DISubprogram(name: "USBD_Available", linkageName: "_Z14USBD_Availablej", scope: !150, file: !150, line: 132, type: !246, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!246 = !DISubroutineType(types: !247)
!247 = !{!23, !23}
!248 = !DILocalVariable(name: "ep", arg: 1, scope: !245, file: !150, line: 132, type: !23)
!249 = !DILocation(line: 132, column: 34, scope: !245)
!250 = !DILocalVariable(name: "lock", scope: !245, file: !150, line: 134, type: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "LockEP", file: !150, line: 118, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !252, identifier: "_ZTS6LockEP")
!252 = !{!253, !256, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !150, line: 120, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "irqflags_t", file: !255, line: 117, baseType: !23)
!255 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/libsam/include/interrupt_sam_nvic.h", directory: "/home/aaa")
!256 = !DISubprogram(name: "LockEP", scope: !251, file: !150, line: 122, type: !257, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259, !23}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!260 = !DISubprogram(name: "~LockEP", scope: !251, file: !150, line: 125, type: !261, scopeLine: 125, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !259}
!263 = !DILocation(line: 134, column: 9, scope: !245)
!264 = !DILocation(line: 134, column: 14, scope: !245)
!265 = !DILocation(line: 135, column: 27, scope: !245)
!266 = !DILocation(line: 135, column: 30, scope: !245)
!267 = !DILocation(line: 135, column: 9, scope: !245)
!268 = !DILocation(line: 136, column: 1, scope: !245)
!269 = distinct !DISubprogram(name: "LockEP", linkageName: "_ZN6LockEPC2Ej", scope: !251, file: !150, line: 122, type: !257, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !256, retainedNodes: !4)
!270 = !DILocalVariable(name: "this", arg: 1, scope: !269, type: !271, flags: DIFlagArtificial | DIFlagObjectPointer)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!272 = !DILocation(line: 0, scope: !269)
!273 = !DILocalVariable(name: "ep", arg: 2, scope: !269, file: !150, line: 122, type: !23)
!274 = !DILocation(line: 122, column: 18, scope: !269)
!275 = !DILocation(line: 122, column: 49, scope: !269)
!276 = !DILocation(line: 122, column: 55, scope: !269)
!277 = !DILocation(line: 124, column: 2, scope: !269)
!278 = distinct !DISubprogram(name: "~LockEP", linkageName: "_ZN6LockEPD2Ev", scope: !251, file: !150, line: 125, type: !261, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !260, retainedNodes: !4)
!279 = !DILocalVariable(name: "this", arg: 1, scope: !278, type: !271, flags: DIFlagArtificial | DIFlagObjectPointer)
!280 = !DILocation(line: 0, scope: !278)
!281 = !DILocation(line: 127, column: 19, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !150, line: 126, column: 2)
!283 = !DILocation(line: 127, column: 3, scope: !282)
!284 = !DILocation(line: 128, column: 2, scope: !278)
!285 = distinct !DISubprogram(name: "USBD_Recv", linkageName: "_Z9USBD_RecvjPvj", scope: !150, file: !150, line: 140, type: !286, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!286 = !DISubroutineType(types: !287)
!287 = !{!23, !23, !288, !23}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!289 = !DILocalVariable(name: "ep", arg: 1, scope: !285, file: !150, line: 140, type: !23)
!290 = !DILocation(line: 140, column: 29, scope: !285)
!291 = !DILocalVariable(name: "d", arg: 2, scope: !285, file: !150, line: 140, type: !288)
!292 = !DILocation(line: 140, column: 39, scope: !285)
!293 = !DILocalVariable(name: "len", arg: 3, scope: !285, file: !150, line: 140, type: !23)
!294 = !DILocation(line: 140, column: 51, scope: !285)
!295 = !DILocation(line: 142, column: 7, scope: !296)
!296 = distinct !DILexicalBlock(scope: !285, file: !150, line: 142, column: 6)
!297 = !DILocation(line: 142, column: 6, scope: !285)
!298 = !DILocation(line: 143, column: 3, scope: !296)
!299 = !DILocalVariable(name: "lock", scope: !285, file: !150, line: 145, type: !251)
!300 = !DILocation(line: 145, column: 9, scope: !285)
!301 = !DILocation(line: 145, column: 14, scope: !285)
!302 = !DILocalVariable(name: "n", scope: !285, file: !150, line: 146, type: !23)
!303 = !DILocation(line: 146, column: 11, scope: !285)
!304 = !DILocation(line: 146, column: 33, scope: !285)
!305 = !DILocation(line: 146, column: 36, scope: !285)
!306 = !DILocation(line: 146, column: 15, scope: !285)
!307 = !DILocation(line: 147, column: 8, scope: !285)
!308 = !DILocation(line: 147, column: 6, scope: !285)
!309 = !DILocation(line: 148, column: 6, scope: !285)
!310 = !DILocation(line: 148, column: 4, scope: !285)
!311 = !DILocalVariable(name: "dst", scope: !285, file: !150, line: 149, type: !6)
!312 = !DILocation(line: 149, column: 11, scope: !285)
!313 = !DILocation(line: 149, column: 27, scope: !285)
!314 = !DILocation(line: 150, column: 2, scope: !285)
!315 = !DILocation(line: 150, column: 10, scope: !285)
!316 = !DILocation(line: 150, column: 9, scope: !285)
!317 = !DILocation(line: 151, column: 22, scope: !285)
!318 = !DILocation(line: 151, column: 25, scope: !285)
!319 = !DILocation(line: 151, column: 12, scope: !285)
!320 = !DILocation(line: 151, column: 7, scope: !285)
!321 = !DILocation(line: 151, column: 10, scope: !285)
!322 = distinct !{!322, !314, !323}
!323 = !DILocation(line: 151, column: 30, scope: !285)
!324 = !DILocation(line: 152, column: 6, scope: !325)
!325 = distinct !DILexicalBlock(scope: !285, file: !150, line: 152, column: 6)
!326 = !DILocation(line: 152, column: 10, scope: !325)
!327 = !DILocation(line: 152, column: 32, scope: !325)
!328 = !DILocation(line: 152, column: 35, scope: !325)
!329 = !DILocation(line: 152, column: 14, scope: !325)
!330 = !DILocation(line: 152, column: 6, scope: !285)
!331 = !DILocation(line: 153, column: 17, scope: !325)
!332 = !DILocation(line: 153, column: 20, scope: !325)
!333 = !DILocation(line: 153, column: 3, scope: !325)
!334 = !DILocation(line: 155, column: 9, scope: !285)
!335 = !DILocation(line: 155, column: 2, scope: !285)
!336 = !DILocation(line: 156, column: 1, scope: !285)
!337 = distinct !DISubprogram(name: "USBD_Recv", linkageName: "_Z9USBD_Recvj", scope: !150, file: !150, line: 159, type: !246, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!338 = !DILocalVariable(name: "ep", arg: 1, scope: !337, file: !150, line: 159, type: !23)
!339 = !DILocation(line: 159, column: 29, scope: !337)
!340 = !DILocalVariable(name: "c", scope: !337, file: !150, line: 161, type: !7)
!341 = !DILocation(line: 161, column: 10, scope: !337)
!342 = !DILocation(line: 162, column: 16, scope: !343)
!343 = distinct !DILexicalBlock(scope: !337, file: !150, line: 162, column: 6)
!344 = !DILocation(line: 162, column: 19, scope: !343)
!345 = !DILocation(line: 162, column: 6, scope: !343)
!346 = !DILocation(line: 162, column: 33, scope: !343)
!347 = !DILocation(line: 162, column: 6, scope: !337)
!348 = !DILocation(line: 163, column: 3, scope: !343)
!349 = !DILocation(line: 165, column: 10, scope: !343)
!350 = !DILocation(line: 165, column: 3, scope: !343)
!351 = !DILocation(line: 166, column: 1, scope: !337)
!352 = distinct !DISubprogram(name: "USBD_Send", linkageName: "_Z9USBD_SendjPKvj", scope: !150, file: !150, line: 183, type: !353, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!353 = !DISubroutineType(types: !354)
!354 = !{!23, !23, !355, !23}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!357 = !DILocalVariable(name: "ep", arg: 1, scope: !352, file: !150, line: 183, type: !23)
!358 = !DILocation(line: 183, column: 29, scope: !352)
!359 = !DILocalVariable(name: "d", arg: 2, scope: !352, file: !150, line: 183, type: !355)
!360 = !DILocation(line: 183, column: 45, scope: !352)
!361 = !DILocalVariable(name: "len", arg: 3, scope: !352, file: !150, line: 183, type: !23)
!362 = !DILocation(line: 183, column: 57, scope: !352)
!363 = !DILocalVariable(name: "n", scope: !352, file: !150, line: 185, type: !23)
!364 = !DILocation(line: 185, column: 14, scope: !352)
!365 = !DILocalVariable(name: "r", scope: !352, file: !150, line: 186, type: !366)
!366 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!367 = !DILocation(line: 186, column: 6, scope: !352)
!368 = !DILocation(line: 186, column: 10, scope: !352)
!369 = !DILocalVariable(name: "data", scope: !352, file: !150, line: 187, type: !12)
!370 = !DILocation(line: 187, column: 17, scope: !352)
!371 = !DILocation(line: 187, column: 40, scope: !352)
!372 = !DILocation(line: 189, column: 10, scope: !373)
!373 = distinct !DILexicalBlock(scope: !352, file: !150, line: 189, column: 9)
!374 = !DILocation(line: 189, column: 9, scope: !352)
!375 = !DILocation(line: 192, column: 3, scope: !376)
!376 = distinct !DILexicalBlock(scope: !373, file: !150, line: 190, column: 5)
!377 = !DILocation(line: 195, column: 2, scope: !352)
!378 = !DILocation(line: 195, column: 9, scope: !352)
!379 = !DILocation(line: 197, column: 12, scope: !380)
!380 = distinct !DILexicalBlock(scope: !381, file: !150, line: 197, column: 12)
!381 = distinct !DILexicalBlock(scope: !352, file: !150, line: 196, column: 2)
!382 = !DILocation(line: 197, column: 14, scope: !380)
!383 = !DILocation(line: 197, column: 12, scope: !381)
!384 = !DILocation(line: 197, column: 21, scope: !380)
!385 = !DILocation(line: 197, column: 19, scope: !380)
!386 = !DILocation(line: 198, column: 16, scope: !380)
!387 = !DILocation(line: 199, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !381, file: !150, line: 199, column: 7)
!389 = !DILocation(line: 199, column: 11, scope: !388)
!390 = !DILocation(line: 199, column: 9, scope: !388)
!391 = !DILocation(line: 199, column: 7, scope: !381)
!392 = !DILocation(line: 200, column: 8, scope: !388)
!393 = !DILocation(line: 200, column: 6, scope: !388)
!394 = !DILocation(line: 200, column: 4, scope: !388)
!395 = !DILocation(line: 201, column: 10, scope: !381)
!396 = !DILocation(line: 201, column: 7, scope: !381)
!397 = !DILocation(line: 203, column: 12, scope: !381)
!398 = !DILocation(line: 203, column: 15, scope: !381)
!399 = !DILocation(line: 203, column: 22, scope: !381)
!400 = !DILocation(line: 203, column: 28, scope: !381)
!401 = !DILocation(line: 203, column: 3, scope: !381)
!402 = !DILocation(line: 204, column: 11, scope: !381)
!403 = !DILocation(line: 204, column: 8, scope: !381)
!404 = distinct !{!404, !377, !405}
!405 = !DILocation(line: 205, column: 5, scope: !352)
!406 = !DILocation(line: 208, column: 9, scope: !352)
!407 = !DILocation(line: 208, column: 2, scope: !352)
!408 = !DILocation(line: 209, column: 1, scope: !352)
!409 = distinct !DISubprogram(name: "USBD_InitControl", linkageName: "_Z16USBD_InitControli", scope: !150, file: !150, line: 214, type: !410, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !366}
!412 = !DILocalVariable(name: "end", arg: 1, scope: !409, file: !150, line: 214, type: !366)
!413 = !DILocation(line: 214, column: 27, scope: !409)
!414 = !DILocation(line: 216, column: 9, scope: !409)
!415 = !DILocation(line: 217, column: 10, scope: !409)
!416 = !DILocation(line: 217, column: 8, scope: !409)
!417 = !DILocation(line: 218, column: 1, scope: !409)
!418 = distinct !DISubprogram(name: "USBD_SendControl", linkageName: "_Z16USBD_SendControlhPKvj", scope: !150, file: !150, line: 221, type: !419, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!419 = !DISubroutineType(types: !420)
!420 = !{!366, !7, !355, !23}
!421 = !DILocalVariable(name: "flags", arg: 1, scope: !418, file: !150, line: 221, type: !7)
!422 = !DILocation(line: 221, column: 30, scope: !418)
!423 = !DILocalVariable(name: "d", arg: 2, scope: !418, file: !150, line: 221, type: !355)
!424 = !DILocation(line: 221, column: 74, scope: !418)
!425 = !DILocalVariable(name: "len", arg: 3, scope: !418, file: !150, line: 221, type: !23)
!426 = !DILocation(line: 221, column: 86, scope: !418)
!427 = !DILocalVariable(name: "data", scope: !418, file: !150, line: 223, type: !12)
!428 = !DILocation(line: 223, column: 17, scope: !418)
!429 = !DILocation(line: 223, column: 40, scope: !418)
!430 = !DILocalVariable(name: "length", scope: !418, file: !150, line: 224, type: !23)
!431 = !DILocation(line: 224, column: 11, scope: !418)
!432 = !DILocation(line: 224, column: 20, scope: !418)
!433 = !DILocalVariable(name: "sent", scope: !418, file: !150, line: 225, type: !23)
!434 = !DILocation(line: 225, column: 11, scope: !418)
!435 = !DILocalVariable(name: "pos", scope: !418, file: !150, line: 226, type: !23)
!436 = !DILocation(line: 226, column: 11, scope: !418)
!437 = !DILocation(line: 230, column: 6, scope: !438)
!438 = distinct !DILexicalBlock(scope: !418, file: !150, line: 230, column: 6)
!439 = !DILocation(line: 230, column: 15, scope: !438)
!440 = !DILocation(line: 230, column: 13, scope: !438)
!441 = !DILocation(line: 230, column: 6, scope: !418)
!442 = !DILocation(line: 232, column: 3, scope: !443)
!443 = distinct !DILexicalBlock(scope: !438, file: !150, line: 231, column: 2)
!444 = !DILocation(line: 232, column: 10, scope: !443)
!445 = !DILocation(line: 232, column: 14, scope: !443)
!446 = !DILocation(line: 234, column: 25, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !150, line: 233, column: 3)
!448 = !DILocation(line: 234, column: 32, scope: !447)
!449 = !DILocation(line: 234, column: 30, scope: !447)
!450 = !DILocation(line: 234, column: 37, scope: !447)
!451 = !DILocation(line: 234, column: 11, scope: !447)
!452 = !DILocation(line: 234, column: 9, scope: !447)
!453 = !DILocation(line: 236, column: 11, scope: !447)
!454 = !DILocation(line: 236, column: 8, scope: !447)
!455 = !DILocation(line: 237, column: 11, scope: !447)
!456 = !DILocation(line: 237, column: 8, scope: !447)
!457 = distinct !{!457, !442, !458}
!458 = !DILocation(line: 238, column: 3, scope: !443)
!459 = !DILocation(line: 239, column: 2, scope: !443)
!460 = !DILocation(line: 241, column: 12, scope: !418)
!461 = !DILocation(line: 241, column: 9, scope: !418)
!462 = !DILocation(line: 243, column: 9, scope: !418)
!463 = !DILocation(line: 243, column: 2, scope: !418)
!464 = distinct !DISubprogram(name: "USBD_RecvControl", linkageName: "_Z16USBD_RecvControlPvj", scope: !150, file: !150, line: 270, type: !465, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!465 = !DISubroutineType(types: !466)
!466 = !{!366, !288, !23}
!467 = !DILocalVariable(name: "d", arg: 1, scope: !464, file: !150, line: 270, type: !288)
!468 = !DILocation(line: 270, column: 28, scope: !464)
!469 = !DILocalVariable(name: "len", arg: 2, scope: !464, file: !150, line: 270, type: !23)
!470 = !DILocation(line: 270, column: 40, scope: !464)
!471 = !DILocation(line: 272, column: 2, scope: !464)
!472 = !DILocation(line: 273, column: 26, scope: !464)
!473 = !DILocation(line: 273, column: 29, scope: !464)
!474 = !DILocation(line: 273, column: 2, scope: !464)
!475 = !DILocation(line: 274, column: 2, scope: !464)
!476 = !DILocation(line: 276, column: 9, scope: !464)
!477 = !DILocation(line: 276, column: 2, scope: !464)
!478 = distinct !DISubprogram(name: "USBD_ClassInterfaceRequest", linkageName: "_Z26USBD_ClassInterfaceRequestR8USBSetup", scope: !150, file: !150, line: 280, type: !479, scopeLine: 281, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!479 = !DISubroutineType(types: !480)
!480 = !{!211, !481}
!481 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "USBSetup", file: !202, line: 120, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 112, size: 64, flags: DIFlagTypePassByValue, elements: !484, identifier: "_ZTS8USBSetup")
!484 = !{!485, !486, !487, !488, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bmRequestType", scope: !483, file: !202, line: 114, baseType: !7, size: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bRequest", scope: !483, file: !202, line: 115, baseType: !7, size: 8, offset: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wValueL", scope: !483, file: !202, line: 116, baseType: !7, size: 8, offset: 16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "wValueH", scope: !483, file: !202, line: 117, baseType: !7, size: 8, offset: 24)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "wIndex", scope: !483, file: !202, line: 118, baseType: !141, size: 16, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wLength", scope: !483, file: !202, line: 119, baseType: !141, size: 16, offset: 48)
!491 = !DILocalVariable(name: "setup", arg: 1, scope: !478, file: !150, line: 280, type: !481)
!492 = !DILocation(line: 280, column: 43, scope: !478)
!493 = !DILocalVariable(name: "i", scope: !478, file: !150, line: 282, type: !7)
!494 = !DILocation(line: 282, column: 10, scope: !478)
!495 = !DILocation(line: 282, column: 14, scope: !478)
!496 = !DILocation(line: 282, column: 20, scope: !478)
!497 = !DILocation(line: 287, column: 27, scope: !498)
!498 = distinct !DILexicalBlock(scope: !478, file: !150, line: 287, column: 6)
!499 = !DILocation(line: 287, column: 24, scope: !498)
!500 = !DILocation(line: 287, column: 6, scope: !478)
!501 = !DILocation(line: 289, column: 20, scope: !502)
!502 = distinct !DILexicalBlock(scope: !498, file: !150, line: 288, column: 2)
!503 = !DILocation(line: 289, column: 10, scope: !502)
!504 = !DILocation(line: 289, column: 3, scope: !502)
!505 = !DILocation(line: 294, column: 9, scope: !478)
!506 = !DILocation(line: 294, column: 30, scope: !478)
!507 = !DILocation(line: 294, column: 24, scope: !478)
!508 = !DILocation(line: 294, column: 2, scope: !478)
!509 = !DILocation(line: 298, column: 1, scope: !478)
!510 = distinct !DISubprogram(name: "USBD_SendInterfaces", linkageName: "_Z19USBD_SendInterfacesv", scope: !150, file: !150, line: 300, type: !511, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!511 = !DISubroutineType(types: !512)
!512 = !{!7}
!513 = !DILocalVariable(name: "interfaces", scope: !510, file: !150, line: 302, type: !7)
!514 = !DILocation(line: 302, column: 10, scope: !510)
!515 = !DILocation(line: 305, column: 2, scope: !510)
!516 = !DILocation(line: 309, column: 2, scope: !510)
!517 = !DILocation(line: 309, column: 17, scope: !510)
!518 = !DILocation(line: 313, column: 9, scope: !510)
!519 = !DILocation(line: 313, column: 2, scope: !510)
!520 = distinct !DISubprogram(name: "USBD_SendOtherInterfaces", linkageName: "_Z24USBD_SendOtherInterfacesv", scope: !150, file: !150, line: 316, type: !511, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!521 = !DILocalVariable(name: "interfaces", scope: !520, file: !150, line: 318, type: !7)
!522 = !DILocation(line: 318, column: 10, scope: !520)
!523 = !DILocation(line: 321, column: 2, scope: !520)
!524 = !DILocation(line: 325, column: 2, scope: !520)
!525 = !DILocation(line: 325, column: 17, scope: !520)
!526 = !DILocation(line: 329, column: 9, scope: !520)
!527 = !DILocation(line: 329, column: 2, scope: !520)
!528 = distinct !DISubprogram(name: "USBD_Flush", linkageName: "_Z10USBD_Flushj", scope: !150, file: !150, line: 825, type: !529, scopeLine: 826, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !23}
!531 = !DILocalVariable(name: "ep", arg: 1, scope: !528, file: !150, line: 825, type: !23)
!532 = !DILocation(line: 825, column: 26, scope: !528)
!533 = !DILocation(line: 827, column: 24, scope: !534)
!534 = distinct !DILexicalBlock(scope: !528, file: !150, line: 827, column: 6)
!535 = !DILocation(line: 827, column: 6, scope: !534)
!536 = !DILocation(line: 827, column: 6, scope: !528)
!537 = !DILocation(line: 828, column: 17, scope: !534)
!538 = !DILocation(line: 828, column: 3, scope: !534)
!539 = !DILocation(line: 829, column: 1, scope: !528)
!540 = distinct !DISubprogram(name: "USBD_Connected", linkageName: "_Z14USBD_Connectedv", scope: !150, file: !150, line: 833, type: !541, scopeLine: 834, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!541 = !DISubroutineType(types: !542)
!542 = !{!23}
!543 = !DILocalVariable(name: "f", scope: !540, file: !150, line: 835, type: !7)
!544 = !DILocation(line: 835, column: 10, scope: !540)
!545 = !DILocation(line: 835, column: 14, scope: !540)
!546 = !DILocation(line: 837, column: 2, scope: !540)
!547 = !DILocation(line: 839, column: 9, scope: !540)
!548 = !DILocation(line: 839, column: 14, scope: !540)
!549 = !DILocation(line: 839, column: 11, scope: !540)
!550 = !DILocation(line: 839, column: 2, scope: !540)
!551 = distinct !DISubprogram(name: "__cxx_global_var_init", scope: !150, file: !150, line: 846, type: !552, scopeLine: 846, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!552 = !DISubroutineType(types: !553)
!553 = !{null}
!554 = !DILocation(line: 846, column: 12, scope: !551)
!555 = distinct !DISubprogram(name: "USBDevice_", linkageName: "_ZN10USBDevice_C2Ev", scope: !201, file: !150, line: 848, type: !205, scopeLine: 849, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !204, retainedNodes: !4)
!556 = !DILocalVariable(name: "this", arg: 1, scope: !555, type: !557, flags: DIFlagArtificial | DIFlagObjectPointer)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!558 = !DILocation(line: 0, scope: !555)
!559 = !DILocation(line: 850, column: 2, scope: !560)
!560 = distinct !DILexicalBlock(scope: !555, file: !150, line: 849, column: 1)
!561 = !DILocation(line: 852, column: 6, scope: !562)
!562 = distinct !DILexicalBlock(scope: !560, file: !150, line: 852, column: 6)
!563 = !DILocation(line: 852, column: 17, scope: !562)
!564 = !DILocation(line: 852, column: 6, scope: !560)
!565 = !DILocation(line: 854, column: 18, scope: !566)
!566 = distinct !DILexicalBlock(scope: !562, file: !150, line: 853, column: 2)
!567 = !DILocation(line: 855, column: 2, scope: !566)
!568 = !DILocation(line: 856, column: 1, scope: !555)
!569 = distinct !DISubprogram(name: "USB_ISR", linkageName: "_ZL7USB_ISRv", scope: !150, file: !150, line: 600, type: !552, scopeLine: 601, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!570 = !DILocation(line: 605, column: 9, scope: !571)
!571 = distinct !DILexicalBlock(scope: !569, file: !150, line: 605, column: 9)
!572 = !DILocation(line: 605, column: 9, scope: !569)
!573 = !DILocation(line: 610, column: 3, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !150, line: 606, column: 5)
!575 = !DILocation(line: 611, column: 3, scope: !574)
!576 = !DILocation(line: 614, column: 9, scope: !574)
!577 = !DILocation(line: 615, column: 3, scope: !574)
!578 = !DILocation(line: 616, column: 3, scope: !574)
!579 = !DILocation(line: 618, column: 27, scope: !574)
!580 = !DILocation(line: 619, column: 3, scope: !574)
!581 = !DILocation(line: 620, column: 5, scope: !574)
!582 = !DILocation(line: 623, column: 8, scope: !583)
!583 = distinct !DILexicalBlock(scope: !569, file: !150, line: 623, column: 8)
!584 = !DILocation(line: 623, column: 8, scope: !569)
!585 = !DILocation(line: 625, column: 3, scope: !586)
!586 = distinct !DILexicalBlock(scope: !583, file: !150, line: 624, column: 2)
!587 = !DILocation(line: 628, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !586, file: !150, line: 628, column: 7)
!589 = !DILocation(line: 628, column: 7, scope: !586)
!590 = !DILocation(line: 629, column: 14, scope: !588)
!591 = !DILocation(line: 629, column: 4, scope: !588)
!592 = !DILocation(line: 630, column: 2, scope: !586)
!593 = !DILocation(line: 632, column: 6, scope: !594)
!594 = distinct !DILexicalBlock(scope: !569, file: !150, line: 632, column: 6)
!595 = !DILocation(line: 632, column: 6, scope: !569)
!596 = !DILocation(line: 634, column: 3, scope: !597)
!597 = distinct !DILexicalBlock(scope: !594, file: !150, line: 633, column: 2)
!598 = !DILocation(line: 636, column: 2, scope: !597)
!599 = !DILocation(line: 640, column: 6, scope: !600)
!600 = distinct !DILexicalBlock(scope: !569, file: !150, line: 640, column: 6)
!601 = !DILocation(line: 640, column: 6, scope: !569)
!602 = !DILocation(line: 642, column: 8, scope: !603)
!603 = distinct !DILexicalBlock(scope: !604, file: !150, line: 642, column: 7)
!604 = distinct !DILexicalBlock(scope: !600, file: !150, line: 641, column: 2)
!605 = !DILocation(line: 642, column: 7, scope: !604)
!606 = !DILocation(line: 644, column: 4, scope: !607)
!607 = distinct !DILexicalBlock(scope: !603, file: !150, line: 643, column: 3)
!608 = !DILocalVariable(name: "setup", scope: !604, file: !150, line: 647, type: !482)
!609 = !DILocation(line: 647, column: 12, scope: !604)
!610 = !DILocation(line: 648, column: 17, scope: !604)
!611 = !DILocation(line: 648, column: 3, scope: !604)
!612 = !DILocation(line: 649, column: 3, scope: !604)
!613 = !DILocalVariable(name: "requestType", scope: !604, file: !150, line: 651, type: !7)
!614 = !DILocation(line: 651, column: 11, scope: !604)
!615 = !DILocation(line: 651, column: 31, scope: !604)
!616 = !DILocation(line: 652, column: 7, scope: !617)
!617 = distinct !DILexicalBlock(scope: !604, file: !150, line: 652, column: 7)
!618 = !DILocation(line: 652, column: 19, scope: !617)
!619 = !DILocation(line: 652, column: 7, scope: !604)
!620 = !DILocation(line: 655, column: 4, scope: !621)
!621 = distinct !DILexicalBlock(scope: !617, file: !150, line: 653, column: 3)
!622 = !DILocation(line: 656, column: 3, scope: !621)
!623 = !DILocation(line: 660, column: 4, scope: !624)
!624 = distinct !DILexicalBlock(scope: !617, file: !150, line: 658, column: 3)
!625 = !DILocalVariable(name: "ok", scope: !604, file: !150, line: 663, type: !211)
!626 = !DILocation(line: 663, column: 8, scope: !604)
!627 = !DILocation(line: 664, column: 28, scope: !628)
!628 = distinct !DILexicalBlock(scope: !604, file: !150, line: 664, column: 7)
!629 = !DILocation(line: 664, column: 40, scope: !628)
!630 = !DILocation(line: 664, column: 24, scope: !628)
!631 = !DILocation(line: 664, column: 7, scope: !604)
!632 = !DILocalVariable(name: "r", scope: !633, file: !150, line: 667, type: !7)
!633 = distinct !DILexicalBlock(scope: !628, file: !150, line: 665, column: 3)
!634 = !DILocation(line: 667, column: 12, scope: !633)
!635 = !DILocation(line: 667, column: 22, scope: !633)
!636 = !DILocation(line: 668, column: 22, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !150, line: 668, column: 8)
!638 = !DILocation(line: 668, column: 19, scope: !637)
!639 = !DILocation(line: 668, column: 8, scope: !633)
!640 = !DILocation(line: 670, column: 27, scope: !641)
!641 = distinct !DILexicalBlock(scope: !642, file: !150, line: 670, column: 21)
!642 = distinct !DILexicalBlock(scope: !637, file: !150, line: 669, column: 4)
!643 = !DILocation(line: 670, column: 21, scope: !641)
!644 = !DILocation(line: 670, column: 41, scope: !641)
!645 = !DILocation(line: 670, column: 21, scope: !642)
!646 = !DILocation(line: 678, column: 21, scope: !647)
!647 = distinct !DILexicalBlock(scope: !641, file: !150, line: 671, column: 17)
!648 = !DILocation(line: 679, column: 9, scope: !647)
!649 = !DILocation(line: 680, column: 17, scope: !647)
!650 = !DILocation(line: 686, column: 25, scope: !651)
!651 = distinct !DILexicalBlock(scope: !652, file: !150, line: 686, column: 25)
!652 = distinct !DILexicalBlock(scope: !641, file: !150, line: 683, column: 17)
!653 = !DILocation(line: 686, column: 40, scope: !651)
!654 = !DILocation(line: 686, column: 25, scope: !652)
!655 = !DILocation(line: 687, column: 9, scope: !651)
!656 = !DILocation(line: 689, column: 9, scope: !651)
!657 = !DILocation(line: 690, column: 9, scope: !652)
!658 = !DILocation(line: 692, column: 4, scope: !642)
!659 = !DILocation(line: 693, column: 30, scope: !660)
!660 = distinct !DILexicalBlock(scope: !637, file: !150, line: 693, column: 13)
!661 = !DILocation(line: 693, column: 27, scope: !660)
!662 = !DILocation(line: 693, column: 13, scope: !637)
!663 = !DILocation(line: 696, column: 27, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !150, line: 696, column: 21)
!665 = distinct !DILexicalBlock(scope: !660, file: !150, line: 694, column: 4)
!666 = !DILocation(line: 696, column: 21, scope: !664)
!667 = !DILocation(line: 696, column: 35, scope: !664)
!668 = !DILocation(line: 696, column: 21, scope: !665)
!669 = !DILocation(line: 699, column: 25, scope: !670)
!670 = distinct !DILexicalBlock(scope: !671, file: !150, line: 699, column: 25)
!671 = distinct !DILexicalBlock(scope: !664, file: !150, line: 697, column: 17)
!672 = !DILocation(line: 699, column: 47, scope: !670)
!673 = !DILocation(line: 699, column: 25, scope: !671)
!674 = !DILocation(line: 700, column: 9, scope: !670)
!675 = !DILocation(line: 702, column: 9, scope: !670)
!676 = !DILocation(line: 703, column: 21, scope: !671)
!677 = !DILocation(line: 704, column: 17, scope: !671)
!678 = !DILocation(line: 707, column: 36, scope: !679)
!679 = distinct !DILexicalBlock(scope: !664, file: !150, line: 706, column: 17)
!680 = !DILocation(line: 708, column: 9, scope: !679)
!681 = !DILocation(line: 709, column: 9, scope: !679)
!682 = !DILocation(line: 712, column: 5, scope: !665)
!683 = !DILocation(line: 713, column: 28, scope: !684)
!684 = distinct !DILexicalBlock(scope: !660, file: !150, line: 713, column: 13)
!685 = !DILocation(line: 713, column: 25, scope: !684)
!686 = !DILocation(line: 713, column: 13, scope: !660)
!687 = !DILocation(line: 716, column: 27, scope: !688)
!688 = distinct !DILexicalBlock(scope: !689, file: !150, line: 716, column: 21)
!689 = distinct !DILexicalBlock(scope: !684, file: !150, line: 714, column: 4)
!690 = !DILocation(line: 716, column: 21, scope: !688)
!691 = !DILocation(line: 716, column: 35, scope: !688)
!692 = !DILocation(line: 716, column: 21, scope: !689)
!693 = !DILocation(line: 719, column: 43, scope: !694)
!694 = distinct !DILexicalBlock(scope: !688, file: !150, line: 717, column: 17)
!695 = !DILocation(line: 720, column: 9, scope: !694)
!696 = !DILocation(line: 721, column: 17, scope: !694)
!697 = !DILocation(line: 722, column: 27, scope: !698)
!698 = distinct !DILexicalBlock(scope: !689, file: !150, line: 722, column: 21)
!699 = !DILocation(line: 722, column: 21, scope: !698)
!700 = !DILocation(line: 722, column: 35, scope: !698)
!701 = !DILocation(line: 722, column: 21, scope: !689)
!702 = !DILocation(line: 725, column: 36, scope: !703)
!703 = distinct !DILexicalBlock(scope: !698, file: !150, line: 723, column: 17)
!704 = !DILocation(line: 727, column: 9, scope: !703)
!705 = !DILocation(line: 728, column: 17, scope: !703)
!706 = !DILocation(line: 729, column: 27, scope: !707)
!707 = distinct !DILexicalBlock(scope: !689, file: !150, line: 729, column: 21)
!708 = !DILocation(line: 729, column: 21, scope: !707)
!709 = !DILocation(line: 729, column: 35, scope: !707)
!710 = !DILocation(line: 729, column: 21, scope: !689)
!711 = !DILocation(line: 732, column: 32, scope: !712)
!712 = distinct !DILexicalBlock(scope: !713, file: !150, line: 732, column: 25)
!713 = distinct !DILexicalBlock(scope: !707, file: !150, line: 730, column: 17)
!714 = !DILocation(line: 732, column: 26, scope: !712)
!715 = !DILocation(line: 732, column: 46, scope: !712)
!716 = !DILocation(line: 732, column: 81, scope: !712)
!717 = !DILocation(line: 733, column: 33, scope: !712)
!718 = !DILocation(line: 733, column: 27, scope: !712)
!719 = !DILocation(line: 733, column: 40, scope: !712)
!720 = !DILocation(line: 733, column: 50, scope: !712)
!721 = !DILocation(line: 732, column: 25, scope: !713)
!722 = !DILocation(line: 738, column: 47, scope: !723)
!723 = distinct !DILexicalBlock(scope: !712, file: !150, line: 734, column: 21)
!724 = !DILocation(line: 739, column: 48, scope: !723)
!725 = !DILocation(line: 741, column: 51, scope: !723)
!726 = !DILocation(line: 741, column: 45, scope: !723)
!727 = !DILocation(line: 741, column: 58, scope: !723)
!728 = !DILocation(line: 741, column: 67, scope: !723)
!729 = !DILocation(line: 741, column: 44, scope: !723)
!730 = !DILocation(line: 741, column: 25, scope: !723)
!731 = !DILocation(line: 742, column: 21, scope: !723)
!732 = !DILocation(line: 743, column: 17, scope: !713)
!733 = !DILocation(line: 744, column: 4, scope: !689)
!734 = !DILocation(line: 745, column: 28, scope: !735)
!735 = distinct !DILexicalBlock(scope: !684, file: !150, line: 745, column: 13)
!736 = !DILocation(line: 745, column: 25, scope: !735)
!737 = !DILocation(line: 745, column: 13, scope: !684)
!738 = !DILocation(line: 748, column: 5, scope: !739)
!739 = distinct !DILexicalBlock(scope: !735, file: !150, line: 746, column: 4)
!740 = !DILocation(line: 749, column: 26, scope: !739)
!741 = !DILocation(line: 749, column: 20, scope: !739)
!742 = !DILocation(line: 749, column: 5, scope: !739)
!743 = !DILocation(line: 750, column: 4, scope: !739)
!744 = !DILocation(line: 751, column: 31, scope: !745)
!745 = distinct !DILexicalBlock(scope: !735, file: !150, line: 751, column: 13)
!746 = !DILocation(line: 751, column: 28, scope: !745)
!747 = !DILocation(line: 751, column: 13, scope: !735)
!748 = !DILocation(line: 754, column: 10, scope: !749)
!749 = distinct !DILexicalBlock(scope: !745, file: !150, line: 752, column: 4)
!750 = !DILocation(line: 754, column: 8, scope: !749)
!751 = !DILocation(line: 755, column: 4, scope: !749)
!752 = !DILocation(line: 756, column: 31, scope: !753)
!753 = distinct !DILexicalBlock(scope: !745, file: !150, line: 756, column: 13)
!754 = !DILocation(line: 756, column: 28, scope: !753)
!755 = !DILocation(line: 756, column: 13, scope: !745)
!756 = !DILocation(line: 759, column: 8, scope: !757)
!757 = distinct !DILexicalBlock(scope: !753, file: !150, line: 757, column: 4)
!758 = !DILocation(line: 760, column: 4, scope: !757)
!759 = !DILocation(line: 761, column: 34, scope: !760)
!760 = distinct !DILexicalBlock(scope: !753, file: !150, line: 761, column: 13)
!761 = !DILocation(line: 761, column: 31, scope: !760)
!762 = !DILocation(line: 761, column: 13, scope: !753)
!763 = !DILocation(line: 764, column: 20, scope: !764)
!764 = distinct !DILexicalBlock(scope: !760, file: !150, line: 762, column: 4)
!765 = !DILocation(line: 764, column: 5, scope: !764)
!766 = !DILocation(line: 765, column: 4, scope: !764)
!767 = !DILocation(line: 766, column: 34, scope: !768)
!768 = distinct !DILexicalBlock(scope: !760, file: !150, line: 766, column: 13)
!769 = !DILocation(line: 766, column: 31, scope: !768)
!770 = !DILocation(line: 766, column: 13, scope: !760)
!771 = !DILocation(line: 768, column: 28, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !150, line: 768, column: 9)
!773 = distinct !DILexicalBlock(scope: !768, file: !150, line: 767, column: 4)
!774 = !DILocation(line: 768, column: 40, scope: !772)
!775 = !DILocation(line: 768, column: 24, scope: !772)
!776 = !DILocation(line: 768, column: 9, scope: !773)
!777 = !DILocalVariable(name: "num_endpoints", scope: !778, file: !150, line: 772, type: !23)
!778 = distinct !DILexicalBlock(scope: !772, file: !150, line: 769, column: 5)
!779 = !DILocation(line: 772, column: 15, scope: !778)
!780 = !DILocation(line: 773, column: 6, scope: !778)
!781 = !DILocation(line: 773, column: 23, scope: !778)
!782 = !DILocation(line: 773, column: 13, scope: !778)
!783 = !DILocation(line: 773, column: 38, scope: !778)
!784 = !DILocation(line: 774, column: 20, scope: !785)
!785 = distinct !DILexicalBlock(scope: !778, file: !150, line: 773, column: 44)
!786 = distinct !{!786, !780, !787}
!787 = !DILocation(line: 775, column: 6, scope: !778)
!788 = !DILocation(line: 776, column: 35, scope: !778)
!789 = !DILocation(line: 776, column: 6, scope: !778)
!790 = !DILocation(line: 777, column: 32, scope: !778)
!791 = !DILocation(line: 777, column: 26, scope: !778)
!792 = !DILocation(line: 777, column: 24, scope: !778)
!793 = !DILocation(line: 781, column: 6, scope: !778)
!794 = !DILocation(line: 782, column: 6, scope: !778)
!795 = !DILocation(line: 784, column: 5, scope: !778)
!796 = !DILocation(line: 788, column: 9, scope: !797)
!797 = distinct !DILexicalBlock(scope: !772, file: !150, line: 786, column: 5)
!798 = !DILocation(line: 790, column: 4, scope: !773)
!799 = !DILocation(line: 791, column: 30, scope: !800)
!800 = distinct !DILexicalBlock(scope: !768, file: !150, line: 791, column: 13)
!801 = !DILocation(line: 791, column: 27, scope: !800)
!802 = !DILocation(line: 791, column: 13, scope: !768)
!803 = !DILocation(line: 794, column: 20, scope: !804)
!804 = distinct !DILexicalBlock(scope: !800, file: !150, line: 792, column: 4)
!805 = !DILocation(line: 794, column: 5, scope: !804)
!806 = !DILocation(line: 795, column: 4, scope: !804)
!807 = !DILocation(line: 796, column: 30, scope: !808)
!808 = distinct !DILexicalBlock(scope: !800, file: !150, line: 796, column: 13)
!809 = !DILocation(line: 796, column: 27, scope: !808)
!810 = !DILocation(line: 796, column: 13, scope: !800)
!811 = !DILocation(line: 798, column: 42, scope: !812)
!812 = distinct !DILexicalBlock(scope: !808, file: !150, line: 797, column: 4)
!813 = !DILocation(line: 798, column: 36, scope: !812)
!814 = !DILocation(line: 798, column: 34, scope: !812)
!815 = !DILocation(line: 800, column: 4, scope: !812)
!816 = !DILocation(line: 801, column: 3, scope: !633)
!817 = !DILocation(line: 806, column: 4, scope: !818)
!818 = distinct !DILexicalBlock(scope: !628, file: !150, line: 803, column: 3)
!819 = !DILocation(line: 808, column: 27, scope: !818)
!820 = !DILocation(line: 808, column: 21, scope: !818)
!821 = !DILocation(line: 808, column: 4, scope: !818)
!822 = !DILocation(line: 809, column: 9, scope: !818)
!823 = !DILocation(line: 809, column: 7, scope: !818)
!824 = !DILocation(line: 812, column: 7, scope: !825)
!825 = distinct !DILexicalBlock(scope: !604, file: !150, line: 812, column: 7)
!826 = !DILocation(line: 812, column: 7, scope: !604)
!827 = !DILocation(line: 815, column: 4, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !150, line: 813, column: 3)
!829 = !DILocation(line: 816, column: 3, scope: !828)
!830 = !DILocation(line: 820, column: 4, scope: !831)
!831 = distinct !DILexicalBlock(scope: !825, file: !150, line: 818, column: 3)
!832 = !DILocation(line: 822, column: 2, scope: !604)
!833 = !DILocation(line: 823, column: 1, scope: !569)
!834 = distinct !DISubprogram(name: "attach", linkageName: "_ZN10USBDevice_6attachEv", scope: !201, file: !150, line: 858, type: !209, scopeLine: 859, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !212, retainedNodes: !4)
!835 = !DILocalVariable(name: "this", arg: 1, scope: !834, type: !557, flags: DIFlagArtificial | DIFlagObjectPointer)
!836 = !DILocation(line: 0, scope: !834)
!837 = !DILocation(line: 860, column: 7, scope: !838)
!838 = distinct !DILexicalBlock(scope: !834, file: !150, line: 860, column: 7)
!839 = !DILocation(line: 860, column: 23, scope: !838)
!840 = !DILocation(line: 860, column: 7, scope: !834)
!841 = !DILocation(line: 862, column: 5, scope: !842)
!842 = distinct !DILexicalBlock(scope: !838, file: !150, line: 861, column: 3)
!843 = !DILocation(line: 863, column: 20, scope: !842)
!844 = !DILocation(line: 864, column: 2, scope: !842)
!845 = !DILocation(line: 868, column: 5, scope: !846)
!846 = distinct !DILexicalBlock(scope: !838, file: !150, line: 867, column: 3)
!847 = !DILocation(line: 870, column: 1, scope: !834)
!848 = distinct !DISubprogram(name: "detach", linkageName: "_ZN10USBDevice_6detachEv", scope: !201, file: !150, line: 872, type: !209, scopeLine: 873, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !213, retainedNodes: !4)
!849 = !DILocalVariable(name: "this", arg: 1, scope: !848, type: !557, flags: DIFlagArtificial | DIFlagObjectPointer)
!850 = !DILocation(line: 0, scope: !848)
!851 = !DILocation(line: 874, column: 6, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !150, line: 874, column: 6)
!853 = !DILocation(line: 874, column: 22, scope: !852)
!854 = !DILocation(line: 874, column: 6, scope: !848)
!855 = !DILocation(line: 876, column: 3, scope: !856)
!856 = distinct !DILexicalBlock(scope: !852, file: !150, line: 875, column: 2)
!857 = !DILocation(line: 877, column: 3, scope: !856)
!858 = !DILocation(line: 881, column: 3, scope: !859)
!859 = distinct !DILexicalBlock(scope: !852, file: !150, line: 880, column: 2)
!860 = !DILocation(line: 883, column: 1, scope: !848)
!861 = distinct !DISubprogram(name: "configured", linkageName: "_ZN10USBDevice_10configuredEv", scope: !201, file: !150, line: 887, type: !209, scopeLine: 888, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !208, retainedNodes: !4)
!862 = !DILocalVariable(name: "this", arg: 1, scope: !861, type: !557, flags: DIFlagArtificial | DIFlagObjectPointer)
!863 = !DILocation(line: 0, scope: !861)
!864 = !DILocation(line: 889, column: 9, scope: !861)
!865 = !DILocation(line: 889, column: 2, scope: !861)
!866 = distinct !DISubprogram(name: "poll", linkageName: "_ZN10USBDevice_4pollEv", scope: !201, file: !150, line: 892, type: !205, scopeLine: 893, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, declaration: !214, retainedNodes: !4)
!867 = !DILocalVariable(name: "this", arg: 1, scope: !866, type: !557, flags: DIFlagArtificial | DIFlagObjectPointer)
!868 = !DILocation(line: 0, scope: !866)
!869 = !DILocation(line: 894, column: 1, scope: !866)
!870 = distinct !DISubprogram(name: "cpu_irq_save", linkageName: "_ZL12cpu_irq_savev", scope: !255, file: !255, line: 120, type: !871, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!871 = !DISubroutineType(types: !872)
!872 = !{!254}
!873 = !DILocalVariable(name: "flags", scope: !870, file: !255, line: 122, type: !254)
!874 = !DILocation(line: 122, column: 13, scope: !870)
!875 = !DILocation(line: 122, column: 21, scope: !870)
!876 = !DILocation(line: 123, column: 2, scope: !870)
!877 = !DILocation(line: 321, column: 3, scope: !878, inlinedAt: !880)
!878 = distinct !DISubprogram(name: "__disable_irq", linkageName: "_ZL13__disable_irqv", scope: !879, file: !879, line: 319, type: !552, scopeLine: 320, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!879 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/CMSIS/Include/core_cmFunc.h", directory: "/home/aaa")
!880 = distinct !DILocation(line: 123, column: 2, scope: !881)
!881 = distinct !DILexicalBlock(scope: !870, file: !255, line: 123, column: 2)
!882 = !{i32 388914}
!883 = !DILocation(line: 337, column: 3, scope: !884, inlinedAt: !886)
!884 = distinct !DISubprogram(name: "__DMB", linkageName: "_ZL5__DMBv", scope: !885, file: !885, line: 335, type: !552, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!885 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/CMSIS/Include/core_cmInstr.h", directory: "/home/aaa")
!886 = distinct !DILocation(line: 123, column: 2, scope: !881)
!887 = !{i32 374096}
!888 = !DILocation(line: 123, column: 2, scope: !881)
!889 = !DILocation(line: 124, column: 9, scope: !870)
!890 = !DILocation(line: 124, column: 2, scope: !870)
!891 = distinct !DISubprogram(name: "cpu_irq_restore", linkageName: "_ZL15cpu_irq_restorej", scope: !255, file: !255, line: 132, type: !892, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !254}
!894 = !DILocalVariable(name: "flags", arg: 1, scope: !891, file: !255, line: 132, type: !254)
!895 = !DILocation(line: 132, column: 47, scope: !891)
!896 = !DILocation(line: 134, column: 31, scope: !897)
!897 = distinct !DILexicalBlock(scope: !891, file: !255, line: 134, column: 6)
!898 = !DILocation(line: 134, column: 6, scope: !897)
!899 = !DILocation(line: 134, column: 6, scope: !891)
!900 = !DILocation(line: 135, column: 3, scope: !897)
!901 = !DILocation(line: 135, column: 3, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !255, line: 135, column: 3)
!903 = !DILocation(line: 337, column: 3, scope: !884, inlinedAt: !904)
!904 = distinct !DILocation(line: 135, column: 3, scope: !902)
!905 = !DILocation(line: 310, column: 3, scope: !906, inlinedAt: !907)
!906 = distinct !DISubprogram(name: "__enable_irq", linkageName: "_ZL12__enable_irqv", scope: !879, file: !879, line: 308, type: !552, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!907 = distinct !DILocation(line: 135, column: 3, scope: !902)
!908 = !{i32 388644}
!909 = !DILocation(line: 136, column: 1, scope: !891)
!910 = distinct !DISubprogram(name: "cpu_irq_is_enabled_flags", linkageName: "_ZL24cpu_irq_is_enabled_flagsj", scope: !255, file: !255, line: 127, type: !911, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!911 = !DISubroutineType(types: !912)
!912 = !{!366, !254}
!913 = !DILocalVariable(name: "flags", arg: 1, scope: !910, file: !255, line: 127, type: !254)
!914 = !DILocation(line: 127, column: 55, scope: !910)
!915 = !DILocation(line: 129, column: 10, scope: !910)
!916 = !DILocation(line: 129, column: 2, scope: !910)
!917 = distinct !DISubprogram(name: "Test_Mode_Support", linkageName: "_ZL17Test_Mode_Supporth", scope: !150, file: !150, line: 489, type: !918, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !7}
!920 = !DILocalVariable(name: "wIndex", arg: 1, scope: !917, file: !150, line: 489, type: !7)
!921 = !DILocation(line: 489, column: 40, scope: !917)
!922 = !DILocalVariable(name: "i", scope: !917, file: !150, line: 491, type: !7)
!923 = !DILocation(line: 491, column: 13, scope: !917)
!924 = !DILocalVariable(name: "ptr_dest", scope: !917, file: !150, line: 492, type: !6)
!925 = !DILocation(line: 492, column: 11, scope: !917)
!926 = !DILocation(line: 494, column: 10, scope: !917)
!927 = !DILocation(line: 494, column: 2, scope: !917)
!928 = !DILocation(line: 510, column: 4, scope: !929)
!929 = distinct !DILexicalBlock(scope: !917, file: !150, line: 495, column: 2)
!930 = !DILocation(line: 512, column: 50, scope: !929)
!931 = !DILocation(line: 513, column: 50, scope: !929)
!932 = !DILocation(line: 516, column: 32, scope: !929)
!933 = !DILocation(line: 521, column: 32, scope: !929)
!934 = !DILocation(line: 522, column: 4, scope: !929)
!935 = !DILocation(line: 522, column: 11, scope: !929)
!936 = !DILocation(line: 522, column: 38, scope: !929)
!937 = !DILocation(line: 522, column: 62, scope: !929)
!938 = distinct !{!938, !934, !939}
!939 = !DILocation(line: 522, column: 68, scope: !929)
!940 = !DILocation(line: 523, column: 26, scope: !929)
!941 = !DILocation(line: 525, column: 10, scope: !942)
!942 = distinct !DILexicalBlock(scope: !929, file: !150, line: 525, column: 4)
!943 = !DILocation(line: 525, column: 9, scope: !942)
!944 = !DILocation(line: 525, column: 14, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !150, line: 525, column: 4)
!946 = !DILocation(line: 525, column: 15, scope: !945)
!947 = !DILocation(line: 525, column: 4, scope: !942)
!948 = !DILocation(line: 527, column: 38, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !150, line: 526, column: 4)
!950 = !DILocation(line: 527, column: 19, scope: !949)
!951 = !DILocation(line: 527, column: 5, scope: !949)
!952 = !DILocation(line: 527, column: 14, scope: !949)
!953 = !DILocation(line: 527, column: 17, scope: !949)
!954 = !DILocation(line: 528, column: 4, scope: !949)
!955 = !DILocation(line: 525, column: 45, scope: !945)
!956 = !DILocation(line: 525, column: 4, scope: !945)
!957 = distinct !{!957, !947, !958}
!958 = !DILocation(line: 528, column: 4, scope: !942)
!959 = !DILocation(line: 530, column: 27, scope: !929)
!960 = !DILocation(line: 532, column: 32, scope: !929)
!961 = !DILocation(line: 533, column: 32, scope: !929)
!962 = !DILocation(line: 534, column: 4, scope: !929)
!963 = !DILocation(line: 534, column: 4, scope: !964)
!964 = distinct !DILexicalBlock(scope: !965, file: !150, line: 534, column: 4)
!965 = distinct !DILexicalBlock(scope: !929, file: !150, line: 534, column: 4)
!966 = distinct !{!966, !967, !968}
!967 = !DILocation(line: 534, column: 4, scope: !965)
!968 = !DILocation(line: 534, column: 11, scope: !965)
!969 = !DILocation(line: 543, column: 4, scope: !929)
!970 = !DILocation(line: 544, column: 27, scope: !929)
!971 = !DILocation(line: 545, column: 4, scope: !929)
!972 = !DILocation(line: 545, column: 4, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !150, line: 545, column: 4)
!974 = distinct !DILexicalBlock(scope: !929, file: !150, line: 545, column: 4)
!975 = distinct !{!975, !976, !977}
!976 = !DILocation(line: 545, column: 4, scope: !974)
!977 = !DILocation(line: 545, column: 11, scope: !974)
!978 = !DILocation(line: 554, column: 4, scope: !929)
!979 = !DILocation(line: 555, column: 27, scope: !929)
!980 = !DILocation(line: 556, column: 4, scope: !929)
!981 = !DILocation(line: 556, column: 4, scope: !982)
!982 = distinct !DILexicalBlock(scope: !983, file: !150, line: 556, column: 4)
!983 = distinct !DILexicalBlock(scope: !929, file: !150, line: 556, column: 4)
!984 = distinct !{!984, !985, !986}
!985 = !DILocation(line: 556, column: 4, scope: !983)
!986 = !DILocation(line: 556, column: 11, scope: !983)
!987 = !DILocation(line: 571, column: 4, scope: !929)
!988 = !DILocation(line: 572, column: 26, scope: !929)
!989 = !DILocation(line: 592, column: 4, scope: !929)
!990 = !DILocation(line: 592, column: 4, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !150, line: 592, column: 4)
!992 = distinct !DILexicalBlock(scope: !929, file: !150, line: 592, column: 4)
!993 = distinct !{!993, !994, !995}
!994 = !DILocation(line: 592, column: 4, scope: !992)
!995 = !DILocation(line: 592, column: 11, scope: !992)
!996 = !DILocation(line: 595, column: 1, scope: !917)
!997 = distinct !DISubprogram(name: "USBD_SendDescriptor", linkageName: "_ZL19USBD_SendDescriptorR8USBSetup", scope: !150, file: !150, line: 381, type: !479, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!998 = !DILocalVariable(name: "setup", arg: 1, scope: !997, file: !150, line: 381, type: !481)
!999 = !DILocation(line: 381, column: 43, scope: !997)
!1000 = !DILocalVariable(name: "t", scope: !997, file: !150, line: 383, type: !7)
!1001 = !DILocation(line: 383, column: 10, scope: !997)
!1002 = !DILocation(line: 383, column: 14, scope: !997)
!1003 = !DILocation(line: 383, column: 20, scope: !997)
!1004 = !DILocalVariable(name: "desc_length", scope: !997, file: !150, line: 384, type: !7)
!1005 = !DILocation(line: 384, column: 10, scope: !997)
!1006 = !DILocalVariable(name: "ret", scope: !997, file: !150, line: 385, type: !366)
!1007 = !DILocation(line: 385, column: 6, scope: !997)
!1008 = !DILocalVariable(name: "desc_addr", scope: !997, file: !150, line: 386, type: !12)
!1009 = !DILocation(line: 386, column: 17, scope: !997)
!1010 = !DILocation(line: 388, column: 43, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !997, file: !150, line: 388, column: 6)
!1012 = !DILocation(line: 388, column: 40, scope: !1011)
!1013 = !DILocation(line: 388, column: 6, scope: !997)
!1014 = !DILocation(line: 391, column: 33, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !150, line: 389, column: 2)
!1016 = !DILocation(line: 391, column: 39, scope: !1015)
!1017 = !DILocation(line: 391, column: 10, scope: !1015)
!1018 = !DILocation(line: 391, column: 3, scope: !1015)
!1019 = !DILocation(line: 394, column: 19, scope: !997)
!1020 = !DILocation(line: 394, column: 25, scope: !997)
!1021 = !DILocation(line: 394, column: 2, scope: !997)
!1022 = !DILocation(line: 397, column: 8, scope: !997)
!1023 = !DILocation(line: 397, column: 37, scope: !997)
!1024 = !DILocation(line: 397, column: 23, scope: !997)
!1025 = !DILocation(line: 397, column: 6, scope: !997)
!1026 = !DILocation(line: 398, column: 6, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !997, file: !150, line: 398, column: 6)
!1028 = !DILocation(line: 398, column: 10, scope: !1027)
!1029 = !DILocation(line: 398, column: 6, scope: !997)
!1030 = !DILocation(line: 399, column: 11, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1027, file: !150, line: 398, column: 16)
!1032 = !DILocation(line: 399, column: 15, scope: !1031)
!1033 = !DILocation(line: 399, column: 10, scope: !1031)
!1034 = !DILocation(line: 399, column: 3, scope: !1031)
!1035 = !DILocation(line: 403, column: 36, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !997, file: !150, line: 403, column: 6)
!1037 = !DILocation(line: 403, column: 33, scope: !1036)
!1038 = !DILocation(line: 403, column: 6, scope: !997)
!1039 = !DILocation(line: 406, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !150, line: 406, column: 7)
!1041 = distinct !DILexicalBlock(scope: !1036, file: !150, line: 404, column: 2)
!1042 = !DILocation(line: 406, column: 13, scope: !1040)
!1043 = !DILocation(line: 406, column: 21, scope: !1040)
!1044 = !DILocation(line: 406, column: 7, scope: !1041)
!1045 = !DILocation(line: 408, column: 18, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1040, file: !150, line: 407, column: 3)
!1047 = !DILocation(line: 409, column: 3, scope: !1046)
!1048 = !DILocation(line: 410, column: 15, scope: !1041)
!1049 = !DILocation(line: 410, column: 13, scope: !1041)
!1050 = !DILocation(line: 411, column: 14, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !1041, file: !150, line: 411, column: 13)
!1052 = !DILocation(line: 411, column: 13, scope: !1051)
!1053 = !DILocation(line: 411, column: 26, scope: !1051)
!1054 = !DILocation(line: 411, column: 32, scope: !1051)
!1055 = !DILocation(line: 411, column: 24, scope: !1051)
!1056 = !DILocation(line: 411, column: 13, scope: !1041)
!1057 = !DILocation(line: 412, column: 27, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1051, file: !150, line: 411, column: 42)
!1059 = !DILocation(line: 412, column: 33, scope: !1058)
!1060 = !DILocation(line: 412, column: 25, scope: !1058)
!1061 = !DILocation(line: 413, column: 9, scope: !1058)
!1062 = !DILocation(line: 414, column: 2, scope: !1041)
!1063 = !DILocation(line: 415, column: 41, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1036, file: !150, line: 415, column: 11)
!1065 = !DILocation(line: 415, column: 38, scope: !1064)
!1066 = !DILocation(line: 415, column: 11, scope: !1036)
!1067 = !DILocation(line: 418, column: 7, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !150, line: 418, column: 7)
!1069 = distinct !DILexicalBlock(scope: !1064, file: !150, line: 416, column: 2)
!1070 = !DILocation(line: 418, column: 13, scope: !1068)
!1071 = !DILocation(line: 418, column: 21, scope: !1068)
!1072 = !DILocation(line: 418, column: 7, scope: !1069)
!1073 = !DILocation(line: 419, column: 14, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1068, file: !150, line: 418, column: 27)
!1075 = !DILocation(line: 420, column: 3, scope: !1074)
!1076 = !DILocation(line: 421, column: 12, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1068, file: !150, line: 421, column: 12)
!1078 = !DILocation(line: 421, column: 18, scope: !1077)
!1079 = !DILocation(line: 421, column: 26, scope: !1077)
!1080 = !DILocation(line: 421, column: 12, scope: !1068)
!1081 = !DILocation(line: 422, column: 52, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1077, file: !150, line: 421, column: 39)
!1083 = !DILocation(line: 422, column: 58, scope: !1082)
!1084 = !DILocation(line: 422, column: 11, scope: !1082)
!1085 = !DILocation(line: 422, column: 4, scope: !1082)
!1086 = !DILocation(line: 424, column: 12, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1077, file: !150, line: 424, column: 12)
!1088 = !DILocation(line: 424, column: 18, scope: !1087)
!1089 = !DILocation(line: 424, column: 26, scope: !1087)
!1090 = !DILocation(line: 424, column: 12, scope: !1077)
!1091 = !DILocation(line: 425, column: 57, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1087, file: !150, line: 424, column: 44)
!1093 = !DILocation(line: 425, column: 63, scope: !1092)
!1094 = !DILocation(line: 425, column: 11, scope: !1092)
!1095 = !DILocation(line: 425, column: 4, scope: !1092)
!1096 = !DILocation(line: 427, column: 12, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1087, file: !150, line: 427, column: 12)
!1098 = !DILocation(line: 427, column: 18, scope: !1097)
!1099 = !DILocation(line: 427, column: 26, scope: !1097)
!1100 = !DILocation(line: 427, column: 12, scope: !1087)
!1101 = !DILocalVariable(name: "name", scope: !1102, file: !150, line: 429, type: !1103)
!1102 = distinct !DILexicalBlock(scope: !1097, file: !150, line: 427, column: 38)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 160, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 20)
!1106 = !DILocation(line: 429, column: 9, scope: !1102)
!1107 = !DILocation(line: 430, column: 4, scope: !1102)
!1108 = !DILocation(line: 430, column: 32, scope: !1102)
!1109 = !DILocation(line: 430, column: 19, scope: !1102)
!1110 = !DILocation(line: 431, column: 46, scope: !1102)
!1111 = !DILocation(line: 431, column: 52, scope: !1102)
!1112 = !DILocation(line: 431, column: 58, scope: !1102)
!1113 = !DILocation(line: 431, column: 11, scope: !1102)
!1114 = !DILocation(line: 431, column: 4, scope: !1102)
!1115 = !DILocation(line: 435, column: 4, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1097, file: !150, line: 434, column: 8)
!1117 = !DILocation(line: 437, column: 8, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1069, file: !150, line: 437, column: 7)
!1119 = !DILocation(line: 437, column: 7, scope: !1118)
!1120 = !DILocation(line: 437, column: 20, scope: !1118)
!1121 = !DILocation(line: 437, column: 26, scope: !1118)
!1122 = !DILocation(line: 437, column: 18, scope: !1118)
!1123 = !DILocation(line: 437, column: 7, scope: !1069)
!1124 = !DILocation(line: 438, column: 18, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1118, file: !150, line: 437, column: 36)
!1126 = !DILocation(line: 438, column: 24, scope: !1125)
!1127 = !DILocation(line: 438, column: 16, scope: !1125)
!1128 = !DILocation(line: 439, column: 3, scope: !1125)
!1129 = !DILocation(line: 440, column: 2, scope: !1069)
!1130 = !DILocation(line: 441, column: 35, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1064, file: !150, line: 441, column: 11)
!1132 = !DILocation(line: 441, column: 32, scope: !1131)
!1133 = !DILocation(line: 441, column: 11, scope: !1064)
!1134 = !DILocation(line: 444, column: 13, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !150, line: 442, column: 2)
!1136 = !DILocation(line: 445, column: 14, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1135, file: !150, line: 445, column: 13)
!1138 = !DILocation(line: 445, column: 13, scope: !1137)
!1139 = !DILocation(line: 445, column: 26, scope: !1137)
!1140 = !DILocation(line: 445, column: 32, scope: !1137)
!1141 = !DILocation(line: 445, column: 24, scope: !1137)
!1142 = !DILocation(line: 445, column: 13, scope: !1135)
!1143 = !DILocation(line: 446, column: 27, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1137, file: !150, line: 445, column: 42)
!1145 = !DILocation(line: 446, column: 33, scope: !1144)
!1146 = !DILocation(line: 446, column: 25, scope: !1144)
!1147 = !DILocation(line: 447, column: 9, scope: !1144)
!1148 = !DILocation(line: 448, column: 5, scope: !1135)
!1149 = !DILocation(line: 449, column: 47, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1131, file: !150, line: 449, column: 14)
!1151 = !DILocation(line: 449, column: 44, scope: !1150)
!1152 = !DILocation(line: 449, column: 14, scope: !1131)
!1153 = !DILocation(line: 452, column: 38, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1150, file: !150, line: 450, column: 5)
!1155 = !DILocation(line: 452, column: 44, scope: !1154)
!1156 = !DILocation(line: 452, column: 10, scope: !1154)
!1157 = !DILocation(line: 452, column: 3, scope: !1154)
!1158 = !DILocation(line: 459, column: 6, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !997, file: !150, line: 459, column: 6)
!1160 = !DILocation(line: 459, column: 16, scope: !1159)
!1161 = !DILocation(line: 459, column: 6, scope: !997)
!1162 = !DILocation(line: 461, column: 3, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1159, file: !150, line: 460, column: 2)
!1164 = !DILocation(line: 464, column: 6, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !997, file: !150, line: 464, column: 6)
!1166 = !DILocation(line: 464, column: 18, scope: !1165)
!1167 = !DILocation(line: 464, column: 6, scope: !997)
!1168 = !DILocation(line: 466, column: 18, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !150, line: 465, column: 2)
!1170 = !DILocation(line: 466, column: 17, scope: !1169)
!1171 = !DILocation(line: 466, column: 15, scope: !1169)
!1172 = !DILocation(line: 467, column: 2, scope: !1169)
!1173 = !DILocation(line: 470, column: 22, scope: !997)
!1174 = !DILocation(line: 470, column: 33, scope: !997)
!1175 = !DILocation(line: 470, column: 2, scope: !997)
!1176 = !DILocation(line: 472, column: 2, scope: !997)
!1177 = !DILocation(line: 473, column: 1, scope: !997)
!1178 = distinct !DISubprogram(name: "USB_SendZlp", linkageName: "_ZL11USB_SendZlpv", scope: !150, file: !150, line: 476, type: !552, scopeLine: 477, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1179 = !DILocation(line: 478, column: 5, scope: !1178)
!1180 = !DILocation(line: 478, column: 39, scope: !1178)
!1181 = !DILocation(line: 478, column: 67, scope: !1178)
!1182 = !DILocation(line: 478, column: 35, scope: !1178)
!1183 = !DILocation(line: 480, column: 21, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !150, line: 480, column: 12)
!1185 = distinct !DILexicalBlock(scope: !1178, file: !150, line: 479, column: 5)
!1186 = !DILocation(line: 480, column: 35, scope: !1184)
!1187 = !DILocation(line: 480, column: 57, scope: !1184)
!1188 = !DILocation(line: 480, column: 12, scope: !1185)
!1189 = !DILocation(line: 482, column: 13, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1184, file: !150, line: 481, column: 9)
!1191 = distinct !{!1191, !1179, !1192}
!1192 = !DILocation(line: 484, column: 5, scope: !1178)
!1193 = !DILocation(line: 485, column: 33, scope: !1178)
!1194 = !DILocation(line: 486, column: 1, scope: !1178)
!1195 = distinct !DISubprogram(name: "USBD_SendConfiguration", linkageName: "_ZL22USBD_SendConfigurationi", scope: !150, file: !150, line: 335, type: !1196, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!211, !366}
!1198 = !DILocalVariable(name: "maxlen", arg: 1, scope: !1195, file: !150, line: 335, type: !366)
!1199 = !DILocation(line: 335, column: 40, scope: !1195)
!1200 = !DILocation(line: 338, column: 2, scope: !1195)
!1201 = !DILocalVariable(name: "interfaces", scope: !1195, file: !150, line: 340, type: !7)
!1202 = !DILocation(line: 340, column: 10, scope: !1195)
!1203 = !DILocation(line: 340, column: 23, scope: !1195)
!1204 = !DILocalVariable(name: "config", scope: !1195, file: !150, line: 345, type: !1205)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigDescriptor", file: !168, line: 151, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 142, size: 72, flags: DIFlagTypePassByValue, elements: !1207, identifier: "_ZTS16ConfigDescriptor")
!1207 = !{!1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1206, file: !168, line: 143, baseType: !7, size: 8)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dtype", scope: !1206, file: !168, line: 144, baseType: !7, size: 8, offset: 8)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "clen", scope: !1206, file: !168, line: 145, baseType: !141, size: 16, offset: 16)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "numInterfaces", scope: !1206, file: !168, line: 146, baseType: !7, size: 8, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1206, file: !168, line: 147, baseType: !7, size: 8, offset: 40)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "iconfig", scope: !1206, file: !168, line: 148, baseType: !7, size: 8, offset: 48)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1206, file: !168, line: 149, baseType: !7, size: 8, offset: 56)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "maxPower", scope: !1206, file: !168, line: 150, baseType: !7, size: 8, offset: 64)
!1216 = !DILocation(line: 345, column: 19, scope: !1195)
!1217 = !DILocation(line: 345, column: 28, scope: !1195)
!1218 = !DILocation(line: 352, column: 19, scope: !1195)
!1219 = !DILocation(line: 352, column: 2, scope: !1195)
!1220 = !DILocation(line: 353, column: 21, scope: !1195)
!1221 = !DILocation(line: 353, column: 2, scope: !1195)
!1222 = !DILocation(line: 354, column: 2, scope: !1195)
!1223 = !DILocation(line: 355, column: 2, scope: !1195)
!1224 = distinct !DISubprogram(name: "USB_SendStringDescriptor", linkageName: "_ZL24USB_SendStringDescriptorPKhi", scope: !150, file: !150, line: 249, type: !1225, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!211, !12, !366}
!1227 = !DILocalVariable(name: "string", arg: 1, scope: !1224, file: !150, line: 249, type: !12)
!1228 = !DILocation(line: 249, column: 53, scope: !1224)
!1229 = !DILocalVariable(name: "wLength", arg: 2, scope: !1224, file: !150, line: 249, type: !366)
!1230 = !DILocation(line: 249, column: 65, scope: !1224)
!1231 = !DILocation(line: 250, column: 6, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1224, file: !150, line: 250, column: 6)
!1233 = !DILocation(line: 250, column: 14, scope: !1232)
!1234 = !DILocation(line: 250, column: 6, scope: !1224)
!1235 = !DILocation(line: 251, column: 3, scope: !1232)
!1236 = !DILocation(line: 253, column: 17, scope: !1224)
!1237 = !DILocation(line: 253, column: 2, scope: !1224)
!1238 = !DILocalVariable(name: "__vla_expr0", scope: !1224, type: !25, flags: DIFlagArtificial)
!1239 = !DILocation(line: 0, scope: !1224)
!1240 = !DILocalVariable(name: "buffer", scope: !1224, file: !150, line: 253, type: !1241)
!1241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, elements: !1242)
!1242 = !{!1243}
!1243 = !DISubrange(count: !1238)
!1244 = !DILocation(line: 253, column: 10, scope: !1224)
!1245 = !DILocation(line: 254, column: 34, scope: !1224)
!1246 = !DILocation(line: 254, column: 14, scope: !1224)
!1247 = !DILocation(line: 254, column: 42, scope: !1224)
!1248 = !DILocation(line: 254, column: 46, scope: !1224)
!1249 = !DILocation(line: 254, column: 2, scope: !1224)
!1250 = !DILocation(line: 254, column: 12, scope: !1224)
!1251 = !DILocation(line: 255, column: 2, scope: !1224)
!1252 = !DILocation(line: 255, column: 12, scope: !1224)
!1253 = !DILocalVariable(name: "i", scope: !1224, file: !150, line: 257, type: !7)
!1254 = !DILocation(line: 257, column: 10, scope: !1224)
!1255 = !DILocation(line: 258, column: 9, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !1224, file: !150, line: 258, column: 2)
!1257 = !DILocation(line: 258, column: 7, scope: !1256)
!1258 = !DILocation(line: 258, column: 14, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1256, file: !150, line: 258, column: 2)
!1260 = !DILocation(line: 258, column: 18, scope: !1259)
!1261 = !DILocation(line: 258, column: 16, scope: !1259)
!1262 = !DILocation(line: 258, column: 26, scope: !1259)
!1263 = !DILocation(line: 258, column: 30, scope: !1259)
!1264 = !DILocation(line: 258, column: 29, scope: !1259)
!1265 = !DILocation(line: 0, scope: !1259)
!1266 = !DILocation(line: 258, column: 2, scope: !1256)
!1267 = !DILocation(line: 259, column: 24, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1259, file: !150, line: 258, column: 43)
!1269 = !DILocation(line: 259, column: 17, scope: !1268)
!1270 = !DILocation(line: 259, column: 11, scope: !1268)
!1271 = !DILocation(line: 259, column: 3, scope: !1268)
!1272 = !DILocation(line: 259, column: 15, scope: !1268)
!1273 = !DILocation(line: 260, column: 7, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1268, file: !150, line: 260, column: 7)
!1275 = !DILocation(line: 260, column: 12, scope: !1274)
!1276 = !DILocation(line: 260, column: 9, scope: !1274)
