; ModuleID = '/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/variants/arduino_due_x/variant.cpp'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/variants/arduino_due_x/variant.cpp"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%struct._PinDescription = type { %struct.Pio*, i32, i32, i8, i32, i32, i8, i8, i8, i8 }
%struct.Pio = type { i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, [3 x i32], i32, i32, i32, i32, [4 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32 }
%class.RingBuffer = type { [128 x i8], i32, i32 }
%class.UARTClass = type { %class.HardwareSerial, %class.RingBuffer*, %class.RingBuffer*, %struct.Uart*, i8, i32 }
%class.HardwareSerial = type { %class.Stream }
%class.Stream = type { %class.Print, i32, i32 }
%class.Print = type { i32 (...)**, i32 }
%struct.Uart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [55 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%class.USARTClass = type { %class.UARTClass, %struct.Usart* }
%struct.Usart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, [1 x i32], i32, i32, i32, i32, [34 x i32], i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!86 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!87 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!88 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!89 = !DIEnumerator(name: "UART_IRQn", value: 8)
!90 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!91 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!92 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!93 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!94 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!95 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!96 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!97 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!98 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!99 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!100 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!101 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!102 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!103 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!104 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!105 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!106 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!107 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!108 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!109 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!110 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!111 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!112 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!113 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!114 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!115 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!116 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!117 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!118 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!119 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!120 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!121 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!122 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "adc_settling_time_t", file: !124, line: 132, baseType: !125, size: 32, elements: !126, identifier: "_ZTS19adc_settling_time_t")
!124 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/libsam/include/adc.h", directory: "/home/aaa")
!125 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "ADC_SETTLING_TIME_0", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "ADC_SETTLING_TIME_1", value: 1048576, isUnsigned: true)
!129 = !DIEnumerator(name: "ADC_SETTLING_TIME_2", value: 2097152, isUnsigned: true)
!130 = !DIEnumerator(name: "ADC_SETTLING_TIME_3", value: 3145728, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "adc_trigger_t", file: !124, line: 72, baseType: !7, size: 8, elements: !132, identifier: "_ZTS13adc_trigger_t")
!132 = !{!133, !134, !135, !136, !137, !138, !139}
!133 = !DIEnumerator(name: "ADC_TRIG_SW", value: 0, isUnsigned: true)
!134 = !DIEnumerator(name: "ADC_TRIG_EXT", value: 1, isUnsigned: true)
!135 = !DIEnumerator(name: "ADC_TRIG_TIO_CH_0", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "ADC_TRIG_TIO_CH_1", value: 5, isUnsigned: true)
!137 = !DIEnumerator(name: "ADC_TRIG_TIO_CH_2", value: 7, isUnsigned: true)
!138 = !DIEnumerator(name: "ADC_TRIG_PWM_EVENT_LINE_0", value: 9, isUnsigned: true)
!139 = !DIEnumerator(name: "ADC_TRIG_PWM_EVENT_LINE_1", value: 11, isUnsigned: true)
!140 = !{!141, !145, !149, !225, !229, !238, !157, !277}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !143, line: 62, baseType: !144)
!143 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_uart.h", directory: "/home/aaa")
!144 = !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 41, flags: DIFlagFwdDecl, identifier: "_ZTS4Uart")
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "Usart", file: !147, line: 75, baseType: !148)
!147 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_usart.h", directory: "/home/aaa")
!148 = !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 41, flags: DIFlagFwdDecl, identifier: "_ZTS5Usart")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !151, line: 96, baseType: !152)
!151 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_pio.h", directory: "/home/aaa")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 41, size: 1888, flags: DIFlagTypePassByValue, elements: !153, identifier: "_ZTS3Pio")
!153 = !{!154, !161, !162, !164, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !198, !199, !200, !201, !202, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PER", scope: !152, file: !151, line: 42, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !71, line: 53, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !158, line: 66, baseType: !159)
!158 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !160, line: 56, baseType: !125)
!160 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDR", scope: !152, file: !151, line: 43, baseType: !155, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PSR", scope: !152, file: !151, line: 44, baseType: !163, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !71, line: 51, baseType: !156)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !152, file: !151, line: 45, baseType: !165, size: 32, offset: 96)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 32, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OER", scope: !152, file: !151, line: 46, baseType: !155, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODR", scope: !152, file: !151, line: 47, baseType: !155, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OSR", scope: !152, file: !151, line: 48, baseType: !163, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !152, file: !151, line: 49, baseType: !165, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFER", scope: !152, file: !151, line: 50, baseType: !155, size: 32, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDR", scope: !152, file: !151, line: 51, baseType: !155, size: 32, offset: 288)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFSR", scope: !152, file: !151, line: 52, baseType: !163, size: 32, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !152, file: !151, line: 53, baseType: !165, size: 32, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SODR", scope: !152, file: !151, line: 54, baseType: !155, size: 32, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_CODR", scope: !152, file: !151, line: 55, baseType: !155, size: 32, offset: 416)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODSR", scope: !152, file: !151, line: 56, baseType: !179, size: 32, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !71, line: 54, baseType: !156)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDSR", scope: !152, file: !151, line: 57, baseType: !163, size: 32, offset: 480)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IER", scope: !152, file: !151, line: 58, baseType: !155, size: 32, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IDR", scope: !152, file: !151, line: 59, baseType: !155, size: 32, offset: 544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IMR", scope: !152, file: !151, line: 60, baseType: !163, size: 32, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ISR", scope: !152, file: !151, line: 61, baseType: !163, size: 32, offset: 608)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDER", scope: !152, file: !151, line: 62, baseType: !155, size: 32, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDDR", scope: !152, file: !151, line: 63, baseType: !155, size: 32, offset: 672)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDSR", scope: !152, file: !151, line: 64, baseType: !163, size: 32, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !152, file: !151, line: 65, baseType: !165, size: 32, offset: 736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUDR", scope: !152, file: !151, line: 66, baseType: !155, size: 32, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUER", scope: !152, file: !151, line: 67, baseType: !155, size: 32, offset: 800)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUSR", scope: !152, file: !151, line: 68, baseType: !163, size: 32, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !152, file: !151, line: 69, baseType: !165, size: 32, offset: 864)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ABSR", scope: !152, file: !151, line: 70, baseType: !179, size: 32, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !152, file: !151, line: 71, baseType: !195, size: 96, offset: 928)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 96, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 3)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCIFSR", scope: !152, file: !151, line: 72, baseType: !155, size: 32, offset: 1024)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_DIFSR", scope: !152, file: !151, line: 73, baseType: !155, size: 32, offset: 1056)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDGSR", scope: !152, file: !151, line: 74, baseType: !163, size: 32, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCDR", scope: !152, file: !151, line: 75, baseType: !179, size: 32, offset: 1120)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !152, file: !151, line: 76, baseType: !203, size: 128, offset: 1152)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 4)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWER", scope: !152, file: !151, line: 77, baseType: !155, size: 32, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWDR", scope: !152, file: !151, line: 78, baseType: !155, size: 32, offset: 1312)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWSR", scope: !152, file: !151, line: 79, baseType: !163, size: 32, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !152, file: !151, line: 80, baseType: !165, size: 32, offset: 1376)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMER", scope: !152, file: !151, line: 81, baseType: !155, size: 32, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMDR", scope: !152, file: !151, line: 82, baseType: !155, size: 32, offset: 1440)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_AIMMR", scope: !152, file: !151, line: 83, baseType: !163, size: 32, offset: 1472)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved9", scope: !152, file: !151, line: 84, baseType: !165, size: 32, offset: 1504)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ESR", scope: !152, file: !151, line: 85, baseType: !155, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_LSR", scope: !152, file: !151, line: 86, baseType: !155, size: 32, offset: 1568)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ELSR", scope: !152, file: !151, line: 87, baseType: !163, size: 32, offset: 1600)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved10", scope: !152, file: !151, line: 88, baseType: !165, size: 32, offset: 1632)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_FELLSR", scope: !152, file: !151, line: 89, baseType: !155, size: 32, offset: 1664)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_REHLSR", scope: !152, file: !151, line: 90, baseType: !155, size: 32, offset: 1696)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_FRLHSR", scope: !152, file: !151, line: 91, baseType: !163, size: 32, offset: 1728)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved11", scope: !152, file: !151, line: 92, baseType: !165, size: 32, offset: 1760)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_LOCKSR", scope: !152, file: !151, line: 93, baseType: !163, size: 32, offset: 1792)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_WPMR", scope: !152, file: !151, line: 94, baseType: !179, size: 32, offset: 1824)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_WPSR", scope: !152, file: !151, line: 95, baseType: !163, size: 32, offset: 1856)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Adc", file: !227, line: 76, baseType: !228)
!227 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_adc.h", directory: "/home/aaa")
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 41, flags: DIFlagFwdDecl, identifier: "_ZTS3Adc")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !231, line: 574, baseType: !232)
!231 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/CMSIS/Include/core_cm3.h", directory: "/home/aaa")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 568, size: 128, flags: DIFlagTypePassByValue, elements: !233, identifier: "_ZTS12SysTick_Type")
!233 = !{!234, !235, !236, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !232, file: !231, line: 570, baseType: !156, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !232, file: !231, line: 571, baseType: !156, size: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !232, file: !231, line: 572, baseType: !156, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !232, file: !231, line: 573, baseType: !156, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !231, line: 329, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 306, size: 1120, flags: DIFlagTypePassByValue, elements: !241, identifier: "_ZTS8SCB_Type")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !255, !256, !257, !258, !259, !260, !261, !262, !266, !267, !268, !270, !274, !276}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !240, file: !231, line: 308, baseType: !156, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !240, file: !231, line: 309, baseType: !156, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !240, file: !231, line: 310, baseType: !156, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !240, file: !231, line: 311, baseType: !156, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !240, file: !231, line: 312, baseType: !156, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !240, file: !231, line: 313, baseType: !156, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !240, file: !231, line: 314, baseType: !249, size: 96, offset: 192)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !253)
!250 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !158, line: 42, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !160, line: 28, baseType: !7)
!253 = !{!254}
!254 = !DISubrange(count: 12)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !240, file: !231, line: 315, baseType: !156, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !240, file: !231, line: 316, baseType: !156, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !240, file: !231, line: 317, baseType: !156, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !240, file: !231, line: 318, baseType: !156, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !240, file: !231, line: 319, baseType: !156, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !240, file: !231, line: 320, baseType: !156, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !240, file: !231, line: 321, baseType: !156, size: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !240, file: !231, line: 322, baseType: !263, size: 64, offset: 512)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !240, file: !231, line: 323, baseType: !156, size: 32, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !240, file: !231, line: 324, baseType: !156, size: 32, offset: 608)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !240, file: !231, line: 325, baseType: !269, size: 128, offset: 640)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !204)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !240, file: !231, line: 326, baseType: !271, size: 160, offset: 768)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 160, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 5)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !240, file: !231, line: 327, baseType: !275, size: 160, offset: 928)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 160, elements: !272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !240, file: !231, line: 328, baseType: !156, size: 32, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !231, line: 289, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !231, line: 274, size: 28704, flags: DIFlagTypePassByValue, elements: !280, identifier: "_ZTS9NVIC_Type")
!280 = !{!281, !285, !289, !290, !291, !292, !293, !294, !295, !296, !300, !304, !308}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !279, file: !231, line: 276, baseType: !282, size: 256)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !279, file: !231, line: 277, baseType: !286, size: 768, offset: 256)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 768, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 24)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !279, file: !231, line: 278, baseType: !282, size: 256, offset: 1024)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !279, file: !231, line: 279, baseType: !286, size: 768, offset: 1280)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !279, file: !231, line: 280, baseType: !282, size: 256, offset: 2048)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !279, file: !231, line: 281, baseType: !286, size: 768, offset: 2304)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !279, file: !231, line: 282, baseType: !282, size: 256, offset: 3072)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !279, file: !231, line: 283, baseType: !286, size: 768, offset: 3328)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !279, file: !231, line: 284, baseType: !282, size: 256, offset: 4096)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !279, file: !231, line: 285, baseType: !297, size: 1792, offset: 4352)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1792, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 56)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !279, file: !231, line: 286, baseType: !301, size: 1920, offset: 6144)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 1920, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 240)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !279, file: !231, line: 287, baseType: !305, size: 20608, offset: 8064)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 20608, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 644)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !279, file: !231, line: 288, baseType: !156, size: 32, offset: 28672)
!309 = !{!0, !310, !316, !336, !338, !342, !344, !346, !348, !350, !352, !354, !358, !360}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "g_pinStatus", scope: !2, file: !312, line: 295, type: !313, isLocal: false, isDefinition: true)
!312 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/variants/arduino_due_x/variant.cpp", directory: "/home/aaa")
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 632, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 79)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "rx_buffer1", scope: !2, file: !312, line: 304, type: !318, isLocal: false, isDefinition: true)
!318 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RingBuffer", file: !319, line: 30, size: 1088, flags: DIFlagTypePassByValue | DIFlagNonTrivial, elements: !320, identifier: "_ZTS10RingBuffer")
!319 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/RingBuffer.h", directory: "/home/aaa")
!320 = !{!321, !325, !328, !329, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_aucBuffer", scope: !318, file: !319, line: 33, baseType: !322, size: 1024, flags: DIFlagPublic)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 1024, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_iHead", scope: !318, file: !319, line: 34, baseType: !326, size: 32, offset: 1024, flags: DIFlagPublic)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_iTail", scope: !318, file: !319, line: 35, baseType: !326, size: 32, offset: 1056, flags: DIFlagPublic)
!329 = !DISubprogram(name: "RingBuffer", scope: !318, file: !319, line: 38, type: !330, scopeLine: 38, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!333 = !DISubprogram(name: "store_char", linkageName: "_ZN10RingBuffer10store_charEh", scope: !318, file: !319, line: 39, type: !334, scopeLine: 39, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !332, !251}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "tx_buffer1", scope: !2, file: !312, line: 305, type: !318, isLocal: false, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "Serial", scope: !2, file: !312, line: 307, type: !340, isLocal: false, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_class_type, name: "UARTClass", file: !341, line: 35, flags: DIFlagFwdDecl)
!341 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/UARTClass.h", directory: "/home/aaa")
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "rx_buffer2", scope: !2, file: !312, line: 321, type: !318, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "rx_buffer3", scope: !2, file: !312, line: 322, type: !318, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "rx_buffer4", scope: !2, file: !312, line: 323, type: !318, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "tx_buffer2", scope: !2, file: !312, line: 324, type: !318, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "tx_buffer3", scope: !2, file: !312, line: 325, type: !318, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "tx_buffer4", scope: !2, file: !312, line: 326, type: !318, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "Serial1", scope: !2, file: !312, line: 328, type: !356, isLocal: false, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_class_type, name: "USARTClass", file: !357, line: 66, flags: DIFlagFwdDecl, identifier: "_ZTS10USARTClass")
!357 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/USARTClass.h", directory: "/home/aaa")
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "Serial2", scope: !2, file: !312, line: 331, type: !356, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "Serial3", scope: !2, file: !312, line: 334, type: !356, isLocal: false, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 20832, elements: !381)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PinDescription", file: !16, line: 181, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PinDescription", file: !16, line: 169, size: 224, flags: DIFlagTypePassByValue, elements: !366, identifier: "_ZTS15_PinDescription")
!366 = !{!367, !368, !369, !370, !372, !373, !374, !376, !377, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "pPort", scope: !365, file: !16, line: 171, baseType: !149, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ulPin", scope: !365, file: !16, line: 172, baseType: !157, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ulPeripheralId", scope: !365, file: !16, line: 173, baseType: !157, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ulPinType", scope: !365, file: !16, line: 174, baseType: !371, size: 8, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "EPioType", file: !6, line: 56, baseType: !5)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ulPinConfiguration", scope: !365, file: !16, line: 175, baseType: !157, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ulPinAttribute", scope: !365, file: !16, line: 176, baseType: !157, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ulAnalogChannel", scope: !365, file: !16, line: 177, baseType: !375, size: 8, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "EAnalogChannel", file: !16, line: 107, baseType: !15)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ulADCChannelNumber", scope: !365, file: !16, line: 178, baseType: !375, size: 8, offset: 200)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ulPWMChannel", scope: !365, file: !16, line: 179, baseType: !378, size: 8, offset: 208)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "EPWMChannel", file: !16, line: 123, baseType: !38)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ulTCChannel", scope: !365, file: !16, line: 180, baseType: !380, size: 8, offset: 216)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "ETCChannel", file: !16, line: 147, baseType: !49)
!381 = !{!382}
!382 = !DISubrange(count: 93)
!383 = !{i32 7, !"Dwarf Version", i32 4}
!384 = !{i32 2, !"Debug Info Version", i32 3}
!385 = !{i32 1, !"wchar_size", i32 4}
!386 = !{i32 1, !"min_enum_size", i32 1}
!387 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!388 = distinct !DISubprogram(name: "__cxx_global_var_init", scope: !312, file: !312, line: 304, type: !389, scopeLine: 304, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{null}
!391 = !{}
!392 = !DILocation(line: 304, column: 12, scope: !388)
!393 = distinct !DISubprogram(name: "__cxx_global_var_init.1", scope: !312, file: !312, line: 305, type: !389, scopeLine: 305, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!394 = !DILocation(line: 305, column: 12, scope: !393)
!395 = distinct !DISubprogram(name: "__cxx_global_var_init.2", scope: !312, file: !312, line: 307, type: !389, scopeLine: 307, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!396 = !DILocation(line: 307, column: 11, scope: !395)
!397 = !DILocation(line: 307, column: 58, scope: !395)
!398 = distinct !DISubprogram(name: "serialEvent", linkageName: "_Z11serialEventv", scope: !312, file: !312, line: 309, type: !389, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !391)
!399 = !DILocation(line: 309, column: 22, scope: !398)
!400 = distinct !DISubprogram(name: "UART_Handler", scope: !312, file: !312, line: 312, type: !389, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !391)
!401 = !DILocation(line: 314, column: 10, scope: !400)
!402 = !DILocation(line: 315, column: 1, scope: !400)
!403 = distinct !DISubprogram(name: "__cxx_global_var_init.3", scope: !312, file: !312, line: 321, type: !389, scopeLine: 321, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!404 = !DILocation(line: 321, column: 12, scope: !403)
!405 = distinct !DISubprogram(name: "__cxx_global_var_init.4", scope: !312, file: !312, line: 322, type: !389, scopeLine: 322, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!406 = !DILocation(line: 322, column: 12, scope: !405)
!407 = distinct !DISubprogram(name: "__cxx_global_var_init.5", scope: !312, file: !312, line: 323, type: !389, scopeLine: 323, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!408 = !DILocation(line: 323, column: 12, scope: !407)
!409 = distinct !DISubprogram(name: "__cxx_global_var_init.6", scope: !312, file: !312, line: 324, type: !389, scopeLine: 324, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!410 = !DILocation(line: 324, column: 12, scope: !409)
!411 = distinct !DISubprogram(name: "__cxx_global_var_init.7", scope: !312, file: !312, line: 325, type: !389, scopeLine: 325, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!412 = !DILocation(line: 325, column: 12, scope: !411)
!413 = distinct !DISubprogram(name: "__cxx_global_var_init.8", scope: !312, file: !312, line: 326, type: !389, scopeLine: 326, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!414 = !DILocation(line: 326, column: 12, scope: !413)
!415 = distinct !DISubprogram(name: "__cxx_global_var_init.9", scope: !312, file: !312, line: 328, type: !389, scopeLine: 328, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !391)
!416 = !DILocation(line: 328, column: 12, scope: !415)
!417 = !DILocation(line: 328, column: 66, scope: !415)
