; ModuleID = '/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_analog.c'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_analog.c"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%struct._PinDescription = type { %struct.Pio*, i32, i32, i8, i32, i32, i8, i8, i8, i8 }
%struct.Pio = type { i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, [3 x i32], i32, i32, i32, i32, [4 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32 }
%struct.Tc = type { [3 x %struct.TcChannel], i32, i32, i32, i32, i32, i32, i32, [2 x i32], i32 }
%struct.TcChannel = type { i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32] }
%struct.Adc = type { i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, [16 x i32], [1 x i32], i32, [19 x i32], i32, i32, [5 x i32], i32, i32, [2 x i32], i32, i32, [2 x i32], i32, i32 }
%struct.Dacc = type { i32, i32, [2 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, [24 x i32], i32, [19 x i32], i32, i32, [7 x i32], i32, i32, [2 x i32], i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_readResolution", scope: !2, file: !244, line: 25, type: !313, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !54, globals: !241, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_analog.c", directory: "/home/aaa/llvm-arduino-due")
!4 = !{!5, !10, !33}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_eAnalogReference", file: !6, line: 29, baseType: !7, size: 8, elements: !8)
!6 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_analog.h", directory: "/home/aaa")
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !{!9}
!9 = !DIEnumerator(name: "AR_DEFAULT", value: 0, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EAnalogChannel", file: !11, line: 86, baseType: !12, size: 8, elements: !13)
!11 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/Arduino.h", directory: "/home/aaa")
!12 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!14 = !DIEnumerator(name: "NO_ADC", value: -1)
!15 = !DIEnumerator(name: "ADC0", value: 0)
!16 = !DIEnumerator(name: "ADC1", value: 1)
!17 = !DIEnumerator(name: "ADC2", value: 2)
!18 = !DIEnumerator(name: "ADC3", value: 3)
!19 = !DIEnumerator(name: "ADC4", value: 4)
!20 = !DIEnumerator(name: "ADC5", value: 5)
!21 = !DIEnumerator(name: "ADC6", value: 6)
!22 = !DIEnumerator(name: "ADC7", value: 7)
!23 = !DIEnumerator(name: "ADC8", value: 8)
!24 = !DIEnumerator(name: "ADC9", value: 9)
!25 = !DIEnumerator(name: "ADC10", value: 10)
!26 = !DIEnumerator(name: "ADC11", value: 11)
!27 = !DIEnumerator(name: "ADC12", value: 12)
!28 = !DIEnumerator(name: "ADC13", value: 13)
!29 = !DIEnumerator(name: "ADC14", value: 14)
!30 = !DIEnumerator(name: "ADC15", value: 15)
!31 = !DIEnumerator(name: "DA0", value: 16)
!32 = !DIEnumerator(name: "DA1", value: 17)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ETCChannel", file: !11, line: 126, baseType: !12, size: 8, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!35 = !DIEnumerator(name: "NOT_ON_TIMER", value: -1)
!36 = !DIEnumerator(name: "TC0_CHA0", value: 0)
!37 = !DIEnumerator(name: "TC0_CHB0", value: 1)
!38 = !DIEnumerator(name: "TC0_CHA1", value: 2)
!39 = !DIEnumerator(name: "TC0_CHB1", value: 3)
!40 = !DIEnumerator(name: "TC0_CHA2", value: 4)
!41 = !DIEnumerator(name: "TC0_CHB2", value: 5)
!42 = !DIEnumerator(name: "TC1_CHA3", value: 6)
!43 = !DIEnumerator(name: "TC1_CHB3", value: 7)
!44 = !DIEnumerator(name: "TC1_CHA4", value: 8)
!45 = !DIEnumerator(name: "TC1_CHB4", value: 9)
!46 = !DIEnumerator(name: "TC1_CHA5", value: 10)
!47 = !DIEnumerator(name: "TC1_CHB5", value: 11)
!48 = !DIEnumerator(name: "TC2_CHA6", value: 12)
!49 = !DIEnumerator(name: "TC2_CHB6", value: 13)
!50 = !DIEnumerator(name: "TC2_CHA7", value: 14)
!51 = !DIEnumerator(name: "TC2_CHB7", value: 15)
!52 = !DIEnumerator(name: "TC2_CHA8", value: 16)
!53 = !DIEnumerator(name: "TC2_CHB8", value: 17)
!54 = !{!55, !64, !120, !156}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Adc", file: !57, line: 76, baseType: !58)
!57 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_adc.h", directory: "/home/aaa")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 41, size: 2368, elements: !59)
!59 = !{!60, !69, !71, !72, !73, !74, !75, !78, !82, !83, !84, !85, !86, !87, !91, !92, !93, !94, !95, !96, !100, !101, !102, !106, !107, !108, !112, !113, !114, !115, !116, !117, !118, !119}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CR", scope: !58, file: !57, line: 42, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !62, line: 53, baseType: !63)
!62 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/sam3x8e.h", directory: "/home/aaa")
!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !65, line: 66, baseType: !66)
!65 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !67, line: 56, baseType: !68)
!67 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_MR", scope: !58, file: !57, line: 43, baseType: !70, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !62, line: 54, baseType: !63)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_SEQR1", scope: !58, file: !57, line: 44, baseType: !70, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_SEQR2", scope: !58, file: !57, line: 45, baseType: !70, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHER", scope: !58, file: !57, line: 46, baseType: !61, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHDR", scope: !58, file: !57, line: 47, baseType: !61, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHSR", scope: !58, file: !57, line: 48, baseType: !76, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !62, line: 49, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !58, file: !57, line: 49, baseType: !79, size: 32, offset: 224)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_LCDR", scope: !58, file: !57, line: 50, baseType: !76, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IER", scope: !58, file: !57, line: 51, baseType: !61, size: 32, offset: 288)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IDR", scope: !58, file: !57, line: 52, baseType: !61, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IMR", scope: !58, file: !57, line: 53, baseType: !76, size: 32, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_ISR", scope: !58, file: !57, line: 54, baseType: !76, size: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !58, file: !57, line: 55, baseType: !88, size: 64, offset: 416)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 2)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_OVER", scope: !58, file: !57, line: 56, baseType: !76, size: 32, offset: 480)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_EMR", scope: !58, file: !57, line: 57, baseType: !70, size: 32, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CWR", scope: !58, file: !57, line: 58, baseType: !70, size: 32, offset: 544)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CGR", scope: !58, file: !57, line: 59, baseType: !70, size: 32, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_COR", scope: !58, file: !57, line: 60, baseType: !70, size: 32, offset: 608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CDR", scope: !58, file: !57, line: 61, baseType: !97, size: 512, offset: 640)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !58, file: !57, line: 62, baseType: !79, size: 32, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_ACR", scope: !58, file: !57, line: 63, baseType: !70, size: 32, offset: 1184)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !58, file: !57, line: 64, baseType: !103, size: 608, offset: 1216)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 608, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 19)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_WPMR", scope: !58, file: !57, line: 65, baseType: !70, size: 32, offset: 1824)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_WPSR", scope: !58, file: !57, line: 66, baseType: !76, size: 32, offset: 1856)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !58, file: !57, line: 67, baseType: !109, size: 160, offset: 1888)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 5)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RPR", scope: !58, file: !57, line: 68, baseType: !70, size: 32, offset: 2048)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RCR", scope: !58, file: !57, line: 69, baseType: !70, size: 32, offset: 2080)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !58, file: !57, line: 70, baseType: !88, size: 64, offset: 2112)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RNPR", scope: !58, file: !57, line: 71, baseType: !70, size: 32, offset: 2176)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RNCR", scope: !58, file: !57, line: 72, baseType: !70, size: 32, offset: 2208)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !58, file: !57, line: 73, baseType: !88, size: 64, offset: 2240)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_PTCR", scope: !58, file: !57, line: 74, baseType: !61, size: 32, offset: 2304)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_PTSR", scope: !58, file: !57, line: 75, baseType: !76, size: 32, offset: 2336)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Dacc", file: !122, line: 67, baseType: !123)
!122 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_dacc.h", directory: "/home/aaa")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 41, size: 2368, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !141, !142, !143, !144, !145, !149, !150, !151, !152, !153, !154, !155}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_CR", scope: !123, file: !122, line: 42, baseType: !61, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_MR", scope: !123, file: !122, line: 43, baseType: !70, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !123, file: !122, line: 44, baseType: !88, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_CHER", scope: !123, file: !122, line: 45, baseType: !61, size: 32, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_CHDR", scope: !123, file: !122, line: 46, baseType: !61, size: 32, offset: 160)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_CHSR", scope: !123, file: !122, line: 47, baseType: !76, size: 32, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !123, file: !122, line: 48, baseType: !79, size: 32, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_CDR", scope: !123, file: !122, line: 49, baseType: !61, size: 32, offset: 256)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_IER", scope: !123, file: !122, line: 50, baseType: !61, size: 32, offset: 288)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_IDR", scope: !123, file: !122, line: 51, baseType: !61, size: 32, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_IMR", scope: !123, file: !122, line: 52, baseType: !76, size: 32, offset: 352)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_ISR", scope: !123, file: !122, line: 53, baseType: !76, size: 32, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !123, file: !122, line: 54, baseType: !138, size: 768, offset: 416)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 768, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 24)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_ACR", scope: !123, file: !122, line: 55, baseType: !70, size: 32, offset: 1184)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !123, file: !122, line: 56, baseType: !103, size: 608, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_WPMR", scope: !123, file: !122, line: 57, baseType: !70, size: 32, offset: 1824)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_WPSR", scope: !123, file: !122, line: 58, baseType: !76, size: 32, offset: 1856)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !123, file: !122, line: 59, baseType: !146, size: 224, offset: 1888)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 224, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 7)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_TPR", scope: !123, file: !122, line: 60, baseType: !70, size: 32, offset: 2112)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_TCR", scope: !123, file: !122, line: 61, baseType: !70, size: 32, offset: 2144)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !123, file: !122, line: 62, baseType: !88, size: 64, offset: 2176)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_TNPR", scope: !123, file: !122, line: 63, baseType: !70, size: 32, offset: 2240)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_TNCR", scope: !123, file: !122, line: 64, baseType: !70, size: 32, offset: 2272)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_PTCR", scope: !123, file: !122, line: 65, baseType: !61, size: 32, offset: 2304)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "DACC_PTSR", scope: !123, file: !122, line: 66, baseType: !76, size: 32, offset: 2336)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pwm", file: !158, line: 110, baseType: !159)
!158 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_pwm.h", directory: "/home/aaa")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 61, size: 6144, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !193, !197, !198, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !224, !228}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CLK", scope: !159, file: !158, line: 62, baseType: !70, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_ENA", scope: !159, file: !158, line: 63, baseType: !61, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_DIS", scope: !159, file: !158, line: 64, baseType: !61, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SR", scope: !159, file: !158, line: 65, baseType: !76, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IER1", scope: !159, file: !158, line: 66, baseType: !61, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IDR1", scope: !159, file: !158, line: 67, baseType: !61, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IMR1", scope: !159, file: !158, line: 68, baseType: !76, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_ISR1", scope: !159, file: !158, line: 69, baseType: !76, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SCM", scope: !159, file: !158, line: 70, baseType: !70, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !159, file: !158, line: 71, baseType: !79, size: 32, offset: 288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SCUC", scope: !159, file: !158, line: 72, baseType: !70, size: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SCUP", scope: !159, file: !158, line: 73, baseType: !70, size: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SCUPUPD", scope: !159, file: !158, line: 74, baseType: !61, size: 32, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IER2", scope: !159, file: !158, line: 75, baseType: !61, size: 32, offset: 416)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IDR2", scope: !159, file: !158, line: 76, baseType: !61, size: 32, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_IMR2", scope: !159, file: !158, line: 77, baseType: !76, size: 32, offset: 480)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_ISR2", scope: !159, file: !158, line: 78, baseType: !76, size: 32, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OOV", scope: !159, file: !158, line: 79, baseType: !70, size: 32, offset: 544)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OS", scope: !159, file: !158, line: 80, baseType: !70, size: 32, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OSS", scope: !159, file: !158, line: 81, baseType: !61, size: 32, offset: 608)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OSC", scope: !159, file: !158, line: 82, baseType: !61, size: 32, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OSSUPD", scope: !159, file: !158, line: 83, baseType: !61, size: 32, offset: 672)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_OSCUPD", scope: !159, file: !158, line: 84, baseType: !61, size: 32, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FMR", scope: !159, file: !158, line: 85, baseType: !70, size: 32, offset: 736)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FSR", scope: !159, file: !158, line: 86, baseType: !76, size: 32, offset: 768)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FCR", scope: !159, file: !158, line: 87, baseType: !61, size: 32, offset: 800)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FPV", scope: !159, file: !158, line: 88, baseType: !70, size: 32, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FPE1", scope: !159, file: !158, line: 89, baseType: !70, size: 32, offset: 864)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_FPE2", scope: !159, file: !158, line: 90, baseType: !70, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !159, file: !158, line: 91, baseType: !88, size: 64, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_ELMR", scope: !159, file: !158, line: 92, baseType: !192, size: 64, offset: 992)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, elements: !89)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !159, file: !158, line: 93, baseType: !194, size: 352, offset: 1056)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 352, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 11)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_SMMR", scope: !159, file: !158, line: 94, baseType: !70, size: 32, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !159, file: !158, line: 95, baseType: !199, size: 384, offset: 1440)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 384, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 12)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_WPCR", scope: !159, file: !158, line: 96, baseType: !61, size: 32, offset: 1824)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_WPSR", scope: !159, file: !158, line: 97, baseType: !76, size: 32, offset: 1856)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !159, file: !158, line: 98, baseType: !146, size: 224, offset: 1888)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_TPR", scope: !159, file: !158, line: 99, baseType: !70, size: 32, offset: 2112)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_TCR", scope: !159, file: !158, line: 100, baseType: !70, size: 32, offset: 2144)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !159, file: !158, line: 101, baseType: !88, size: 64, offset: 2176)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_TNPR", scope: !159, file: !158, line: 102, baseType: !70, size: 32, offset: 2240)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_TNCR", scope: !159, file: !158, line: 103, baseType: !70, size: 32, offset: 2272)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_PTCR", scope: !159, file: !158, line: 104, baseType: !61, size: 32, offset: 2304)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_PTSR", scope: !159, file: !158, line: 105, baseType: !76, size: 32, offset: 2336)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !159, file: !158, line: 106, baseType: !88, size: 64, offset: 2368)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMP", scope: !159, file: !158, line: 107, baseType: !214, size: 1024, offset: 2432)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 1024, elements: !222)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PwmCmp", file: !158, line: 57, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 52, size: 128, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMPV", scope: !216, file: !158, line: 53, baseType: !70, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMPVUPD", scope: !216, file: !158, line: 54, baseType: !70, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMPM", scope: !216, file: !158, line: 55, baseType: !70, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMPMUPD", scope: !216, file: !158, line: 56, baseType: !70, size: 32, offset: 96)
!222 = !{!223}
!223 = !DISubrange(count: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !159, file: !158, line: 108, baseType: !225, size: 640, offset: 3456)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 640, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 20)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CH_NUM", scope: !159, file: !158, line: 109, baseType: !229, size: 2048, offset: 4096)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 2048, elements: !222)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PwmCh_num", file: !158, line: 50, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 41, size: 256, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CMR", scope: !231, file: !158, line: 42, baseType: !70, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CDTY", scope: !231, file: !158, line: 43, baseType: !70, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CDTYUPD", scope: !231, file: !158, line: 44, baseType: !70, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CPRD", scope: !231, file: !158, line: 45, baseType: !70, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CPRDUPD", scope: !231, file: !158, line: 46, baseType: !70, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_CCNT", scope: !231, file: !158, line: 47, baseType: !70, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_DT", scope: !231, file: !158, line: 48, baseType: !70, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "PWM_DTUPD", scope: !231, file: !158, line: 49, baseType: !70, size: 32, offset: 224)
!241 = !{!242, !246, !252, !258, !267, !269, !309, !0, !311, !314, !316}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "analog_reference", scope: !2, file: !244, line: 45, type: !245, isLocal: false, isDefinition: true)
!244 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_analog.c", directory: "/home/aaa")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "eAnalogReference", file: !6, line: 32, baseType: !5)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_constu, 54, DW_OP_stack_value))
!247 = distinct !DIGlobalVariable(name: "A0", scope: !2, file: !248, line: 182, type: !249, isLocal: true, isDefinition: true)
!248 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/variants/arduino_due_x/variant.h", directory: "/home/aaa")
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !65, line: 42, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !67, line: 28, baseType: !7)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "latestSelectedChannel", scope: !254, file: !244, line: 133, type: !64, isLocal: true, isDefinition: true)
!254 = distinct !DISubprogram(name: "analogRead", scope: !244, file: !244, line: 52, type: !255, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{!64, !64}
!257 = !{}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "channelToChNo", scope: !260, file: !244, line: 291, type: !263, isLocal: true, isDefinition: true)
!260 = distinct !DISubprogram(name: "analogWrite", scope: !244, file: !244, line: 202, type: !261, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !257)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !64, !64}
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 576, elements: !265)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!265 = !{!266}
!266 = !DISubrange(count: 18)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "channelToAB", scope: !260, file: !244, line: 292, type: !263, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "channelToTC", scope: !260, file: !244, line: 293, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 576, elements: !265)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tc", file: !274, line: 69, baseType: !275)
!274 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_tc.h", directory: "/home/aaa")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 58, size: 1856, elements: !276)
!276 = !{!277, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "TC_CHANNEL", scope: !275, file: !274, line: 59, baseType: !278, size: 1536)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 1536, elements: !298)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "TcChannel", file: !274, line: 55, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !274, line: 41, size: 512, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "TC_CCR", scope: !280, file: !274, line: 42, baseType: !70, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "TC_CMR", scope: !280, file: !274, line: 43, baseType: !70, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "TC_SMMR", scope: !280, file: !274, line: 44, baseType: !70, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !280, file: !274, line: 45, baseType: !79, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "TC_CV", scope: !280, file: !274, line: 46, baseType: !70, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "TC_RA", scope: !280, file: !274, line: 47, baseType: !70, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "TC_RB", scope: !280, file: !274, line: 48, baseType: !70, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "TC_RC", scope: !280, file: !274, line: 49, baseType: !70, size: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "TC_SR", scope: !280, file: !274, line: 50, baseType: !70, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "TC_IER", scope: !280, file: !274, line: 51, baseType: !70, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "TC_IDR", scope: !280, file: !274, line: 52, baseType: !70, size: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "TC_IMR", scope: !280, file: !274, line: 53, baseType: !70, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !280, file: !274, line: 54, baseType: !295, size: 128, offset: 384)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 4)
!298 = !{!299}
!299 = !DISubrange(count: 3)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "TC_BCR", scope: !275, file: !274, line: 60, baseType: !61, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "TC_BMR", scope: !275, file: !274, line: 61, baseType: !70, size: 32, offset: 1568)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "TC_QIER", scope: !275, file: !274, line: 62, baseType: !61, size: 32, offset: 1600)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "TC_QIDR", scope: !275, file: !274, line: 63, baseType: !61, size: 32, offset: 1632)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "TC_QIMR", scope: !275, file: !274, line: 64, baseType: !76, size: 32, offset: 1664)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "TC_QISR", scope: !275, file: !274, line: 65, baseType: !76, size: 32, offset: 1696)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "TC_FMR", scope: !275, file: !274, line: 66, baseType: !70, size: 32, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !275, file: !274, line: 67, baseType: !88, size: 64, offset: 1760)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "TC_WPMR", scope: !275, file: !274, line: 68, baseType: !70, size: 32, offset: 1824)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "channelToId", scope: !260, file: !244, line: 297, type: !263, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "_writeResolution", scope: !2, file: !244, line: 26, type: !313, isLocal: true, isDefinition: true)
!313 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "PWMEnabled", scope: !2, file: !244, line: 192, type: !250, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "TCChanEnabled", scope: !2, file: !244, line: 193, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 72, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 9)
!321 = !{i32 7, !"Dwarf Version", i32 4}
!322 = !{i32 2, !"Debug Info Version", i32 3}
!323 = !{i32 1, !"wchar_size", i32 4}
!324 = !{i32 1, !"min_enum_size", i32 1}
!325 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!326 = distinct !DISubprogram(name: "analogReadResolution", scope: !244, file: !244, line: 28, type: !327, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !257)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !313}
!329 = !DILocalVariable(name: "res", arg: 1, scope: !326, file: !244, line: 28, type: !313)
!330 = !DILocation(line: 28, column: 31, scope: !326)
!331 = !DILocation(line: 29, column: 20, scope: !326)
!332 = !DILocation(line: 29, column: 18, scope: !326)
!333 = !DILocation(line: 30, column: 1, scope: !326)
!334 = distinct !DISubprogram(name: "analogWriteResolution", scope: !244, file: !244, line: 32, type: !327, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !257)
!335 = !DILocalVariable(name: "res", arg: 1, scope: !334, file: !244, line: 32, type: !313)
!336 = !DILocation(line: 32, column: 32, scope: !334)
!337 = !DILocation(line: 33, column: 21, scope: !334)
!338 = !DILocation(line: 33, column: 19, scope: !334)
!339 = !DILocation(line: 34, column: 1, scope: !334)
!340 = distinct !DISubprogram(name: "analogReference", scope: !244, file: !244, line: 47, type: !341, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !257)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !245}
!343 = !DILocalVariable(name: "ulMode", arg: 1, scope: !340, file: !244, line: 47, type: !245)
!344 = !DILocation(line: 47, column: 39, scope: !340)
!345 = !DILocation(line: 49, column: 21, scope: !340)
!346 = !DILocation(line: 49, column: 19, scope: !340)
!347 = !DILocation(line: 50, column: 1, scope: !340)
!348 = !DILocalVariable(name: "ulPin", arg: 1, scope: !254, file: !244, line: 52, type: !64)
!349 = !DILocation(line: 52, column: 30, scope: !254)
!350 = !DILocalVariable(name: "ulValue", scope: !254, file: !244, line: 54, type: !64)
!351 = !DILocation(line: 54, column: 12, scope: !254)
!352 = !DILocalVariable(name: "ulChannel", scope: !254, file: !244, line: 55, type: !64)
!353 = !DILocation(line: 55, column: 12, scope: !254)
!354 = !DILocation(line: 57, column: 7, scope: !355)
!355 = distinct !DILexicalBlock(scope: !254, file: !244, line: 57, column: 7)
!356 = !DILocation(line: 57, column: 13, scope: !355)
!357 = !DILocation(line: 57, column: 7, scope: !254)
!358 = !DILocation(line: 58, column: 11, scope: !355)
!359 = !DILocation(line: 58, column: 5, scope: !355)
!360 = !DILocation(line: 60, column: 33, scope: !254)
!361 = !DILocation(line: 60, column: 15, scope: !254)
