; ModuleID = '/home/aaa/llvm-arduino-due/build/core/wiring_digital.c.o.ll'
source_filename = "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_digital.c"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-ebi"

%struct._PinDescription = type { %struct.Pio*, i32, i32, i8, i32, i32, i8, i8, i8, i8 }
%struct.Pio = type { i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, [3 x i32], i32, i32, i32, i32, [4 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32, [1 x i32], i32, i32, i32 }
%struct.Adc = type { i32, i32, i32, i32, i32, i32, i32, [1 x i32], i32, i32, i32, i32, i32, [2 x i32], i32, i32, i32, i32, i32, [16 x i32], [1 x i32], i32, [19 x i32], i32, i32, [5 x i32], i32, i32, [2 x i32], i32, i32, [2 x i32], i32, i32 }

@g_APinDescription = external dso_local constant [0 x %struct._PinDescription], align 4
@g_pinStatus = external dso_local global [0 x i8], align 1

; Function Attrs: noinline nounwind optnone
define dso_local arm_aapcscc void @pinMode(i32 %ulPin, i32 %ulMode) #0 !dbg !84 {
entry:
  %ret_ptr = alloca [12 x i8], align 1
  %ptr = alloca i8*, align 4
  %ptr2 = alloca i8*, align 4
  %i = alloca i32, align 4
  %ulPin.addr = alloca i32, align 4
  %ulMode.addr = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/aaa/.arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_digital.c", directory: "/home/aaa/llvm-arduino-due")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_EPioType", file: !4, line: 44, baseType: !5, size: 8, elements: !6)
!4 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/libsam/include/pio.h", directory: "/home/aaa")
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "PIO_NOT_A_PIN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "PIO_PERIPH_A", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "PIO_PERIPH_B", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "PIO_INPUT", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "PIO_OUTPUT_0", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "PIO_OUTPUT_1", value: 5, isUnsigned: true)
!13 = !{!14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Adc", file: !16, line: 76, baseType: !17)
!16 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/component/component_adc.h", directory: "/home/aaa")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 41, size: 2368, elements: !18)
!18 = !{!19, !28, !30, !31, !32, !33, !34, !37, !41, !42, !43, !44, !45, !46, !50, !51, !52, !53, !54, !55, !59, !60, !61, !65, !66, !67, !71, !72, !73, !74, !75, !76, !77, !78}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CR", scope: !17, file: !16, line: 42, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "WoReg", file: !21, line: 53, baseType: !22)
!21 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/system/CMSIS/Device/ATMEL/sam3xa/include/sam3x8e.h", directory: "/home/aaa")
!22 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !24, line: 66, baseType: !25)
!24 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/stdint.h", directory: "/home/aaa")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !26, line: 56, baseType: !27)
!26 = !DIFile(filename: ".arduino15/packages/arduino/tools/arm-none-eabi-gcc/4.8.3-2014q1/arm-none-eabi/include/machine/_default_types.h", directory: "/home/aaa")
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_MR", scope: !17, file: !16, line: 43, baseType: !29, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "RwReg", file: !21, line: 54, baseType: !22)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_SEQR1", scope: !17, file: !16, line: 44, baseType: !29, size: 32, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_SEQR2", scope: !17, file: !16, line: 45, baseType: !29, size: 32, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHER", scope: !17, file: !16, line: 46, baseType: !20, size: 32, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHDR", scope: !17, file: !16, line: 47, baseType: !20, size: 32, offset: 160)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CHSR", scope: !17, file: !16, line: 48, baseType: !35, size: 32, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg", file: !21, line: 49, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !17, file: !16, line: 49, baseType: !38, size: 32, offset: 224)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_LCDR", scope: !17, file: !16, line: 50, baseType: !35, size: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IER", scope: !17, file: !16, line: 51, baseType: !20, size: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IDR", scope: !17, file: !16, line: 52, baseType: !20, size: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_IMR", scope: !17, file: !16, line: 53, baseType: !35, size: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_ISR", scope: !17, file: !16, line: 54, baseType: !35, size: 32, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !17, file: !16, line: 55, baseType: !47, size: 64, offset: 416)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_OVER", scope: !17, file: !16, line: 56, baseType: !35, size: 32, offset: 480)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_EMR", scope: !17, file: !16, line: 57, baseType: !29, size: 32, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CWR", scope: !17, file: !16, line: 58, baseType: !29, size: 32, offset: 544)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CGR", scope: !17, file: !16, line: 59, baseType: !29, size: 32, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_COR", scope: !17, file: !16, line: 60, baseType: !29, size: 32, offset: 608)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_CDR", scope: !17, file: !16, line: 61, baseType: !56, size: 512, offset: 640)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !17, file: !16, line: 62, baseType: !38, size: 32, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_ACR", scope: !17, file: !16, line: 63, baseType: !29, size: 32, offset: 1184)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !17, file: !16, line: 64, baseType: !62, size: 608, offset: 1216)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 608, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 19)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_WPMR", scope: !17, file: !16, line: 65, baseType: !29, size: 32, offset: 1824)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_WPSR", scope: !17, file: !16, line: 66, baseType: !35, size: 32, offset: 1856)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !17, file: !16, line: 67, baseType: !68, size: 160, offset: 1888)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 5)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RPR", scope: !17, file: !16, line: 68, baseType: !29, size: 32, offset: 2048)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RCR", scope: !17, file: !16, line: 69, baseType: !29, size: 32, offset: 2080)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !17, file: !16, line: 70, baseType: !47, size: 64, offset: 2112)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RNPR", scope: !17, file: !16, line: 71, baseType: !29, size: 32, offset: 2176)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_RNCR", scope: !17, file: !16, line: 72, baseType: !29, size: 32, offset: 2208)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !17, file: !16, line: 73, baseType: !47, size: 64, offset: 2240)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_PTCR", scope: !17, file: !16, line: 74, baseType: !20, size: 32, offset: 2304)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_PTSR", scope: !17, file: !16, line: 75, baseType: !35, size: 32, offset: 2336)
!79 = !{i32 7, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{i32 1, !"wchar_size", i32 4}
!82 = !{i32 1, !"min_enum_size", i32 1}
!83 = !{!"clang version 10.0.1 (http://khuhub.khu.ac.kr/2020-1-capstone-design1/JJS_Project1.git fa09a32a02e425f42aa5254b8429818823ef46b2)"}
!84 = distinct !DISubprogram(name: "pinMode", scope: !85, file: !85, line: 25, type: !86, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !88)
!85 = !DIFile(filename: ".arduino15/packages/arduino/hardware/sam/1.6.12/cores/arduino/wiring_digital.c", directory: "/home/aaa")
!86 = !DISubroutineType(types: !87)
!87 = !{null, !23, !23}
!88 = !{}
!89 = !DILocalVariable(name: "ulPin", arg: 1, scope: !84, file: !85, line: 25, type: !23)
!90 = !DILocation(line: 25, column: 31, scope: !84)
!91 = !DILocalVariable(name: "ulMode", arg: 2, scope: !84, file: !85, line: 25, type: !23)
!92 = !DILocation(line: 25, column: 47, scope: !84)
!93 = !DILocation(line: 27, column: 25, scope: !94)
!94 = distinct !DILexicalBlock(scope: !84, file: !85, line: 27, column: 7)
!95 = !DILocation(line: 27, column: 7, scope: !94)
!96 = !DILocation(line: 27, column: 32, scope: !94)
!97 = !DILocation(line: 27, column: 42, scope: !94)
!98 = !DILocation(line: 27, column: 7, scope: !84)
!99 = !DILocation(line: 29, column: 9, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !85, line: 28, column: 5)
!101 = !DILocation(line: 32, column: 20, scope: !102)
!102 = distinct !DILexicalBlock(scope: !84, file: !85, line: 32, column: 7)
!103 = !DILocation(line: 32, column: 8, scope: !102)
!104 = !DILocation(line: 32, column: 27, scope: !102)
!105 = !DILocation(line: 32, column: 34, scope: !102)
!106 = !DILocation(line: 32, column: 7, scope: !84)
!107 = !DILocation(line: 34, column: 51, scope: !108)
!108 = distinct !DILexicalBlock(scope: !102, file: !85, line: 33, column: 5)
!109 = !DILocation(line: 34, column: 33, scope: !108)
!110 = !DILocation(line: 34, column: 58, scope: !108)
!111 = !DILocation(line: 34, column: 7, scope: !108)
!112 = !DILocation(line: 35, column: 5, scope: !108)
!113 = !DILocation(line: 37, column: 20, scope: !114)
!114 = distinct !DILexicalBlock(scope: !84, file: !85, line: 37, column: 7)
!115 = !DILocation(line: 37, column: 8, scope: !114)
!116 = !DILocation(line: 37, column: 27, scope: !114)
!117 = !DILocation(line: 37, column: 34, scope: !114)
!118 = !DILocation(line: 37, column: 62, scope: !114)
!119 = !DILocation(line: 37, column: 77, scope: !114)
!120 = !DILocation(line: 37, column: 65, scope: !114)
!121 = !DILocation(line: 37, column: 84, scope: !114)
!122 = !DILocation(line: 37, column: 7, scope: !84)
!123 = !DILocation(line: 40, column: 25, scope: !124)
!124 = distinct !DILexicalBlock(scope: !125, file: !85, line: 40, column: 11)
!125 = distinct !DILexicalBlock(scope: !114, file: !85, line: 38, column: 5)
!126 = !DILocation(line: 40, column: 13, scope: !124)
!127 = !DILocation(line: 40, column: 32, scope: !124)
!128 = !DILocation(line: 40, column: 39, scope: !124)
!129 = !DILocation(line: 40, column: 67, scope: !124)
!130 = !DILocation(line: 40, column: 70, scope: !124)
!131 = !DILocation(line: 40, column: 77, scope: !124)
!132 = !DILocation(line: 40, column: 87, scope: !124)
!133 = !DILocation(line: 41, column: 25, scope: !124)
!134 = !DILocation(line: 41, column: 13, scope: !124)
!135 = !DILocation(line: 41, column: 32, scope: !124)
!136 = !DILocation(line: 41, column: 39, scope: !124)
!137 = !DILocation(line: 41, column: 74, scope: !124)
!138 = !DILocation(line: 41, column: 77, scope: !124)
!139 = !DILocation(line: 41, column: 84, scope: !124)
!140 = !DILocation(line: 41, column: 101, scope: !124)
!141 = !DILocation(line: 42, column: 25, scope: !124)
!142 = !DILocation(line: 42, column: 13, scope: !124)
!143 = !DILocation(line: 42, column: 32, scope: !124)
